[
  {
    "title": "Gutter clean town house",
    "text": "Superb job done at a great price. Had several companies round to quote but were unable to do the job as our house is on 3 stories. Luckily EVO had the right equipment to clean the gutters at high level, and have done a superb job. Have already recommended to both my neighbours.",
    "date": "2021-02-28",
    "postcode": "BN1"
  },
  {
    "title": "Replace failing soakaway",
    "text": "Harvey and his team were absolutely superb. We had had soakaway issues since we moved in to the property 2 years ago. We had had several failed attempts with other companies, but as soon as EVO arrived on site and did their assessment I knew we were in safe hands. The job was not easy because of the garden layout, but EVO managed to replace the soakaway and carry out a full reinstatement, that, within 2 weeks of completion, you wouldn't have known any work had been done. British workmanship at it's best!",
    "date": "2021-02-01",
    "postcode": "RH10"
  },
  {
    "title": "Survey at rear of property to check for leaking drains",
    "text": "I have to thank EVO for their honesty and integrity. Prior to buying our property a survey performed by another company had reported a problem to the sewage foul drainage pipe run at the rear of the property. EVO came round to quote for this work, first performing a survey and drains test to enable them to gauge for themselves the extent of the work. Thankfully the survey and test revealed the drains were not leaking at all. I thank EVO for their honest opinion. Come highly recommended",
    "date": "2021-02-01",
    "postcode": "RH10"
  },
  {
    "title": "Powerflush of heating system and fitting magnetic filter",
    "text": "I was advised by our boiler manufacturer that our central heating system needed a power flush to correct a boiler heat exchanger issue, which would then need to be changed. I contacted EVO along with several other companies and it was quite clear from the outset that EVO plumbing and heating had far better experience and technical expertise than any of the others. The work was carried out exactly as described, in a very professional, clean, and commendable fashion. Now the powerflush is complete, not only is my heating now hotter and more efficient than ever, but it also seems to have fixed the issue with the heat exchanger!",
    "date": "2020-12-12",
    "postcode": "GU7"
  },
  {
    "title": "Drainage excavation and repair",
    "text": "Have nothing but praise for the way EVO handled the urgent drain repair at my mum's house. They were brilliant throughout and completed the work in a very timely fashion which was a massive relief for us all.",
    "date": "2020-12-01",
    "postcode": "GU1"
  },
  {
    "title": "emergency leak repair through ceiling",
    "text": "We were very anxious to call an emergency plumber due to our age and the current COVID crisis. Harvey was very aware of our anxieties and did not only an excellent job with the plumbing repair, but also following recommended COVID protocol to make us feel safe and secure whilst he carried out the repair. We are extremely grateful for this.",
    "date": "2020-12-01",
    "postcode": "CR3"
  },
  {
    "title": "Powerflush heating system and fit magnetic filter",
    "text": "Quality service from a company that really know their stuff. Previous people had been unable to diagnose and rectify problem. Called on Harvey from EVO after a personal recommendation from a friend. We now have full heat throughout house.",
    "date": "2020-11-30",
    "postcode": "BN7"
  },
  {
    "title": "Gas check of oven and hob, replacement of hob and compliance of safety regulations",
    "text": "British craftsmanship is alive and well. Excellent diagnostics skills. Work efficiently and effectively undertaken",
    "date": "2020-11-01",
    "postcode": "RH1"
  },
  {
    "title": "Fit three new radiators.",
    "text": "Nathan did a fantastic job. He explained exactly what if he was doing and always asked our opinion if there was an option about how something could be done. He was very polite and knowledgeable, offering us advice about optimum boiler settings, positioning of thermostat and how radiators could be removed for decorating in the future. He did all this whilst remaining COVID-Safe. I would 100% recommend and would definitely use again. Many thanks",
    "date": "2020-11-01",
    "postcode": "RH16"
  },
  {
    "title": "One radiator removed - a new radiator installed in a different place. New thermostats on 5 radiators.",
    "text": "I was delighted in everyway with the work completed and also with how helpful Nathan was. He kept me fully informed both before the appointment and also on the day. I will definitely be using this company again and would recommend them.",
    "date": "2020-11-01",
    "postcode": "GU1"
  },
  {
    "title": "Install kitchen tap",
    "text": "Nathan did a very good job installing my kitchen tap. He always observed Covid restrictions while working. I will definitely be using Evo for my heating and plumbing in the future",
    "date": "2020-11-01",
    "postcode": "RH12"
  },
  {
    "title": "Toilet flush repair",
    "text": "Called out very late on a saturday evening. All work done well and quietly. Great clearing up afterwards.",
    "date": "2020-11-01",
    "postcode": "RH4"
  },
  {
    "title": "Unblock kitchen sink",
    "text": "Called at 9.30,arrived within the hour, quickly identified and fixed problem quietly and efficiently. Very good service",
    "date": "2020-11-01",
    "postcode": "RH10"
  },
  {
    "title": "Repair damaged drain at side of property",
    "text": "We were worried that the drainage repair would be messy and problematic, but needn't of worried as the service and quality of work was excellent. Would definitely recommend this company to all others.",
    "date": "2020-11-01",
    "postcode": "RH10"
  },
  {
    "title": "Put new tap in and cleared waste pipe",
    "text": "EVO were excellent. Very good job, very polite and thorough. Stephen made good recommendations on a few other plumbing and heating matters that we will be acting on. Stephen was very knowledgeable and gave excellent advice on how we can run our worcester boiler more efficiently.",
    "date": "2020-11-01",
    "postcode": "RH20"
  },
  {
    "title": "Install new soakaway",
    "text": "We are so grateful to EVO. We had originally employed another company to undertake the work, but were badly let down. After struggling to find another company with the necessary expertise, we contacted EVO drainage following a recommendation from a work colleague. They were professional throughout, and were brilliant for our stress levels. Come highly recommended.",
    "date": "2020-11-01",
    "postcode": "GU1"
  },
  {
    "title": "First fix of bathroom pipework",
    "text": "My partner and I have been putting in a new bathroom but wanted a professional plumbing company to do the first fix of all pipework and drainage to make sure it was done properly. EVO were excellent. We approached other plumbers who were either not interested or too expensive. EVO did a superb job, fitting work in around us, and made it vey easy for us to be able to do the second fix and finishing touches ourselves. We will be using EVO again to update our central heating system.",
    "date": "2020-10-11",
    "postcode": "BN7"
  },
  {
    "title": "Powerflush heating system to improve heat distribution",
    "text": "Steve and EVO originally came to fix a circulation problem with heat not getting to all radiators. Steve diagnosed a powerflush was required, and I must say our house has never been so warm!. Excellent work!",
    "date": "2020-10-10",
    "postcode": "RH12"
  },
  {
    "title": "Supply and fit replacement boiler, powerflush system",
    "text": "Excellent service throughout. Other companies had shied away from the job because of the complexity of updating our very old system. Very pleased to have found an honest and hard working company who are clearly ahead of the competition in so many ways!",
    "date": "2020-10-06",
    "postcode": "RH12"
  },
  {
    "title": "Boiler Service and gas safety",
    "text": "After speaking with Harvey, I told him it was fairly urgent. Not only he accommodated my request, he fitted around my schedule and promptly on time. All specialised equipment was used to carry out necessary checks and Harvey's approach and attention to detail was impeccable. I would definitely use them again.",
    "date": "2020-10-06",
    "postcode": "KT22"
  },
  {
    "title": "Kitchen sink taps replaced and stabiliser bar fitted under sink",
    "text": "Mark was very efficient, worked quietly and went out of his way to ensure the work was carried out to a good standard. I have used Evo plumbers before, Steve, Harvey and Mark make a great team. I can thoroughly recommend them.",
    "date": "2020-10-02",
    "postcode": "RH16"
  },
  {
    "title": "Gutters cleaned around entire house",
    "text": "EVO did a superb job. We have a vey large conservatory at the rear of our house that makes access for cleaning with ladders virtually impossible. Over the years moss and silt had built up throughout the entire length off the run, causing water to hammer down on to the glass roof every time it rained. We had originally called EVO to sort out a plumbing job, and had mentioned the gutter problem in passing. So glad I did as they had a camera and vacuum and pole system that enabled them to clean the entire length. So pleased!",
    "date": "2020-10-01",
    "postcode": "RH4"
  },
  {
    "title": "Fixing toilet leak",
    "text": "Very reliable and did a superb job fixing a leak in a very inaccessible position.",
    "date": "2020-10-01",
    "postcode": "RH16"
  },
  {
    "title": "Fix leak under bath",
    "text": "Great work. Quick response, polite tidy, and good value. Quality of service cannot be faulted",
    "date": "2020-10-01",
    "postcode": "BN6"
  },
  {
    "title": "Repair to old boiler ",
    "text": "So please we contacted EVO. our usual plumbing company had told us they were unable to get the part needed. Only contacted EVO for a second opinion really, and they were not only able to source the part, but repaired on same day too. We shall be using EVO from now on, not only for their professionalism, but for their honesty and integrity too.",
    "date": "2020-10-01",
    "postcode": "RH10"
  },
  {
    "title": "Resealed shower tray and cleared drainage pipes",
    "text": "The work was done to a very high standard I would be very happy to use them again.",
    "date": "2020-10-01",
    "postcode": "RH12"
  },
  {
    "title": "Changed the main tap in the kitchen as it was leaking",
    "text": ". Had real trouble finding a plumber. Nathan was really excellent, very professional and courteous, I would definitely recommend them.",
    "date": "2020-10-01",
    "postcode": "TN22"
  },
  {
    "title": "Change ceramic cartridges on bathroom taps",
    "text": "So glad we have been able to find a plumbing and heating company that are reliable and happy to take on smaller jobs as well as bigger jobs too. EVO have ",
    "date": "2020-10-01",
    "postcode": "BN3"
  },
  {
    "title": "Clear blockage and fix leak from drain",
    "text": "Very Impressed with all round service. Called early on a Saturday morning and the blocked drain had been cleared and area tidied before midday.",
    "date": "2020-10-01",
    "postcode": "RH12"
  },
  {
    "title": "Cleared badly blocked drain",
    "text": "EVO were unbelievable. We had raw sewage spilling over from a manhole on our drive. We struggled to find a drainage company who coud attend same day, but EVO came round literally within an hour of being contacted. Not only was the drain sorted very quickly, but Harvey tidied the entire area before leaving. Brilliant service.",
    "date": "2020-10-01",
    "postcode": "RH10"
  },
  {
    "title": "Replacement of Pump, amendments to pipework and a central heating system flush",
    "text": "Nathan from Evo Plumbing and Heating was excellent! He worked very hard all day, was updating me throughout the day on progress and what he was doing and finding with regards to the problem on our heating system. He had to get under floor boards but took great care with getting flooring up to gain access and cleared and put everything back as it was found (in fact it was probably a bit cleaner when he left if truth be known!). I would have no hesitation recommending Evo Plumbing as this is the 2nd time I've used them and both times they have been excellent.",
    "date": "2020-10-01",
    "postcode": "RH10"
  },
  {
    "title": "New washing machine valve fitted. Hot valve capped.",
    "text": "My second time using Evo plumbing . Pleased with the quality of the work done and the friendly, professional young man. Explained what he was doing and cleaned up afterwards. Reasonable price will use Evo plumbers again.",
    "date": "2020-10-01",
    "postcode": "GU6"
  },
  {
    "title": "Clearance of blockage in stack pipe",
    "text": "The stack pipe in our shared block of flats was totally blocked meaning no one in the block could use any facilities. We we getting desperate as a plumber and another drainage company had not been able to clear the blockage. I called EVO drainage after a personal recommendation and must say they were excellent. The blockage was cleared very quickly meaning we could wash and uses our toilets again.",
    "date": "2020-10-01",
    "postcode": "BN1"
  },
  {
    "title": "EVO took out an old shower fitting and fitted a new one and also replaced a dripping tap cartridge and hose",
    "text": "Punctual, courteous, he completed the work very well and overall my wife and I thought he had a good attitude",
    "date": "2020-10-01",
    "postcode": "RH16"
  },
  {
    "title": "Cleared blockage in kitchen pipe",
    "text": "Nice neat and tidy work. Punctual and polite. Would recommend them to friends and family",
    "date": "2020-10-01",
    "postcode": "RH1"
  },
  {
    "title": "Replaced central heating pump",
    "text": "Nathan came out to fix our central heating. He quickly identified the problem and replaced our central heating pump. What really impressed me was how thorough he was, and how he was willing to discuss in depth the different options for sorting out our dysfunctional heating system definitively. Very likely to get work done with them in future",
    "date": "2020-10-01",
    "postcode": "RH15"
  },
  {
    "title": "Shower unit removal and replacement",
    "text": "Very helpful in setting up appointment at a convenient time. Mark arrived on time, was polite and courteous and completed the work on time and to a very good standard. Faultless :)",
    "date": "2020-10-01",
    "postcode": "RH1"
  },
  {
    "title": "Stop cock and washing machine valve/tap replacement",
    "text": "Mark ensured that he reached me on the day specified and the work he carried out was of a high quality. This is the second time EVO plumbing has done some work for me and both times they have been very professional, clean, tidy and polite. Recommended.",
    "date": "2020-10-01",
    "postcode": "RH2"
  },
  {
    "title": "Leaking drain valve on radiator",
    "text": "Fast, efficient, tidy, good communications - can't fault it really. I shall be using them for all my plumbing and heating requirements from now on",
    "date": "2020-10-01",
    "postcode": "RH15"
  },
  {
    "title": "boiler service and Powerflush 21 radiator heating system",
    "text": "Our house has always struggled with heating all areas of our house properly. As part of a boiler service, Harvey noticed the water in the system was of poor quality so arranged to powerflush the system 3 days later. So glad we took his advice. We have now have to turn down radiators that had previously struggled to function at all. Harvey is one of a team of EVO engineers who have worked at our property. The company is so reliable and all the guys really know their stuff!",
    "date": "2020-10-01",
    "postcode": "RH2"
  },
  {
    "title": "Fitted kitchen sink",
    "text": "Did a great job on fitting the kitchen sink an adapting the plumbing and drainage under the unit. Really professional service. I would recommend them and would use them again",
    "date": "2020-10-01",
    "postcode": "GU14"
  },
  {
    "title": "Powerflush heating system. Fit magnetic filter and thermostatic radiator valves",
    "text": "Following problems with our heating system EVO plumbing and heating were recommended to me by another heating company. Nathan arrived and carried out a full assessment of our heating system, including a water quality test that showed the system required a flush. We now have a system that is brilliant. There are no longer any cold spots throughout the house and because Nathan fitted thermostatic valves we have the flexibility to easily adjust each room's temperature to our requirements. Must say, the service from EVO and Nathan has been excellent.",
    "date": "2020-10-01",
    "postcode": "GU14"
  },
  {
    "title": "Securing outside tap for the autumn/winter",
    "text": "Mr. Turtle arrived promptly, he knew what to do, and the job was finished very quickl",
    "date": "2020-10-01",
    "postcode": "RH2"
  },
  {
    "title": "Drain clearance and sewage clear up",
    "text": "Contacted EVO via Checkatrade after finding out my tenants drain was blocked. Needed it resolved ASAP. EVO were able to visit the following day. They were friendly, courteous, polite and, most importantly, sorted out the blockage! The price for the job was reasonable as well. 10 out of 10. Would 100% use again and would definitely recommend. Thank you EVO.",
    "date": "2020-10-01",
    "postcode": "BN7"
  },
  {
    "title": "Trace and resolve bathroom leak",
    "text": "It is so refreshing dealing with a company as reliable and dependent as Harvey and EVO plumbing. From the first call to job resolution they were polite, friendly and reliable. The plumbing repair work was carried out quickly, to a high standard, and at reasonable cost. Total professionals!",
    "date": "2020-09-12",
    "postcode": "GU14"
  },
  {
    "title": "Old radiator removed and new one installed",
    "text": "Work was done to a high standard with clear communication of options available. The new radiator was very heavy and a support had to be made which was done superbly. The plumber was extremely knowledgeable and instilled confidence.",
    "date": "2020-09-10",
    "postcode": "RH15"
  },
  {
    "title": "Poweflush heating system prior to new boiler",
    "text": "EVO did an amazing job. A powerflush was required as part of the warranty on our new boiler. Contacted EVO who put in a very competitive quote, and the attention to detail in the work was brilliant! ",
    "date": "2020-09-10",
    "postcode": "RH15"
  },
  {
    "title": "Bathroom leak repaired",
    "text": "Very impressed - plumber inspired confidence and was pleasant and very efficient",
    "date": "2020-09-01",
    "postcode": "BN1"
  },
  {
    "title": "Fixed broken shower controls",
    "text": "Amazing service!! Super fast arrival to an emergency water leak- Mark was fantastic and really professional. Thank you! Will definitely recommend!!",
    "date": "2020-09-01",
    "postcode": "RH6"
  },
  {
    "title": "Boiler service and fit magnetic filter",
    "text": "Second time I have used EVO. Brilliant service once more",
    "date": "2020-09-01",
    "postcode": "GU14"
  },
  {
    "title": "New toilet cistern",
    "text": "Excellent first class job. Previous cistern from our only toilet was badly cracked and leaking. So pleased EVO plumbing were able to do this as a priority as we are both elderly and reliant on our toilet. Done without drama and in a careful manner.",
    "date": "2020-08-28",
    "postcode": "BN25"
  },
  {
    "title": "New ball valve in cold water tank",
    "text": "Mark was punctual, polite, tidy, and carried out his work efficiently. He also advised me about a couple of other plumbing -related issues before leaving. Excellent job - will use again. Many thanks, Marl and EVO",
    "date": "2020-08-28",
    "postcode": "RH12"
  },
  {
    "title": "New ball vale and isolate valve for cold storage tank",
    "text": "Simple but awkward job that was well done. EVO responded well to my initial enquiry, kept me updated of arrival, and there were no horrible surprises when it came to payment.",
    "date": "2020-08-07",
    "postcode": "GU1"
  },
  {
    "title": "Clearing down pipe",
    "text": "Work was carried out quickly and effectively, and the job was completed as per the original quoted price.",
    "date": "2020-08-07",
    "postcode": "RH15"
  },
  {
    "title": "Fix emergency leak, replace stopcock",
    "text": "EVO helped me in desperate circumstances as water was covering the kitchen floor. Very helpful, friendly and efficient.",
    "date": "2020-08-07",
    "postcode": "KT17"
  },
  {
    "title": "Powerflush of heating system to restore working boiler",
    "text": "Excellent work throughout. Did exactly as they said with fantastic results, were tidy and kept us informed from first booking to completion. Will definitely use again and recommend",
    "date": "2020-08-06",
    "postcode": "GU14"
  },
  {
    "title": "Unblocking of sink, checking of leaking dishwasher, replacement of flush valve",
    "text": "Punctual, tidy, professional",
    "date": "2020-08-06",
    "postcode": "RH10"
  },
  {
    "title": "New Soakaway",
    "text": "Absolutely superb job completed in extremely challenging and testing conditions. the work had to be completed by hand due to access constraints, and was executed brilliantly!",
    "date": "2020-08-06",
    "postcode": "GU1"
  },
  {
    "title": "Balancing radiators",
    "text": "Harvey did a great job. He explained what he was doing and why. Very polite and tidy too. Top notch service.",
    "date": "2020-08-01",
    "postcode": "RH10"
  },
  {
    "title": "Repair to our ageing boiler",
    "text": "Was able to supply and source parts for our system that 2 other companies had said was beyond repair. Obviously we are very pleased with all aspects of the work and shall definitely be using EVO when we do eventually decide to update our boiler",
    "date": "2020-07-06",
    "postcode": "RH15"
  },
  {
    "title": "New fill valve fitted in wc",
    "text": "Very courteous, neat and careful work. Transparent and fair pricing.",
    "date": "2020-07-06",
    "postcode": "BN42"
  },
  {
    "title": "Fixed leak on heating system",
    "text": "Arrived sooner than expected. Located my issue promptly and dealt with it professionally. I would recommend.",
    "date": "2020-07-06",
    "postcode": "RH10"
  },
  {
    "title": "Emergency repair of burst radiator leak. Removal of radiator. Repair of over flow from",
    "text": "Very Professional, Enthusiastic to do a good job. Helpful and friendly",
    "date": "2020-07-06",
    "postcode": "KT22"
  },
  {
    "title": "Renewed Ball Valve to old water tank",
    "text": "Prompt ,efficient and fairly priced task carried out in a pleasant manner on a Sunday",
    "date": "2020-07-06",
    "postcode": "KT20"
  },
  {
    "title": "emergency toilet repair",
    "text": "I had a toilet that needed urgent repair and Mark attended to resolve the issue. What initially appeared to be a simple issue turned out to be a compete nightmare job that was awkward in every way. Mark was absolutely brilliant, singlehandedly finding resolutions to every challenge, whilst working in a 30+ degree heatwave with no windows in a cramped environment... A few weeks later, I had a separate issue that needed looking at, and I didn't hesitate to book Evo again, asking specifically for Mark. Once again, he was brilliant and fully resolved the issue perfectly. Thank you Mark!",
    "date": "2020-07-06",
    "postcode": "BN1"
  },
  {
    "title": "New Kitchen tap",
    "text": "The plumber was very polite and conscientious. He did the job steadily and efficiently, and cleaned up after himself. I would definitely consider using this company again, and will recommend them to others.",
    "date": "2020-07-06",
    "postcode": "RH6"
  },
  {
    "title": "Leak in bathroom taps ",
    "text": "EVO provided excellent communication and the job well executed. Very happy with the end results.",
    "date": "2020-07-06",
    "postcode": "GU14"
  },
  {
    "title": "Put new basin in bathroom",
    "text": "Excellent work, very pleased, very pleasant and hard working young man who worked to very high standards.",
    "date": "2020-07-06",
    "postcode": "GU7"
  },
  {
    "title": "Replace 2 sink taps and basin",
    "text": "EVO came to replace two ancient taps and basin in our downstairs cloakroom. Both Mark and Steve were friendly and professional throughout and handled the job very well. I would be happy to use the firm again",
    "date": "2020-06-06",
    "postcode": "GU22"
  },
  {
    "title": "Replace leaking mixer tap",
    "text": "First class response. Very friendly, courteous and efficient service.",
    "date": "2020-06-06",
    "postcode": "CR6"
  },
  {
    "title": "Fit new garden tap",
    "text": "I was very pleased with this young plumber who fitted a new garden tap for us. We have just had a very bad experience with other tradespeople so were glad we found an honest and reliable company.",
    "date": "2020-06-06",
    "postcode": "KT22"
  },
  {
    "title": "Replaced concealed cistern",
    "text": "Harvey removed a broken cistern and replaced it with a new one in a space which was very difficult to access. Harvey was courteous and carried out the work in a professional manner.",
    "date": "2020-06-06",
    "postcode": "RH19"
  },
  {
    "title": "Emergency callout to fix leak",
    "text": "Called to emergency leak even though committed on another job came quickly and resolved the issue. Very impressed with work.",
    "date": "2020-06-06",
    "postcode": "RH15"
  },
  {
    "title": "Fitted a tap and replacement tap.",
    "text": "Great service yet again from a thoroughly reliable company.",
    "date": "2020-06-06",
    "postcode": "CR3"
  },
  {
    "title": "Locate leak in sealed heating system",
    "text": "Prompt and efficient service. Excellent work. We had been very worried about this issue and great to have it sorted so seamlessly.",
    "date": "2020-06-06",
    "postcode": "RH12"
  },
  {
    "title": "Outside tap replacement",
    "text": "Quick service, good customer service and work completed to high standard.",
    "date": "2020-06-06",
    "postcode": "RH16"
  },
  {
    "title": "Servicepour boiler",
    "text": "Stephen is efficient, polite, affordable and a great worker. Thanks so much. He is a brilliant plumber.",
    "date": "2020-06-06",
    "postcode": "RH14"
  },
  {
    "title": "Replace a feed pipe and internal valve on to a toilet cistern",
    "text": "Within an hour of calling for help Mark from EVO plumbing arrived and an hour later he left with all new parts fitted on a saturday.",
    "date": "2020-05-13",
    "postcode": "BN6"
  },
  {
    "title": "Kitchen tap replacement",
    "text": "Having repaired toilets the previous week we asked him to come back and replace our kitchen taps. Really good, clean and tidy too. Very pleased.",
    "date": "2020-05-03",
    "postcode": "RH12"
  },
  {
    "title": "Repaired 2 toilets",
    "text": "Very efficient and helpful and also very good with Covid19 procedure etc. Very good service and have booked in for another separate job",
    "date": "2020-05-03",
    "postcode": "RH1"
  },
  {
    "title": "Water mains replacement",
    "text": "Turned up on time and carried out the work to a high degree. Reinstatement was perfection. so pleased.",
    "date": "2020-05-02",
    "postcode": "RH2"
  },
  {
    "title": "Fixing of leak from cold water pipe above kitchen ceiling",
    "text": "Came to my rescue late at night when I had a leaking pipe, very helpful, efficient and friendly. ",
    "date": "2020-05-01",
    "postcode": "RH10"
  },
  {
    "title": "New shower fitted",
    "text": "Great finish, was polite and cleaned up after himself. Would definitely recommend!",
    "date": "2020-04-13",
    "postcode": "RH6"
  },
  {
    "title": "New Cistern",
    "text": "Very Good Work. Neat and tidy, very fairly priced",
    "date": "2020-04-01",
    "postcode": "RH16"
  },
  {
    "title": "Clear blockage and fix leak",
    "text": "Superb service -most efficient and man very pleasant would definitely recommend them again.",
    "date": "2020-04-01",
    "postcode": "RH10"
  },
  {
    "title": "Patio Clean",
    "text": "Really good service. Great Attention to detail. Over the moon with the finished results.",
    "date": "2020-04-01",
    "postcode": "RH4"
  },
  {
    "title": "Serviced and repaired boiler",
    "text": "Really excellent service today, the boiler was seviced and repaired. Steve took care observe all the guidelines regarding corona virus. He wore a face mask and disinfected everything he touched including the door handles. He was very knowledge and did a great job. Really reassuring as one of the household is immunosuppressed.",
    "date": "2020-03-19",
    "postcode": "RH12"
  },
  {
    "title": "Detect and fix leak.",
    "text": "We have been troubled with an intermittent leak from upstairs bathroom for the best part of a year. Previous companies had failed to detect the cause. We actually called EVO out to quote for other work and mentioned the leak in passing. Needless to say Harvey took a quick look an was able to find and demonstrate the cause of the leak within minutes. It was quickly remedied in a timely and professional manner. We are very pleased.",
    "date": "2020-03-18",
    "postcode": "RH12"
  },
  {
    "title": "Fitted waste water pipe leak behind bathroom sink",
    "text": "Tidy, First rate job done rectifying another company's shoddy workamanship. Can't thank Harvey and EVO enough for helping us out on this emergency.",
    "date": "2020-03-18",
    "postcode": "RH16"
  },
  {
    "title": "Powerflush to restore heat on first floor",
    "text": "Delighted with the service we received. 2 other companies had failed to remedy our heating problem. Called EVO out of desperation who attended and gave a free site visit. They immediately identified the problem as heavy sludge in the pipe circuit and recommended a powerflush. The staff were professional, friendly, and courteous throughout, and the results are first class - our heating has never worked so well. I thoroughly recommend EVO.",
    "date": "2020-03-17",
    "postcode": "RH10"
  },
  {
    "title": "Drains cleared out throughout premises, Evo discovered new issues whilst carrying out the work and completed it quickly and effortlessly.",
    "text": "Couldn’t have been happier with the service provided by EVO. The work was arranged and completed within 2 days. The guys were very efficient, friendly and tidy. Would highly recommend, it can be so difficult to find a reliable, reasonably priced drainage an plumbing company.",
    "date": "2020-03-15",
    "postcode": "RH10"
  },
  {
    "title": "Repair concealed leaking pipework",
    "text": "Very polite and friendly and the work is extremely good. Work was done with skill and knowlegde thank you",
    "date": "2020-03-15",
    "postcode": "RH15"
  },
  {
    "title": "Repair to broken boiler",
    "text": "Very quick and friendly service. I would highly recommenery polite, value for money and great service",
    "date": "2020-03-15",
    "postcode": "RH10"
  },
  {
    "title": "Replace bathroom tap and pipes",
    "text": "Very quick response to leak. Repaired very quick and a very good job",
    "date": "2020-03-15",
    "postcode": "RH12"
  },
  {
    "title": "Called in to fix a new tap and sort poor pressure problem out",
    "text": "From making the call EVO arrived spot on time and got straight on with the job very good.",
    "date": "2020-03-15",
    "postcode": "RH2"
  },
  {
    "title": "Pipe blockage, survey and repair.",
    "text": "From start to finish EVO were excellent. Tidiness and professionalism was first rate.",
    "date": "2020-03-15",
    "postcode": "KT22"
  },
  {
    "title": "Repair to broken drain",
    "text": "We were selling our house and needed to repair a gulley drain quickly that had been highlighted in the buyer's survey. EVO did an immense job at short notice. Ten out of ten on all counts!",
    "date": "2020-03-15",
    "postcode": "RH4"
  },
  {
    "title": "clearance of outside drain",
    "text": "Another contractor had told us drain had collapsed and needed excavation. Called EVO for a second opinion and they were able to quickly clear the drain and check with a camera to ensure the integrity of the run. EVO gave us great service and saved us a lot of money. Thank you EVO team!",
    "date": "2020-03-13",
    "postcode": "BN7"
  },
  {
    "title": "Replace cracked toilet cistern.",
    "text": "EVO were terrific from initial phone enquiry through to job completion. A definite 10 out of 10 for every aspect of work and service. Haver already booked in further work with them!",
    "date": "2020-02-19",
    "postcode": "RH15"
  },
  {
    "title": "Cleaning of driveway and rear patio",
    "text": "Absolutely first class stunning results, and all areas left clean and tidy. Such great value for money!",
    "date": "2020-02-15",
    "postcode": "BN1"
  },
  {
    "title": "Changed one TRV on radiator",
    "text": "Very quick response to a leaking valve. They were professional and friendly. I would have no hesitation in recommending Evo Home Services and will no doubt use them again in the future should the need arise",
    "date": "2020-02-15",
    "postcode": "RH10"
  },
  {
    "title": "Correction to leaking pipework",
    "text": "Very efficient and please man. Highly recommended",
    "date": "2020-02-15",
    "postcode": "TN6"
  },
  {
    "title": "Fitted new sink",
    "text": "Having had previous bad experiences, was delighted that we finally found someone who is high;y capable, working in a friendly and professional persona.\r\nHave already scheduled in further works.",
    "date": "2020-02-15",
    "postcode": "RH14"
  },
  {
    "title": "Powerflushing",
    "text": "Was expecting a messy job with major upheaval. Delighted to say that wasn't the case at all, and results and pricing were absolutely superb. ",
    "date": "2020-02-15",
    "postcode": "RH10"
  },
  {
    "title": "Replace full valve flush valve",
    "text": "After making a bad attempt at fixing the loo myself, was so pleased I was able to get EVO to come out on an evening weekend to correct my bodged attempt. Pricing was extremely fair too which was a pleasant and welcome surprise.",
    "date": "2020-02-15",
    "postcode": "RH10"
  },
  {
    "title": "Flush of multi bore 30 year old heating system.",
    "text": "Harvey did a thorough job on our 30 year old, very complicated system. Very satisfactory results. Very courteous and polite. Would always recommend",
    "date": "2020-02-15",
    "postcode": "BN1"
  },
  {
    "title": "replaced toilet",
    "text": "First class service. Noticed a leak on the pan of our previous toilet that had not been noticed by another company. Took tim to select a replacement with identical footprint so flooring did not have to be altered. Great service, very considerate workers, and very professional.",
    "date": "2020-02-04",
    "postcode": "RH17"
  },
  {
    "title": "Changed new taps",
    "text": "Very happy with tradesmen, very nice. They worked diligently to remove and replace the taps in main bathroom and en-suite. They were extremely friendly and courteous, and worked to high standards to complete the work. Would highly recommend",
    "date": "2020-02-01",
    "postcode": "CR3"
  },
  {
    "title": "Replacing domestic cold water tank",
    "text": "Excellent quality of work and friendly approach gave us full trust in the work and the company.",
    "date": "2020-01-28",
    "postcode": "RH10"
  },
  {
    "title": "Boiler replaced; open system replaced by closed system; system flushed; radiators replaced.",
    "text": "Great job getting our heating system up and going efficiently.",
    "date": "2020-01-07",
    "postcode": "RH16"
  },
  {
    "title": "Leaking pipework fixed",
    "text": "Very efficient and pleasant young man. Quick to respond and did an excellent job.",
    "date": "2020-01-07",
    "postcode": "BN7"
  },
  {
    "title": "Replaced flush valve",
    "text": "Prompt time keeping very pleasant manner efficient and careful",
    "date": "2020-01-06",
    "postcode": "KT22"
  },
  {
    "title": "New heating suystem and power flush",
    "text": "Excellent. Good customer care skills. Made the effort to come round quickly. Was clear in advance on timescales and cost. Professional, competent, friendly, helpful and considerate. Would definitely use again.",
    "date": "2020-01-06",
    "postcode": "RH12"
  },
  {
    "title": "Fixed leak in bath",
    "text": "Struggled to find anyone as so close to Christmas, but EVO pulled out all the stops to come to our rescue. Made very light work of a job we had tried to undertake ourselves and failed.",
    "date": "2019-12-22",
    "postcode": "BN7"
  },
  {
    "title": "washing machine installed",
    "text": "Very quick and tidy installation of our machine and much cheaper than other quotes. Will definitely use again.",
    "date": "2019-12-11",
    "postcode": "RH1"
  },
  {
    "title": "Replace programmer",
    "text": "Responded quickly and out of hours. first time we have used EVO, won't be the last!",
    "date": "2019-12-08",
    "postcode": "RH19"
  },
  {
    "title": "Emergency call out to repair leaking toilet",
    "text": "Efficiently dealt with problem and was a very pleasant man",
    "date": "2019-12-08",
    "postcode": "BN6"
  },
  {
    "title": "Replacing diaphragm in toilet",
    "text": "Quick service, looked for the best solution for the problem and will with further advice",
    "date": "2019-12-07",
    "postcode": "BN1"
  },
  {
    "title": "Put back piping under kitchen sink",
    "text": "Friendly and helpful with quick response and very reasonable pricing.",
    "date": "2019-12-07",
    "postcode": "GU6"
  },
  {
    "title": "Toilet leaking and flush running.",
    "text": "Clean, efficient work. All tidy. Will use again and recommend to friends.",
    "date": "2019-10-08",
    "postcode": "RH16"
  },
  {
    "title": "boiler repair and service",
    "text": "Excellent service. Were able to diagnose, fix, and service my boiler all in one visit. Very impressed",
    "date": "2019-10-08",
    "postcode": "RH10"
  },
  {
    "title": "powerflush of heating system",
    "text": "Excellent job. We had no heating upstairs and limited heating downstairs. EVO were able to rectify all problems and left us with a piping hot system that has never worked so well.",
    "date": "2019-10-07",
    "postcode": "RH14"
  },
  {
    "title": "Replace toilet inlet valve",
    "text": "Reliable first class service. EVO liaised with my elderly parent's carer and resolved the issue on first visit.",
    "date": "2019-10-07",
    "postcode": "RH12"
  },
  {
    "title": "Repair macerator",
    "text": "We had struggled to fins anyone who were able to repair our macerator so were very grateful for the service we received from EVO. Thank you.",
    "date": "2019-10-07",
    "postcode": "GU6"
  },
  {
    "title": "Fitting a new shower pump",
    "text": "Arrived on time, fast tidy and good quality work.",
    "date": "2019-10-07",
    "postcode": "RH4"
  },
  {
    "title": "Gutter blockage clearance",
    "text": "Our usual guy was unable to assist. EVO arrived with specialist equipment that made light work of a difficult job and were able to negotiate the complexities of cleaning our 3 storey town house. Thank you!",
    "date": "2019-10-07",
    "postcode": "BN1"
  },
  {
    "title": "Heating system leak",
    "text": "Worked very quickly to locate and fix a leak on our heating circuit that two other plumbers had failed to find.",
    "date": "2019-10-07",
    "postcode": "RH10"
  },
  {
    "title": "Powerflush and boiler fix",
    "text": "We were very happy. Very professional, corteous, honest and clean. Hard working personnell.",
    "date": "2019-10-07",
    "postcode": "RH12"
  },
  {
    "title": "Inspection and rectification of two sink taps",
    "text": "Swift, efficient and friendly",
    "date": "2019-09-07",
    "postcode": "RH6"
  },
  {
    "title": "New stainless steel sink put in plus new piping",
    "text": "Excellent service, Steve was very friendly and explained what he was doing. Searched around Horsham for the correct size sink, as our previous one was over 20 years old and was in a not nice state, including the piping. Will definitely use him again",
    "date": "2019-08-18",
    "postcode": "BN7"
  },
  {
    "title": "Fixed ancient shower (researched and sourced correct parts)",
    "text": "Went the extra mile to help resolve a long standing problem that other companies had refused to help us with",
    "date": "2019-08-08",
    "postcode": "BN6"
  },
  {
    "title": "New Tap fitted and flush repaired in the bathroom",
    "text": "Harvey is always efficient, friendly reliable and has exceptional customer service skills. He always charges very reasonable rates for the work required compared to other national and local plumbing services I have used Evo Plumbing services for the past three years and I have found them to be both great value for money and great with customers. They never charge than what is absolutely necessary. If you want reliable, efficient, speedy, cost effective, honest plumbers who are gentlemanly in their manner and sincere problem solvers in their work then Evo Plumbers are for you! Thank you guys!",
    "date": "2019-08-08",
    "postcode": "RH15"
  },
  {
    "title": "Replacing a kitchen tap",
    "text": "We had attempted a repair ourselves but couldn't finish the work due to the complex nature of the job. EVO responded quickly and did an first class job.",
    "date": "2019-08-08",
    "postcode": "RH19"
  },
  {
    "title": "New immersion heater",
    "text": "Fast, efficient, polite and tidy service. Very happy.",
    "date": "2019-08-07",
    "postcode": "RH14"
  },
  {
    "title": "Unblock a drain",
    "text": "Very Good service. Quick to respond, worked quickly and left site spotless. ",
    "date": "2019-08-07",
    "postcode": "RH15"
  },
  {
    "title": "Reconnected flush on toilet.",
    "text": "Excellent service, we had started a job we couldn't complete and Harvey saved the day. We would definitely use EVO again",
    "date": "2019-08-07",
    "postcode": "RH10"
  },
  {
    "title": "Rectify leak and fix washer on tap",
    "text": "Excellent service, work completed in a neat and timely manner.",
    "date": "2019-07-18",
    "postcode": "RH10"
  },
  {
    "title": "Annual service",
    "text": "Arrived on time and did the work as described. Friendly and helpful",
    "date": "2019-07-08",
    "postcode": "RH19"
  },
  {
    "title": "Change valve",
    "text": "Very efficient, friendly and helpf",
    "date": "2019-06-28",
    "postcode": "RH19"
  },
  {
    "title": "Overflow running - replaced a valve",
    "text": "Good service. Came when they said they would. Kept us informed. Very reliable.",
    "date": "2019-06-19",
    "postcode": "RH1"
  },
  {
    "title": "Repair toilet leak",
    "text": "Service and work excellent. Fantastic response.",
    "date": "2019-06-15",
    "postcode": "RH19"
  },
  {
    "title": "Mending the toilet flush.",
    "text": "Fantastic! Toilet mended efficiently.",
    "date": "2019-06-15",
    "postcode": "BN7"
  },
  {
    "title": "Leak and stiff stopcock",
    "text": "Very capable anfd professional plumbers.",
    "date": "2019-06-14",
    "postcode": "BN7"
  },
  {
    "title": "Drain blocked now running perfectly",
    "text": "Prompt, polite and excellent",
    "date": "2019-06-04",
    "postcode": "PO21"
  },
  {
    "title": "Drain clearance + camera drain survey.",
    "text": "Quick, efficient + friendly. Great survey.",
    "date": "2019-06-03",
    "postcode": "RH12"
  },
  {
    "title": "Replacement of valve in expansion tank",
    "text": "Excellent... would highly recommend this company.",
    "date": "2019-06-01",
    "postcode": "RH17"
  },
  {
    "title": "Pump replacement",
    "text": "Helped us out in an emergency. Great service, quick, efficient, tidy.",
    "date": "2019-05-23",
    "postcode": "RH2"
  },
  {
    "title": "Recommendations as how to fix a problem",
    "text": "Very helpful services. We shall be following up on all recommendations which were first class",
    "date": "2019-05-04",
    "postcode": "BN1"
  },
  {
    "title": "Repaired/Replaced old faulty ball valves",
    "text": "Made effort to find relevant tank that had issues and locate stop cock when no-one knew where these were within our warehouse/offices. Worked efficiently, was courteous and seemed very knowledgeable. Tidied up and put everything back into place after finishing. Also total cost seems very reasonable",
    "date": "2019-05-03",
    "postcode": "RH2"
  },
  {
    "title": "Fitting an isolating valve for a gas hob.",
    "text": "Polite, clean, quick, and helpful. Completed the job as requested in a very short time.",
    "date": "2019-04-26",
    "postcode": "RH10"
  },
  {
    "title": "Drains cleared and checked with camera.",
    "text": "Efficient and friendly. Exceptionally good service.",
    "date": "2019-04-09",
    "postcode": "RH15"
  },
  {
    "title": "Toilet changed.",
    "text": "On time, knowledgeable and friendly.",
    "date": "2019-04-08",
    "postcode": "RH1"
  },
  {
    "title": "Clearing a blocked drain",
    "text": "We are both housebound and EVO provided an excellent service. Quick, friendly, and excellent price.",
    "date": "2019-04-01",
    "postcode": "BN6"
  },
  {
    "title": "Provided plumbing for power shower and WC",
    "text": "Very good service and arrived on time. Very friendly and reliable.",
    "date": "2019-04-01",
    "postcode": "BN7"
  },
  {
    "title": "Gas pipe in kitchen re-situated.",
    "text": "Excellent work efficiently carried out by a very pleasant man, I would thoroughly recommend this company.",
    "date": "2019-03-29",
    "postcode": "RH10"
  },
  {
    "title": "Renewed valve on tank.",
    "text": "Very good service, arrived when they said, removed shoes. Great service.",
    "date": "2019-02-25",
    "postcode": "RH6"
  },
  {
    "title": "yearly boiler service",
    "text": "Totally reliable, friendly and efficient service",
    "date": "2019-02-25",
    "postcode": "RH15"
  },
  {
    "title": "boiler service and repair",
    "text": "Harvey arrived quikly and managed to resolve the issue in a timely manner. Highly recommend",
    "date": "2019-02-12",
    "postcode": "RH12"
  },
  {
    "title": "Boiler annual service.",
    "text": "Totally reliable and friendly service.",
    "date": "2019-01-24",
    "postcode": "RH10"
  },
  {
    "title": "New flush in toilet cistern.",
    "text": "The toilet had very little access and required a professional to fix the fault. EVO provided a quick, friendly and efficient service.",
    "date": "2019-01-24",
    "postcode": "RH4"
  },
  {
    "title": "Leak from pipe behind basin",
    "text": "I'm amazed they managed to fix the problem without taking out the basin. Excellent service polite and helpful.",
    "date": "2019-01-24",
    "postcode": "RH6"
  },
  {
    "title": "Dripping tap",
    "text": "Courteous and efficient. Provided an effective and well priced solution to a long standing problem.\r\n",
    "date": "2019-01-24",
    "postcode": "RH10"
  },
  {
    "title": "Leak from pipe.",
    "text": "Excellent from first call to resolution.Kept in contact and worked very well.",
    "date": "2019-01-16",
    "postcode": "TN22"
  },
  {
    "title": "Replace flush valve washers.",
    "text": "2nd time we have used EVO Plumbing different engineer but came wonderful service. Polite, tidy and happy to explain and answer questions.",
    "date": "2019-01-14",
    "postcode": "RH20"
  },
  {
    "title": "Water leak traced and repaired",
    "text": "Steve did an excellent job finding a leak underneath the floor of our utility room. We initially thought it was under the floor of our shower room and Steve had to trace it to its source. He was reassuring throughout and provided top notch service and quality of work. Highly recommended.",
    "date": "2019-01-08",
    "postcode": "RH15"
  },
  {
    "title": "Fix leaky kitchen mixer tap",
    "text": "Fixed as requested. Checked for leaks after putting in tap and noticed a slow leak elsewhere under the sink that was previously there and fixed it.",
    "date": "2019-01-07",
    "postcode": "RH16"
  },
  {
    "title": "Leaking toilet",
    "text": "Excellent service, fast, tidy and reasonable price.",
    "date": "2018-12-27",
    "postcode": "RH12"
  },
  {
    "title": "Seized tap fixed",
    "text": "Excellent service. Fast, friendly and resolved the issue",
    "date": "2018-12-24",
    "postcode": "RH15"
  },
  {
    "title": "Central heating system",
    "text": "Colin was very quick, efficient and knowledgeable on the problem and after visiting us late on the Fri 21st to assess the fault , he left us with a temporary fix/working central heating system and returned the next day (Saturday) with a new valve head assembly. The new part was fitted in less than an hour and the central heating is now working normally again. We are so pleased that Colin was able to fix this problem so promptly and we would definitely recommend him.",
    "date": "2018-12-22",
    "postcode": "RH19"
  },
  {
    "title": "Central heating system - Replaced (Failed) Honeywell 28mm 2 port valve head and fitted inline cable connector.",
    "text": "Colin was very quick, efficient and knowledgeable on the problem and after visiting us late on the Fri 21st to assess the fault , he left us with a temporary fix/working central heating system and returned the next day (Saturday) with a new valve head assembly. The new part was fitted in less than an hour and the central heating is now working normally again. We are so pleased that Colin was able to fix this problem so promptly and we would definitely recommend him.",
    "date": "2018-12-22",
    "postcode": "RH19"
  },
  {
    "title": "Blocked down pipe",
    "text": "Excellent service, prompt, friendly.",
    "date": "2018-12-21",
    "postcode": "RH10"
  },
  {
    "title": "Seized tap fixed",
    "text": "Excellent service. Fast, friendly and resolved the issue",
    "date": "2018-12-15",
    "postcode": "RH15"
  },
  {
    "title": "Serivce of boiler",
    "text": "Came to me promptly, and told me the expansion vessal was faulty, told me to check warrenty, maker came out and fixed at no charge. Then Steve came back and did a proper service at no extra charge a few days later. So EVO Dorking crew saved me a lot of money! Will definately use them going forward. Thanks guys for all your help.",
    "date": "2018-12-12",
    "postcode": "RH4"
  },
  {
    "title": "Gutter and drain cleaning",
    "text": "Everything was done according to plan. Efficient and prompt service .... recommended.",
    "date": "2018-12-10",
    "postcode": "RH16"
  },
  {
    "title": "Power Flush of Heating System and New Pump",
    "text": "Worked Hard all day from 9.00am to 6.00pm. Radiator system 35 years old at least. Corgi Home Plan engineer was unable to get Boiler working despite 2 visits. Told Corgi would not cover system if blockage was the cause. Colin did the work at short notice and phoned 4 days later to ensure all was well.",
    "date": "2018-12-10",
    "postcode": "RH12"
  },
  {
    "title": "Gutter and drain cleaning",
    "text": "Everything was done according to plan. Efficient and prompt service .... recommended",
    "date": "2018-12-10",
    "postcode": "RH16"
  },
  {
    "title": "Replaced toilet cistern",
    "text": "Received a great service, arrived at arranged time, job carried out efficiently, friendly workman and tidy. Would use again.",
    "date": "2018-12-07",
    "postcode": "RH15"
  },
  {
    "title": "Power flush and heating overhaul",
    "text": "Excellent service, clean tidy. On time.",
    "date": "2018-12-05",
    "postcode": "RH10"
  },
  {
    "title": "Installing new bathroom radiator.",
    "text": "Conscientious work thoroughly satisfied. Would recommend to friends and family,",
    "date": "2018-12-04",
    "postcode": "RH12"
  },
  {
    "title": "Fixing the ball cock and valve in the loft based storage tank",
    "text": "Very pleasant, efficient work carried out. Also gave notice of need to flush radiator system, will do this shortly.",
    "date": "2018-12-03",
    "postcode": "RH19"
  },
  {
    "title": "Installing new bathroom radiator",
    "text": "Conscientious work thoroughly satisfied.",
    "date": "2018-11-30",
    "postcode": "RH12"
  },
  {
    "title": "Boiler service",
    "text": "Excellent.",
    "date": "2018-11-29",
    "postcode": "RH16"
  },
  {
    "title": "Boiler service plus check on other issues e.G. Taps, radiators",
    "text": "Very happy with the work.",
    "date": "2018-11-28",
    "postcode": "BN6"
  },
  {
    "title": "Cleared a toilet that was backing up",
    "text": "Excellent service - was able to complete the job the same day I called. Great!",
    "date": "2018-11-26",
    "postcode": "RH15"
  },
  {
    "title": "Connection of shower.",
    "text": "First Class service. This is the third time I have used EVO this year and cannot fault them on any aspect. ",
    "date": "2018-11-26",
    "postcode": "RH10"
  },
  {
    "title": "Connection of shower",
    "text": "First class service",
    "date": "2018-11-21",
    "postcode": "RH10"
  },
  {
    "title": "Replaced 3 port valve on hot water system",
    "text": "I was totally impressed with how Steve works. He quickly located the fault on our boiler after a series of complicated checks. He is methodical in his work and totally dedicated to fault finding. I would not hesitate to recommend Steve and his team for any heating and plumbing work you may have, he is trustworthy and very reliable.",
    "date": "2018-11-21",
    "postcode": "RH12"
  },
  {
    "title": "Toilet flush was leaking",
    "text": "Very good.",
    "date": "2018-11-21",
    "postcode": "RH10"
  },
  {
    "title": "Annual boiler service",
    "text": "I've used them for 7 years now and he's never let me down, I'd highly recommend him.",
    "date": "2018-11-16",
    "postcode": "RH10"
  },
  {
    "title": "Fixing the ball cock and valve in the loft based storage tank",
    "text": "Very pleasant, efficient work carried out. Also gave notice of need to flush radiator system, will do this shortly.",
    "date": "2018-11-08",
    "postcode": "RH5"
  },
  {
    "title": "Radiator power flush and boiler service",
    "text": "Very polite and professional plumbers.",
    "date": "2018-11-02",
    "postcode": "RH15"
  },
  {
    "title": "Powerflush of heating system",
    "text": "This is the third time I have used this company and every time the service has been faultless.",
    "date": "2018-11-02",
    "postcode": "RH6"
  },
  {
    "title": "New flush siphon fitted",
    "text": "Excellent and efficient service. Were despaerate to get job done before arrival of guests and EVO were superb!",
    "date": "2018-11-01",
    "postcode": "TN22"
  },
  {
    "title": "Flush on downstairs, WC not working.",
    "text": "Colin arrived on time, did an excellent job and cleaned up all debris, I would highly recommend them.",
    "date": "2018-11-01",
    "postcode": "GU6"
  },
  {
    "title": "Leak detection + fix.",
    "text": "Excellent service, quick response + punctual. Managed to resolve a problem that other plumbers had not been able to find.",
    "date": "2018-11-01",
    "postcode": "RH17"
  },
  {
    "title": "New flush siphon fitted",
    "text": "Excellent and efficient.",
    "date": "2018-10-26",
    "postcode": "TN22"
  },
  {
    "title": "Flush on downstairs, WC not working",
    "text": "Colin arrived on time, did an excellent job and cleaned up all debris, I would highly recommend them.",
    "date": "2018-10-25",
    "postcode": "BN6"
  },
  {
    "title": "Boiler service",
    "text": "Usual excellent service",
    "date": "2018-10-22",
    "postcode": "BN6"
  },
  {
    "title": "Leak detection + fix",
    "text": "Excellent service, quick response + punctual.",
    "date": "2018-10-20",
    "postcode": "RH12"
  },
  {
    "title": "Boiler service",
    "text": "Usual excellent service.",
    "date": "2018-10-19",
    "postcode": "BN6"
  },
  {
    "title": "Previous plumber 2 years ago fitted new combi boiler but left us with terrible 'water hammering', call to sort it",
    "text": "2nd visit following annual boiler service to sort out severe water hammering that over 2 years previous plumber had not managed to sort out. Steve on first visit made temporary adjustment to stop noise until he returned with parts today to make full adjustment - ecstatic a quiet house.",
    "date": "2018-10-18",
    "postcode": "RH20"
  },
  { "title": "Toilet valve", "text": "Excellent.", "date": "2018-10-18", "postcode": "RH15" },
  {
    "title": "Power flushing",
    "text": "Excellent service from Steve. Courteous, punctual and professional. Highly recommended.",
    "date": "2018-10-11",
    "postcode": "RH12"
  },
  {
    "title": "New works in toilet cistern",
    "text": "Very good service. Polite plumber. Very tidy, left place clean.",
    "date": "2018-10-04",
    "postcode": "BN9"
  },
  {
    "title": "Perform camera survey of drain",
    "text": "Very professional.",
    "date": "2018-09-26",
    "postcode": "RH15"
  },
  {
    "title": "Fitted a new ball-cock",
    "text": "Harvey came round when he said and Identified the problem almost immediately, he had the parts in his van and had the job done within 15 minutes for what I consider a very reasonable price, I also showed him a radiator that I had taken off and painted he attached to the pipes, filled and bled the radiator without charging me, not a big job but still he did not charge me, very nice guy.",
    "date": "2018-09-24",
    "postcode": "RH10"
  },
  {
    "title": "Fitted a new ball-cock.",
    "text": "Harvey came round when he said and Identified the problem almost immediately, he had the parts in his van and had the job done within 15 minutes for what I consider a very reasonable price, I also showed him a radiator that I had taken off and painted he attached to the pipes, filled and bled the radiator without charging me, not a big job but still he did not charge me, very nice guy.",
    "date": "2018-09-24",
    "postcode": "BN7"
  },
  {
    "title": "Replace radiator",
    "text": "Very good service, clean and tidy.",
    "date": "2018-09-24",
    "postcode": "BN7"
  },
  {
    "title": "Blocked sink and new waste required",
    "text": "Excellent.",
    "date": "2018-09-17",
    "postcode": "RH15"
  },
  {
    "title": "Fixed Immersion boiler",
    "text": "Very good work, managed to fix the problem and had the parts to hand. Even when the heating element was stuck the plumber kept trying and succeeded to avoid me having to pay for a new tank. Communication was also good with the office telling me when the plumber would arrive and calling me 30 min before he arrived",
    "date": "2018-09-16",
    "postcode": "RH12"
  },
  {
    "title": "Replace boiler, move tank gauge",
    "text": "I would not hesitate to recommend Evo! Steve did an amazing job for us. He worked incredibly hard over two days to replace our boiler, move a pressure gauge, and fix a leaking radiator pipe. He was extremely friendly and knowledgeable and we will definitely be using Evo in the future.",
    "date": "2018-09-10",
    "postcode": "BN6"
  },
  {
    "title": "Slow draining kitchen sink fixed",
    "text": "Very fast response, work completed within a few hours of initial call. Excellent service.",
    "date": "2018-08-28",
    "postcode": "RH15"
  },
  {
    "title": "Replace existing boiler",
    "text": "Neat and tidy work in a difficult position with a number of complications. All problems were resolved and we are very satisfied with the new boiler.",
    "date": "2018-08-24",
    "postcode": "RH10"
  },
  {
    "title": "Replace toilet flush valve",
    "text": "The plumber who came was professional and friendly. I felt more than comfortable having him in my home",
    "date": "2018-08-18",
    "postcode": "RH15"
  },
  {
    "title": "Boiler service. Fix bath leak.",
    "text": "Used before so knew what service I was getting. Great service given as always. Strongly recommended.",
    "date": "2018-08-10",
    "postcode": "RH12"
  },
  {
    "title": "Replaced ball valve and inlet pipe work",
    "text": "Great service. I'm a repeat customer and shall continue using them because simply they are so reliable and know exactly what they are doing.",
    "date": "2018-08-08",
    "postcode": "RH12"
  },
  {
    "title": "Boiler service",
    "text": "Used before so knew what service I was getting. Great service given as always. Strongly recommended.",
    "date": "2018-08-07",
    "postcode": "RH12"
  },
  {
    "title": "Replaced 2 port valve on hot water system primary circuit from boiler to cylinder",
    "text": "Was impressed with how quickly Steve picked up on how our rather complicated CH/HW system works, and homed in on the problem. Job completed same day as diagnostic visit. Quite expensive but no complaints - you pay for quality.",
    "date": "2018-08-03",
    "postcode": "RH15"
  },
  {
    "title": "Replace faulty tap.",
    "text": "Helpful, communicate, quick, replacement of faulty tap.",
    "date": "2018-08-02",
    "postcode": "BN6"
  },
  {
    "title": "Mending a leaking pipe from the toilet",
    "text": "Prompt, competent, helpful and tidy. Very fair pricing policy too",
    "date": "2018-07-30",
    "postcode": "RH12"
  },
  {
    "title": "Replace faulty tap",
    "text": "Helpful, communicate, quick, replacement of faulty tap.",
    "date": "2018-07-29",
    "postcode": "BN6"
  },
  {
    "title": "Radiator and towel rail fitted.",
    "text": "Colin was friendly, efficient and helpful and carried out the work well and at very short notice.",
    "date": "2018-07-26",
    "postcode": "BN7"
  },
  {
    "title": "Unblock a drain",
    "text": "Harvey turned up on time, was well presented and polite. He assessed the problem and unblocked the drain effectively",
    "date": "2018-07-23",
    "postcode": "RH6"
  },
  {
    "title": "Unblocked a very blocked downstairs cloakroom loo",
    "text": "Super impressed with the service and efficiency. Within 60 minutes of calling this company Colin the plumber was at my door and fixed the problem in minutes. I thought the fee was reasonable for a Saturday call out and appreciate you are paying for expertise, not an hourly rate so we are very satisfied and very relieved given the nature of the problem! Colin was a very pleasant, amenable fellow and clearly loves his job and the business he works for which is great to see.",
    "date": "2018-07-21",
    "postcode": "RH12"
  },
  {
    "title": "Unblocked a very blocked downstairs cloakroom loo",
    "text": "Super impressed with the service and efficiency. Within 60 minutes of calling this company Colin the plumber was at my door and fixed the problem in minutes. I thought the fee was reasonable for a Saturday call out and appreciate you are paying for expertise, not an hourly rate so we are very satisfied and very relieved given the nature of the problem! Colin was a very pleasant, amenable fellow and clearly loves his job and the business he works for which is great to see",
    "date": "2018-07-21",
    "postcode": "RH12"
  },
  {
    "title": "Unblocking a drain",
    "text": "Harvey turned up on time, was well presented and polite. He assessed the problem and unblocked the drain effectively.",
    "date": "2018-07-20",
    "postcode": "RH6"
  },
  {
    "title": "Drain blocked and cleared, roots removed",
    "text": "Absolute perfection, quick, efficient, pleasant",
    "date": "2018-07-18",
    "postcode": "RH4"
  },
  {
    "title": "Radiator and towel rail fitted",
    "text": "Colin was friendly, efficient and helpful and carried out the work well and at very short notice.",
    "date": "2018-07-16",
    "postcode": "BN7"
  },
  {
    "title": "Renewal of external waste water pipe",
    "text": "On time. Careful work. Very satisfied. Would thoroughly recommend.",
    "date": "2018-07-16",
    "postcode": "RH16"
  },
  {
    "title": "Garden tap installed",
    "text": "Very prompt, informative on job, friendly, work carried out to a high standard. Would use again and recommend to others.",
    "date": "2018-07-13",
    "postcode": "RH10"
  },
  {
    "title": "Service Noisey boiler",
    "text": "Very pleased with the work. The boiler's much quieter now!",
    "date": "2018-07-12",
    "postcode": "RH4"
  },
  {
    "title": "CCTV survey of drains",
    "text": "Excellent service. Found possible areas for entry by rats. Advised further action required.",
    "date": "2018-07-10",
    "postcode": "RH15"
  },
  {
    "title": "Drain blocked and cleared",
    "text": "Absolute perfection, quick, efficient, pleasant.",
    "date": "2018-07-09",
    "postcode": "RH15"
  },
  {
    "title": "Replace utility room taps",
    "text": "Prompt service, excellent job, would highly recommend.",
    "date": "2018-07-05",
    "postcode": "BN6"
  },
  {
    "title": "Replace kitchen tap.",
    "text": "Very quick and helpful. Harvey was a wonderful and friendly guy.",
    "date": "2018-07-03",
    "postcode": "BN6"
  },
  {
    "title": "Fixed leak front bath waste pipe",
    "text": "Prompt and super service. Many thanks.",
    "date": "2018-07-02",
    "postcode": "RH10"
  },
  {
    "title": "Replace kitchen tap",
    "text": "Very quick and helpful.",
    "date": "2018-06-29",
    "postcode": "RH5"
  },
  {
    "title": "Service boiler",
    "text": "Pleased with the work.",
    "date": "2018-06-28",
    "postcode": "RH10"
  },
  {
    "title": "Clearance of blockage",
    "text": "Punctual and speedy service.",
    "date": "2018-06-27",
    "postcode": "BN6"
  },
  {
    "title": "Unblock drain",
    "text": "Had terrible problems with sewage flooding on to driveway. EVO responded very quickly and resolved the problem with minimum effort. Was extremely grateful that they made such a tremendous effort of tidying the area after the blockage had been cleared.",
    "date": "2018-06-26",
    "postcode": "BN1"
  },
  {
    "title": "Fix kitchen tap flow problem",
    "text": "Quick and clean work.",
    "date": "2018-06-22",
    "postcode": "RH14"
  },
  {
    "title": "Central heating service",
    "text": "Prompt and reliable, service as always.",
    "date": "2018-06-14",
    "postcode": "RH15"
  },
  {
    "title": "Fault finding and remedy of thermostatic files (sensing files) as hot water was scalding",
    "text": "Steve was very methodical in his approach testing all variables to eliminate options in finding the root cause of the problem. Second time I have used EVO and certainly a trusted service provider in my local area based on experience to date.",
    "date": "2018-06-12",
    "postcode": "RH12"
  },
  {
    "title": "Boiler service",
    "text": "Arrived on time, completed quickly. ",
    "date": "2018-06-12",
    "postcode": "RH4"
  },
  {
    "title": "Leak repair",
    "text": "The work was carried out very efficiently by Harveywho was very courteous indeed. He was friendly and professional. He arrived within half an hour of making the call. He explained what work needed to be carried out and got on with it. He removed his shoes to go upstairs. A great job! I was very impressed.",
    "date": "2018-06-12",
    "postcode": "BN1"
  },
  {
    "title": "Repair of a leak",
    "text": "The work was carried out very efficiently by Colin who was very courteous indeed. He was friendly and professional. He arrived within half an hour of making the call. He explained what work needed to be carried out and got on with it. He removed his shoes to go upstairs. A great job! I was very impressed.",
    "date": "2018-06-11",
    "postcode": "RH10"
  },
  {
    "title": "Emergency call out Sunday isolated leak returned hext day for full repair",
    "text": "Struggled to find anyone on sunday. Our neighbour recommeneded EVO and thay were absolutely brilliant. Will always be using them in future!",
    "date": "2018-06-08",
    "postcode": "RH19"
  },
  {
    "title": "Leak detection outside valve replaced",
    "text": "Great friendly service very efficient and very quick.",
    "date": "2018-06-06",
    "postcode": "RH10"
  },
  {
    "title": "Mending a leaking pipe from the toilet",
    "text": "Prompt, competent, helpful and tidy.",
    "date": "2018-05-30",
    "postcode": "RH5"
  },
  {
    "title": "Shower, shower tray and fixed glass and towel rails etc",
    "text": "Could not be more pleasant young men, all work perfectly executed.",
    "date": "2018-05-30",
    "postcode": "RH12"
  },
  {
    "title": "Shower leak - resealed the shower unit",
    "text": "Steve came on same day of call out. Neat and tidy worker - even put on a new shower hose for me. Will use again.",
    "date": "2018-05-29",
    "postcode": "RH16"
  },
  {
    "title": "Fixing of leak in en-suite shower room",
    "text": "Very courteous and reliable with attention to detail in addressing the issue and fixing. Undertook a few other small unrelated jobs as well.",
    "date": "2018-05-27",
    "postcode": "RH12"
  },
  {
    "title": "Leak detection outside valve replaced",
    "text": "Great friendly service very efficient and very quick.",
    "date": "2018-05-25",
    "postcode": "RH10"
  },
  {
    "title": "Replace basin taps and valves",
    "text": "Excellent service and work.",
    "date": "2018-05-25",
    "postcode": "RH12"
  },
  {
    "title": "Boiler service",
    "text": "Excellent service.",
    "date": "2018-05-24",
    "postcode": "BN6"
  },
  {
    "title": "Leak on mains pipe",
    "text": "Our kitchen was being refitted and during the process of the old one being taken out a leak was discovered on our mains water pipe, halting all work until fixed. I phoned up Harvey who came round the next day to assess things, he then had someone come round that afternoon to fixed the leak! Tidy, quick and thoroughly sorted.",
    "date": "2018-05-22",
    "postcode": "GU6"
  },
  {
    "title": "Leak on mains water pipe fixed",
    "text": "Our kitchen was being refitted and during the process of the old one being taken out a leak was discovered on our mains water pipe, halting all work until fixed. I phoned up Harvey who came round the next day to assess things, he then had someone come round that afternoon to fixed the leak! Tidy, quick and thoroughly sorted.",
    "date": "2018-05-17",
    "postcode": "RH10"
  },
  {
    "title": "Replacement of tap under the kitchen sink",
    "text": "Efficiently carried out.",
    "date": "2018-05-14",
    "postcode": "RH14"
  },
  {
    "title": "Turn off shower - replace valve in shower tap",
    "text": "Fast response to call out. And managed to turn off running shower. Found cause and ordered part came back promptly to fit part.",
    "date": "2018-05-14",
    "postcode": "RH20"
  },
  {
    "title": "Replace garden tap and back plate",
    "text": "Very good.",
    "date": "2018-04-30",
    "postcode": "RH19"
  },
  {
    "title": "Water leak in garage.",
    "text": "Polite, clean and tidy. Discovered problem quickly.",
    "date": "2018-04-30",
    "postcode": "RH17"
  },
  {
    "title": "Unblock sink drain (outside).",
    "text": "Excellent prompt and efficient service, highly recommend.",
    "date": "2018-04-30",
    "postcode": "BN6"
  },
  {
    "title": "Replaced two isolation valves and shower cartridge.",
    "text": "Impressively speedy attendance for an urgent job. Friendly, polite, tidy and fixed problem",
    "date": "2018-04-30",
    "postcode": "BN6"
  },
  {
    "title": "Replaced two isolation valves and shower cartridge",
    "text": "Impressively speedy attendance for an urgent job. Friendly, polite, tidy and fixed problem.",
    "date": "2018-04-26",
    "postcode": "BN6"
  },
  {
    "title": "Unblock sink drain (outside)",
    "text": "Excellent prompt and efficient service, highly recommend.",
    "date": "2018-04-25",
    "postcode": "BN6"
  },
  {
    "title": "Water leak in garage",
    "text": "Polite, clean and tidy. Discovered problem quickly.",
    "date": "2018-04-25",
    "postcode": "RH16"
  },
  {
    "title": "Patio cleaned",
    "text": "Quick and efficient.",
    "date": "2018-04-24",
    "postcode": "BN25"
  },
  {
    "title": "Gas safety check and boiler service",
    "text": "We have used Steve on numerous occasions, he has also helped out in a crisis and his work has always been satisfactory. We have recommended him to others. We have found Steve to be a very helpful person.",
    "date": "2018-04-23",
    "postcode": "RH4"
  },
  {
    "title": "Replace expansion vessel and TRV",
    "text": "Very efficient, assessment and price before work done in minimum of fuss and all good.",
    "date": "2018-04-23",
    "postcode": "RH5"
  },
  {
    "title": "Replace expansion vessel and TVR",
    "text": "Very efficient, assessment and price before work done in minimum of fuss and all good.",
    "date": "2018-04-19",
    "postcode": "RH16"
  },
  {
    "title": "Fix outside tap and pipes",
    "text": "Excellent service. Quick response.",
    "date": "2018-04-16",
    "postcode": "RH10"
  },
  {
    "title": "Cleaning of guttering",
    "text": "Efficient, clean and tidy. Were able to access and clean gutter parts with their machinery that was beyond our window cleaner and handyman.",
    "date": "2018-04-16",
    "postcode": "RH12"
  },
  {
    "title": "Fix outside tap and pipes",
    "text": "It was only a small job, which other companies seemed uninterested in doing, but EVO provided an impressive effective service with a smile!",
    "date": "2018-04-16",
    "postcode": "RH4"
  },
  {
    "title": "Cleaning of guttering",
    "text": "Efficient, friendly and thorough.",
    "date": "2018-04-13",
    "postcode": "ME19"
  },
  {
    "title": "Replace valves on kitchen radiator",
    "text": "I use EVO for all my plumbing and heating as the service is first class and they never let me down.",
    "date": "2018-04-11",
    "postcode": "RH17"
  },
  {
    "title": "Replaced 3 port valve.",
    "text": "Fast service, clean and tidy, price right. Massive thumbs up.",
    "date": "2018-04-10",
    "postcode": "RH15"
  },
  {
    "title": "Flush mechanism on toilet broken and replaced and ball cock replaced.",
    "text": "Prompt response and friendly and polite staff. Efficient and timely work and very tidy. Would use again.",
    "date": "2018-04-06",
    "postcode": "RH15"
  },
  {
    "title": "Fitted new Central Heating Programmer",
    "text": "Steve has attended on several occasions to repair different jobs at our property. Yesterday was no exception, Steve arrived promptly, worked very efficiently and when the job was completed, left everything neat and tidy. We have also had Steve's colleagues attend, if Steve has been snowed under. I wouldn't hesitate to recommend, Steve, Harvey or Colin. Many thanks!",
    "date": "2018-04-05",
    "postcode": "RH12"
  },
  {
    "title": "Replaced 3 port valve",
    "text": "Fast service, clean + tidy, price right.",
    "date": "2018-04-03",
    "postcode": "RH15"
  },
  {
    "title": "Boiler service",
    "text": "Arrived on time, completed quickly.",
    "date": "2018-03-31",
    "postcode": "RH10"
  },
  {
    "title": "Replace pump, replace 3 way valve, power wash heating system",
    "text": "Very pleased with the work carried out. Both Steve and Harvey were very polite and professional in their approach to the job.",
    "date": "2018-03-30",
    "postcode": "GU15"
  },
  {
    "title": "Flush mechanism on toilet broken and replaced and ball cock replaced",
    "text": "Prompt response and friendly and polite staff. Efficient and timely work and very tidy. Would use again.",
    "date": "2018-03-29",
    "postcode": "RH15"
  },
  {
    "title": "Fitting new mains stop lock",
    "text": "Courteous and efficient.",
    "date": "2018-03-14",
    "postcode": "RH10"
  },
  {
    "title": "Replace ball cock",
    "text": "Same day service, very efficient.",
    "date": "2018-03-14",
    "postcode": "RH16"
  },
  {
    "title": "Boiler safety inspection",
    "text": "Harvey was very friendly and professional. Phoned ahead to check we were still on with all the snow!",
    "date": "2018-03-12",
    "postcode": "RH10"
  },
  {
    "title": "Attended to frozen garden tap",
    "text": "My garden tap froze, came completely off and we were faced with water pouring 6 feet high out onto the garden! Despite being a very busy day for them, Colin was with us within the hour and had it all fixed, when no-one else I called would even come out. Great friendly service - will definitely be using you again. You really saved the day!",
    "date": "2018-03-02",
    "postcode": "RH2"
  },
  {
    "title": "Attended to frozen and cracked garden tap",
    "text": "My garden tap froze, came completely off and we were faced with water pouring 6 feet high out onto the garden! Despite being a very busy day for them, Colin was with us within the hour and had it all fixed, when no-one else I called would even come out. Great friendly service - will definitely be using you again. You really saved the day!",
    "date": "2018-03-02",
    "postcode": "RH2"
  },
  {
    "title": "On call advice",
    "text": "Harvey was brilliant! I woke at 5.30 am to a broken boiler, no heat or hot water. Left Harvey a message and he called me by 7am! Unfortunately due to adverse snow conditions he could not drive over but advised me it could be the pipes from boiler outside that had frozen and instructed me over phone. Brilliant advice and boiler now working!!! I have used Harvey many times and think he is so helpful and approachable and despite me contacting him at search an early hour he was courteous, helpful and did not seem to mind at all. He even called abit later to see all was ok! Can't recommend enough!",
    "date": "2018-03-01",
    "postcode": "BN1"
  },
  {
    "title": "Defrost and unblock boiler condensation pipe and restore boiler to full working order",
    "text": "Our usual boiler service company were not able to attend for 5 days. I rang Steve and he was able to come round that evening (1.5 hours notice) Steve was extremely helpful and polite and gave us full confidence that he would be able to help restore the boiler function. The job was completed quickly and efficiently with tips on how to avoid a future problem. We would definitely recommend Steve and would happily use him again in the future",
    "date": "2018-02-28",
    "postcode": "RH12"
  },
  {
    "title": "Cleared downpipe",
    "text": "Quick and efficient service. Happy to recommend and will definitely use again for other services.",
    "date": "2018-02-23",
    "postcode": "RH10"
  },
  {
    "title": "fitted new taps and shower fittings",
    "text": "After struggling to find anyone reliable we were delighted that we contacted EVO. From job start to completion the whole service was faultless. Have already booked in further work with them!",
    "date": "2018-02-23",
    "postcode": "RH1"
  },
  {
    "title": "Clear downpipe",
    "text": "Arrived on time, quick efficient service.",
    "date": "2018-02-19",
    "postcode": "RH10"
  },
  {
    "title": "Replacement parts to faulty water heaters",
    "text": "Prompt service and very pleased with service.",
    "date": "2018-02-14",
    "postcode": "RH10"
  },
  {
    "title": "Replacing domestic cold water tank",
    "text": "Excellent quality of work and friendly approach gave us full trust in the work and the company.",
    "date": "2018-02-13",
    "postcode": "RH10"
  },
  {
    "title": "Repairs to radiator valve that was flooding our living room",
    "text": "Absolutely first class service from EVO. Returned home late at night to find flooded living room. Phoned EVO and the whole issue was resolved within a couple of hours. Brilliant!",
    "date": "2018-02-12",
    "postcode": "RH15"
  },
  {
    "title": "New tap head fitted and dripping tap issue sorted",
    "text": "Colin did a very thorough and efficient job, resolving the issue.",
    "date": "2018-02-04",
    "postcode": "RH10"
  },
  {
    "title": "Replace 3 way valve",
    "text": "It was all very professional and courteous-completed with no fuss.",
    "date": "2018-02-02",
    "postcode": "RH12"
  },
  {
    "title": "Blocked down pipe.",
    "text": "A very difficult job made to look easy. Fast, efficient, friendly service.",
    "date": "2018-01-31",
    "postcode": "RH10"
  },
  {
    "title": "Blocked outside storm drain",
    "text": "Absolutely top notch!! From phone call to arrival - 20 mins and on a Sunday!! Got to work and sorted the problem! Very happy and would definitely recommend!!!",
    "date": "2018-01-28",
    "postcode": "RH16"
  },
  {
    "title": "Blocked Storm drain",
    "text": "Absolutely top notch!! From phone call to arrival - 20 mins and on a Sunday!! Got to work and sorted the problem! Very happy and would definitely recommend!!!",
    "date": "2018-01-28",
    "postcode": "RH16"
  },
  {
    "title": "Shower leak and thermostat diagnostic",
    "text": "Great service - kept informed for arrival time and really tidy and helpful.",
    "date": "2018-01-26",
    "postcode": "BN7"
  },
  {
    "title": "Guttering cleaned out back and front with satisfaction",
    "text": "I watched the process, it was amazing and Harvey was a very friendly guy. I even had a look through the camera used to check.",
    "date": "2018-01-19",
    "postcode": "RH10"
  },
  {
    "title": "Traced and repaired a leaking central heating pipe",
    "text": "Evo were asked at short notice (emergency leak - water coming through roof) to fix a problem. They responded quickly and fixed the problem on that day. Alongside that they ensured that they made good as much as possible e.G re-laid the carpet as they had to take floor boards up, ensured that no air pockets in central heating etc. Even came back quickly the following day when we identified a minor problem with air trapped in bathroom pipe. Recommended if you are looking for a professional plumber.",
    "date": "2018-01-19",
    "postcode": "RH14"
  },
  {
    "title": "Boiler Service",
    "text": "Used Harvey again as service great. You can relay on him to turn up and do a good job",
    "date": "2018-01-15",
    "postcode": "RH10"
  },
  {
    "title": "Power flush to central heating system",
    "text": "Steve and Harvey arrived promptly to Power Flush the Central Heating System, which hadn't been cleaned for over 25 years! Copious amounts of black sludge poured out of the system for several hours and was replaced with clean water, special additives were also added to clean the system. When the Central Heating was switched back on, it immediately began operating much more efficiently! My husband and I found when Steve and Harvey had finished, the whole house was left clean and tidy! Many thanks and well done to both, I shall definitely be contacting Steve in the future for any work needed.",
    "date": "2018-01-11",
    "postcode": "RH12"
  },
  {
    "title": "Unblock drain, toilet",
    "text": "Excellent friendly service.",
    "date": "2018-01-06",
    "postcode": "BN24"
  },
  {
    "title": "New tap head fitted and dripping tap issue sorted",
    "text": "Colin did a very thorough and efficient job, resolving the issue. Great Service!",
    "date": "2018-01-05",
    "postcode": "RH10"
  },
  {
    "title": "New Boiler fitted",
    "text": "Steve diagnosed the problem with my old boiler. We discussed the options and he recommended I contact the manufacturer of my old boiler to see if it was possible to repair it. The manufacturer did not give me any hope that it would be possible to economically repair the old boiler, so I followed Steve's recommendation to replace it. Steve responded quickly to get the work done during the cold weather. The new boiler is much better. An excellent job.",
    "date": "2018-01-04",
    "postcode": "RH12"
  },
  {
    "title": "Replace toilet siphon, boiler service",
    "text": "As usual, Harvey arrived on time and did an excellent job, cheerfully and effectively overcoming unexpected challenges in replacement of the toilet siphon. I would not hesitate to recommend.",
    "date": "2017-12-07",
    "postcode": "RH16"
  },
  {
    "title": "Boiler service",
    "text": "Used Harvey again as service great. You can relay on him to turn up and do a good job.",
    "date": "2017-12-04",
    "postcode": "RH12"
  },
  {
    "title": "Replace toilet valve",
    "text": "Great service!",
    "date": "2017-12-04",
    "postcode": "RH16"
  },
  {
    "title": "Boiler service",
    "text": "Excellent.",
    "date": "2017-12-04",
    "postcode": "RH10"
  },
  {
    "title": "Replace bathroom sink tap",
    "text": "I contacted Harvey to replace a broken tap in my bathroom, having used his services before to service my boiler. He fitted me in at short notice and rang me shortly before to let me know what time he’d be coming. Am very pleased with his work. Thanks again Harvey.",
    "date": "2017-12-01",
    "postcode": "RH10"
  },
  {
    "title": "Gutter clearing",
    "text": "Very good and knowledgeable.",
    "date": "2017-11-30",
    "postcode": "BN6"
  },
  {
    "title": "CCTV to track drains",
    "text": "I needed my sewer/drains investigated to find exactly where they run under my patio and garden prior to building work. Very proficient and knowledgeable guy. Also, having lifted the manholes, the pipe was several feet down and hard to access, but he managed somehow. Great work and he didn't clock watch. Did the job for the agreed price.",
    "date": "2017-11-29",
    "postcode": "GU15"
  },
  {
    "title": "Boiler checking/ fault findings",
    "text": "I went with Steve based on his reviews. He is an absolutely lovely guy, and he clearly knows his stuff. From the very start he returned my call promptly, and provided a clear quote for the work. He turned up on time, and gave an honest assessment of my boiler. He fixed the problem in the short term and gave me some options for work that would be beneficial in the longer term. There was no pressure to spend any extra money, and Steve was completely upfront about and honest with his assessment of the boiler and plumbing. Fantastic stuff.",
    "date": "2017-11-24",
    "postcode": "RH12"
  },
  {
    "title": "Plumbing in washing machine, mending leak",
    "text": "Prompt and efficient service, getting us started in new house.",
    "date": "2017-11-15",
    "postcode": "KT22"
  },
  {
    "title": "Boiler service",
    "text": "Thanks Harvey.",
    "date": "2017-11-15",
    "postcode": "RH10"
  },
  {
    "title": "Replace hot water tank",
    "text": "First time of using EVO, polite and friendly, very happy with work done. Would recommend.",
    "date": "2017-11-15",
    "postcode": "RH16"
  },
  {
    "title": "Service to Vaillant boiler",
    "text": "First class job - highly recommended.",
    "date": "2017-11-13",
    "postcode": "BN6"
  },
  {
    "title": "Boiler service",
    "text": "On time, friendly, reliable service.",
    "date": "2017-11-09",
    "postcode": "RH15"
  },
  {
    "title": "Boiler repositioned after previous installer had wrongly installed it",
    "text": "Very good work. The engineers were friendly and informative.",
    "date": "2017-11-08",
    "postcode": "CR5"
  },
  {
    "title": "Kitchen sink plumbing",
    "text": "Excellent service. Very quickly done. Would highly recommend. Great customer service!",
    "date": "2017-11-06",
    "postcode": "RH16"
  },
  {
    "title": "New kitchen sink and tap fitted",
    "text": "Arrived on time and completed work to our satisfaction.",
    "date": "2017-11-01",
    "postcode": "RH10"
  },
  {
    "title": "Fitted new stoplock to indoor water supply pipe",
    "text": "Very good, came when agreed and did a very satisfactory job.",
    "date": "2017-10-31",
    "postcode": "RH10"
  },
  {
    "title": "Take out tiles to find source of leak, renewed all parts in toilet. Came back as very big leak instead small one",
    "text": "Excellent.",
    "date": "2017-10-30",
    "postcode": "RH16"
  },
  {
    "title": "Boiler service, maintenance of radiator and pipe removal",
    "text": "Helpful, courteous and friendly, thank you",
    "date": "2017-10-27",
    "postcode": "RH15"
  },
  {
    "title": "Boiler serviced and flue replaced",
    "text": "Steve was originally asked to come do a simple boiler service. However it soon turned into anything but simple when a leak was discovered. With his experience and knowledge we came up with a 3 step plan. We ended up doing the first 2 steps as there were numerous issues with flue sizes which Steve solved and got everything done and fixed. He was very open about what needed doing and what the worse case scenario could be. It was I'm sure a nightmare job for him as he had to keep coming back and forth but he did it all in his stride with good humor.",
    "date": "2017-10-26",
    "postcode": "RH16"
  },
  {
    "title": "Boiler service",
    "text": "Work carried out swiftly and efficiently.",
    "date": "2017-10-24",
    "postcode": "RH16"
  },
  {
    "title": "Emergency plumbing leak",
    "text": "So impressed with the service I received. It was an emergency call out as my insurance company had let me down with getting a plumber here. I was very upset but when Steve turned up he completed the necessary works and so grateful that he turned out on a Sunday. Thank you so much from a very, very happy customer. Will recommend you to anyone who needs a excellent plumber.",
    "date": "2017-10-22",
    "postcode": "RH12"
  },
  {
    "title": "Boiler service",
    "text": "Very courteous and efficient work. Highly recommended.",
    "date": "2017-10-20",
    "postcode": "BN1"
  },
  {
    "title": "Remove airlock in cold water system in bathroom",
    "text": "Colin was fast, efficient + knowledgeable.",
    "date": "2017-10-20",
    "postcode": "RH10"
  },
  {
    "title": "Leak from underneath toilet system",
    "text": "Arrived when expected and fixed in good time, great service! Thank you.",
    "date": "2017-10-18",
    "postcode": "RH10"
  },
  {
    "title": "New boiler installation and thermostat",
    "text": "We have used Steve and Evo for several years now and as always the service was professional, friendly, and completed to a very high standard and on time.",
    "date": "2017-10-18",
    "postcode": "RH12"
  },
  {
    "title": "Boiler service",
    "text": "Excellent service, punctual, would highly recommend.",
    "date": "2017-10-17",
    "postcode": "BN6"
  },
  {
    "title": "Fixed a leaking value and installed a washing machine",
    "text": "Fast and efficient service for a challenging job.",
    "date": "2017-10-16",
    "postcode": "RH15"
  },
  {
    "title": "Boiler service",
    "text": "Great service, good advice re parts.",
    "date": "2017-10-11",
    "postcode": "RH15"
  },
  {
    "title": "Drain unblock",
    "text": "Punctual , polite.",
    "date": "2017-10-09",
    "postcode": "RH15"
  },
  {
    "title": "Restored heat to top floor radiators",
    "text": "Excellent work. Good time keeping, clear communication, and work done at a fair price.",
    "date": "2017-10-05",
    "postcode": "RH10"
  },
  {
    "title": "New Taps, and Vent Pipe",
    "text": "I'm usually wary of calling tradesmen in and prefer normally tp try to give most things a go myself, but this time I didn't have the tools or the time. Evo had Great comms, were able to make it the same day and really got me out of a grim situation, Colin was friendly, relaxed and very helpful. He was attentive to his work and made sure that it was absolutely necessary to change the vent pipe, he did an outstanding job and the price was great too. Would definitely use again. A++++++",
    "date": "2017-10-02",
    "postcode": "RH10"
  },
  {
    "title": "Cap old iron gas pipe under floor",
    "text": "Excellent work on a difficult job. Punctual, clean, and price as quoted. Went the extra mile to ensure joists and floor were properly supported.",
    "date": "2017-09-30",
    "postcode": "BN6"
  },
  {
    "title": "Leaking toilet join/valve",
    "text": "Punctual, courteous and excellent worker.",
    "date": "2017-09-29",
    "postcode": "RH14"
  },
  {
    "title": "Renewing dual fuse",
    "text": "Efficient and good.",
    "date": "2017-09-28",
    "postcode": "RH15"
  },
  {
    "title": "Washing machine pipe fixed",
    "text": "Very thorough.",
    "date": "2017-09-27",
    "postcode": "RH1"
  },
  {
    "title": "Replaced daunt washer 2 valves",
    "text": "Excellent communication, fast service. Work completed and explained.",
    "date": "2017-09-27",
    "postcode": "RH12"
  },
  {
    "title": "Boiler service",
    "text": "Professional, friendly and knowledgeable service will not hesitate to use again.",
    "date": "2017-09-20",
    "postcode": "BN6"
  },
  {
    "title": "New boiler fitted initially with a power flush of all radiators, plus service, plus gas safety test of existing cooker/mains supply",
    "text": "What a breath of fresh air this experience was!. We brought a new property but found out the hard way that the boiler was shot. We selected Evo plumbing, heating and drainage to give us some guidance and a quote. We were very happy with the competitive quote. The engineer arrived every day on time and each day he worked a full day while keeping his work area very clean. Our engineer Mr S Morgan was extremely polite, professional and listened to what we said and was happy to answer any questions we had. He also helped us to choose the right product for us and did an exceptional job.",
    "date": "2017-09-20",
    "postcode": "BN24"
  },
  {
    "title": "Toilet repair",
    "text": "Reliable and completed quickly. Great work-thank you!",
    "date": "2017-09-09",
    "postcode": "RH20"
  },
  {
    "title": "Boiler service",
    "text": "Friendly, helpful and provided advice beyond what I` d expect.",
    "date": "2017-09-07",
    "postcode": "RH12"
  },
  {
    "title": "Replace both toilet valves",
    "text": "Excellent, efficient and identified the problem quickly.",
    "date": "2017-08-26",
    "postcode": "BN6"
  },
  {
    "title": "Replacement inlet valve on toilet",
    "text": "Very pleased with same day service.",
    "date": "2017-08-15",
    "postcode": "RH12"
  },
  {
    "title": "Gas safety certificate and boiler service",
    "text": "Work carried out efficiently and professionally. Steve both friendly and helpful, fully recommend.",
    "date": "2017-08-15",
    "postcode": "RH16"
  },
  {
    "title": "Replace Prvin unvented heating system",
    "text": "Straightforward - came when they said - did what they needed to - Stephen was very helpful and courteous.",
    "date": "2017-08-04",
    "postcode": "RH16"
  },
  {
    "title": "Macerator",
    "text": "Friendly, helpful, good communication.",
    "date": "2017-08-04",
    "postcode": "BN7"
  },
  {
    "title": "Changed washer on tap in bathroom",
    "text": "Came quickly as promised and finished the job as requested.",
    "date": "2017-07-29",
    "postcode": "BN6"
  },
  {
    "title": "New hot water tank fitted",
    "text": "Brilliant service, prompt, pleasant and excellent craftsmanship. I'm very happy, after being let down by a company I have a service policy with. I was reassured and the leaking tank was replaced quickly.",
    "date": "2017-07-26",
    "postcode": "RH15"
  },
  {
    "title": "Install Emersion heater",
    "text": "Happy and contented.",
    "date": "2017-07-25",
    "postcode": "RH12"
  },
  {
    "title": "Dripping tap, toilet repair, push plug replacement, overflow on water tank",
    "text": "Friendly, efficient, punctual, helpful service. Colin was very helpful and tidied up. Thank you.",
    "date": "2017-07-17",
    "postcode": "RH14"
  },
  {
    "title": "Replace toilet fill valve",
    "text": "Very good service.",
    "date": "2017-07-13",
    "postcode": "RH12"
  },
  {
    "title": "Repair washing machine leak",
    "text": "Very punctual, polite and helpful service. Diagnosed problem quickly.",
    "date": "2017-07-12",
    "postcode": "CR3"
  },
  {
    "title": "Cleared block drain",
    "text": "Good job, professional and courteous got the job done in 10 minutes.",
    "date": "2017-07-10",
    "postcode": "RH15"
  },
  {
    "title": "Clearance of under sink drain",
    "text": "Came out promptly (about a couple of hours after phone call). Very pleasant to deal with.",
    "date": "2017-07-10",
    "postcode": "RH15"
  },
  {
    "title": "Clean drains CCTV drain runs",
    "text": "Very professional, polite, well organised and informative. Arrived on time and completed the job.",
    "date": "2017-07-10",
    "postcode": "RH10"
  },
  {
    "title": "Replace toilet fill valve",
    "text": "Excellent service, most attentive, very polite, will certainly use your company in the future.",
    "date": "2017-07-03",
    "postcode": "RH15"
  },
  {
    "title": "New combine boiler/ flu, new radiators and piping",
    "text": "Very polite, professional company who did what they said they would do on and on line.",
    "date": "2017-06-22",
    "postcode": "RH12"
  },
  {
    "title": "Replace kitchen tap",
    "text": "Very prompt. Very helpful.",
    "date": "2017-06-16",
    "postcode": "RH12"
  },
  {
    "title": "Unblock drain",
    "text": "Very good service.",
    "date": "2017-06-16",
    "postcode": "RH1"
  },
  {
    "title": "Replace flush mechansim , fit new outside tap, clear blocked drain",
    "text": "Great friendly service, timely and on budget /quote.",
    "date": "2017-06-04",
    "postcode": "RH15"
  },
  {
    "title": "Unblocking drains",
    "text": "Fast and efficient.",
    "date": "2017-06-04",
    "postcode": "KT10"
  },
  {
    "title": "Resealed faulty sink wasteaway",
    "text": "A quick very efficient fix.",
    "date": "2017-06-02",
    "postcode": "RH1"
  },
  {
    "title": "Removed old boiler, radiators and water tanks. Installed new combi boiler, new radiators and towel rails",
    "text": "Fantastic! Steve and co did an excellent job. Very happy with the result. Clean, tidy, professional and totally trustworthy. Steve worked very hard and finished the job a day early than expected. He kept me informed of everything and answered all of my questions very patiently. Respected my home and cleaned up very well. Steve is a true gentleman, always polite and courteous and his very extensive knowledge and technical skills inspired my confidence in him.",
    "date": "2017-06-01",
    "postcode": "BN6"
  },
  {
    "title": "Plumb in dishwasher, replace kitchen tap",
    "text": "Very good, efficient and friendly.",
    "date": "2017-05-31",
    "postcode": "RH12"
  },
  {
    "title": "Detect toilet leak and resolve",
    "text": "Excellent service highly recommended.",
    "date": "2017-05-31",
    "postcode": "RH12"
  },
  {
    "title": "Blockage and leak in bathroom",
    "text": "Prompt, efficient and very friendly.",
    "date": "2017-05-30",
    "postcode": "BN6"
  },
  {
    "title": "Boiler service and new parts fitted",
    "text": "Happy with work done.",
    "date": "2017-05-25",
    "postcode": "RH12"
  },
  {
    "title": "Installation of washing machine and dishwasher pipes",
    "text": "Friendly service, professional and hardworking.",
    "date": "2017-05-23",
    "postcode": "RH10"
  },
  {
    "title": "Repaired leak in cold water tank in loft",
    "text": "Prompt reply to an urgent call water pouring out of over flow pipe. Water everywhere, luckily in the garden.",
    "date": "2017-05-22",
    "postcode": "RH10"
  },
  {
    "title": "Replacement valve in toilet cistern",
    "text": "Efficient and friendly service. Kept to appointment , good quality work and tided up after.",
    "date": "2017-05-22",
    "postcode": "RH15"
  },
  {
    "title": "Fixed valve in loft",
    "text": "I am happy with the work completed.",
    "date": "2017-05-18",
    "postcode": "RH10"
  },
  {
    "title": "Replacement of high pressure valve on unvencg hot water tank",
    "text": "Very good / good communication clean pricing next and tidy arrived on time.",
    "date": "2017-05-17",
    "postcode": "BN7"
  },
  {
    "title": "Replacement of kitchen tap",
    "text": "On time, early. Done quickly and efficiently.",
    "date": "2017-05-13",
    "postcode": "RH16"
  },
  {
    "title": "Boiler service",
    "text": "Prompt courteous and tidy.",
    "date": "2017-05-12",
    "postcode": "RH10"
  },
  {
    "title": "Replacement under sink water heater",
    "text": "Harvey and his team were very polite, and got the work done very quickly. They came out to view the problem promptly and came back as soon as they had the parts needed. They were all very polite and kept us very well informed. The price paid was the same as the price quoted. They left no mess at all and everything works perfectly now.",
    "date": "2017-05-12",
    "postcode": "RH15"
  },
  {
    "title": "Clearing out a blocked drain",
    "text": "Had a great a really good turn around for the whole process. Didn't take long at all, was friendly and professional.",
    "date": "2017-05-09",
    "postcode": "RH6"
  },
  {
    "title": "Unblock shower and fix toilet",
    "text": "Job done well and efficiently.",
    "date": "2017-05-04",
    "postcode": "BN6"
  },
  {
    "title": "Replace valve. Boiler breakdown",
    "text": "Smashing, excellent, clean, tidy and good looking.",
    "date": "2017-05-04",
    "postcode": "RH12"
  },
  {
    "title": "Blocked drain clearance",
    "text": "Arrived on time and resolved the issue promptly. I would recommend",
    "date": "2017-04-27",
    "postcode": "RH2"
  },
  {
    "title": "Unblock pipe leading to main stack, once diagnosed",
    "text": "Very helpful, polite and efficient. Great service.",
    "date": "2017-04-26",
    "postcode": "RH12"
  },
  {
    "title": "Changed cistern fitting due to slow re fill",
    "text": "Great communication, work completed to complete satisfaction. Quick, friendly. Recommend.",
    "date": "2017-04-20",
    "postcode": "RH15"
  },
  {
    "title": "Leaking toilet",
    "text": "Work done satisfactory, Colin very helpful and pleasant person.",
    "date": "2017-04-20",
    "postcode": "RH1"
  },
  {
    "title": "Replaced flush system",
    "text": "Colin was brilliant.",
    "date": "2017-04-19",
    "postcode": "RH10"
  },
  {
    "title": "Removal of 2 x ball valves and capping of pipes",
    "text": "Very reliable, turned up when expected, quality of work excellent. Will use again.",
    "date": "2017-04-14",
    "postcode": "RH12"
  },
  {
    "title": "Replace toilet fill valve",
    "text": "Prompt call out , work done as requested , all good.",
    "date": "2017-04-11",
    "postcode": "RH16"
  },
  {
    "title": "Repair leak on tap",
    "text": "Good work.",
    "date": "2017-04-09",
    "postcode": "CR6"
  },
  {
    "title": "Fitting new valves to water tank and toilet. Flushing heating system",
    "text": "Good friendly and professional work. All completed as described.",
    "date": "2017-04-06",
    "postcode": "RH10"
  },
  {
    "title": "Fill in manhole and reroute soil pipe",
    "text": "Excellent. Would highly recommend.",
    "date": "2017-04-05",
    "postcode": "RH12"
  },
  {
    "title": "Replace toilet fill valve",
    "text": "Very good efficient service to replace toilet valve.",
    "date": "2017-04-05",
    "postcode": "RH12"
  },
  {
    "title": "Install radiator",
    "text": "Great work.",
    "date": "2017-04-05",
    "postcode": "RH14"
  },
  {
    "title": "Repair leak in loft",
    "text": "Very happy with the quick response.",
    "date": "2017-04-04",
    "postcode": "RH14"
  },
  {
    "title": "Toilet and hand basin fitted in bathroom",
    "text": "Good job done. Informed of work carried out. Left area clean and tidy.",
    "date": "2017-03-31",
    "postcode": "RH10"
  },
  {
    "title": "Unblock Drain at work address",
    "text": "I rang Harvey at lunchtime and by about 2.30 he and his colleague were on site sorting the problem out. The drain was severely blocked and overflowing. It took them about 1.5 hours to clear it due to the issue but they duly did. They were polite and efficient. I'd have no problems recommending them.",
    "date": "2017-03-21",
    "postcode": "RH10"
  },
  {
    "title": "Installed new toilet system",
    "text": "Excellent service. Perfect job done at very reasonable price. Would definitely use again.",
    "date": "2017-03-20",
    "postcode": "RH12"
  },
  {
    "title": "Supply and install fan for boiler and heater",
    "text": "Very pleased with the speed of the service and competency of the work done.",
    "date": "2017-03-15",
    "postcode": "RH12"
  },
  {
    "title": "Boiler service",
    "text": "Very happy with the service provided",
    "date": "2017-03-13",
    "postcode": "BN44"
  },
  {
    "title": "Repair leak",
    "text": "Quick and good.",
    "date": "2017-03-12",
    "postcode": "RH14"
  },
  {
    "title": "Replacement pipe for d/w leak to radiator re sealing bath",
    "text": "Work carried out quickly, efficiently and tidily.",
    "date": "2017-03-08",
    "postcode": "BN6"
  },
  {
    "title": "Leak from washing machine",
    "text": "Colin was here very quickly after my phone call and could not have been more helpful.",
    "date": "2017-03-08",
    "postcode": "RH12"
  },
  {
    "title": "Unblocking toilet",
    "text": "Very good.",
    "date": "2017-03-07",
    "postcode": "RH10"
  },
  {
    "title": "Drain cleared",
    "text": "Arrived early, did the job quickly and was very friendly.",
    "date": "2017-03-01",
    "postcode": "BN6"
  },
  {
    "title": "Unblock upstairs toilet",
    "text": "Colin was very clean and tidy and kept me informed. Very happy to recommend to friends. Brilliant service.",
    "date": "2017-03-01",
    "postcode": "RH15"
  },
  {
    "title": "Blocked hand basin",
    "text": "Arrived promptly, work carried out efficiently by Colin.",
    "date": "2017-02-27",
    "postcode": "RH2"
  },
  {
    "title": "Fixed toilet",
    "text": "Great service. Thanks Colin.",
    "date": "2017-02-26",
    "postcode": "RH15"
  },
  {
    "title": "Unblocking toilet",
    "text": "Excellent service, very polite and full of hanging tips. Did the job required. Called at 3pm and he was here at 4pm.",
    "date": "2017-02-23",
    "postcode": "RH15"
  },
  {
    "title": "Broken toilet-slow filling system",
    "text": "Friendly service, came on time and explained the issues when asked, with advice on other issues too.",
    "date": "2017-02-17",
    "postcode": "RH1"
  },
  {
    "title": "Annual service on boiler",
    "text": "Thorough and very professional.",
    "date": "2017-02-15",
    "postcode": "RH12"
  },
  {
    "title": "Replaced 3 part valve and leak detection",
    "text": "Very good and prompt.",
    "date": "2017-02-13",
    "postcode": "RH10"
  },
  {
    "title": "Replace valve by central heating pump",
    "text": "Excellent service as always.",
    "date": "2017-02-13",
    "postcode": "RH10"
  },
  {
    "title": "Boiler service and repair",
    "text": "Great. Very prompt, explained all work, will use again and recommend.",
    "date": "2017-02-13",
    "postcode": "RH15"
  },
  {
    "title": "Fitted new kitchen waste",
    "text": "Arrived as agreed and was very polite and efficient, had some difficulty fitting overflow on old sink, we had a slight leak afterwards, came immediately hen notified and fixed, superb!",
    "date": "2017-02-13",
    "postcode": "RH16"
  },
  {
    "title": "Annual boiler maintenance check",
    "text": "Annual boiler maintenance visit. Explained clearly actions conducted and completed. Will use Steve again for future work.",
    "date": "2017-02-13",
    "postcode": "RH12"
  },
  {
    "title": "Install of taps and dishwasher",
    "text": "Great service! Quick, polite, would recommend.",
    "date": "2017-02-12",
    "postcode": "RH15"
  },
  {
    "title": "Repair toilet flush",
    "text": "Extremely good.",
    "date": "2017-02-10",
    "postcode": "RH12"
  },
  {
    "title": "Problem with overflowing soakaway",
    "text": "So pleased that we called out your company to do this job. Harvey found the fault almost immediately and cleared the blockage. Will definitely recommend you to our friends/family.",
    "date": "2017-02-09",
    "postcode": "TN34"
  },
  {
    "title": "Emergency plumbing leaking boiler",
    "text": "Excellent service.",
    "date": "2017-02-07",
    "postcode": "RH14"
  },
  {
    "title": "Clean blocked drain",
    "text": "Amazing quick service! Brilliant job, would thankfully recommend.",
    "date": "2017-02-06",
    "postcode": "RH15"
  },
  {
    "title": "Repairs to remedy leaks in bathroom",
    "text": "Colin arrived on time and fixed a leaking radiator, a shower head and a leaking tap. They are now operating correctly. I have found this company to be highly reliable.",
    "date": "2017-02-06",
    "postcode": "RH2"
  },
  {
    "title": "New sink fitted",
    "text": "Harvey has done some work for us before, he is always prompt and always answers his phone whenever we need any sort of plumbing job to be done. He always works to a very high standard. We feel lucky to find him.",
    "date": "2017-02-03",
    "postcode": "RH15"
  },
  {
    "title": "Replaced heating pump",
    "text": "Colin the best professional guy for heating and plumbing service and was very keen to complete the task without any problem to home owner.",
    "date": "2017-02-03",
    "postcode": "RH10"
  },
  {
    "title": "Replacement of boiler",
    "text": "I am very pleased with the work. Harvey and Steve are fantastic: honest, diligent and conscientious, and fantastic value for money. Highly recommended.",
    "date": "2017-02-02",
    "postcode": "RH15"
  },
  {
    "title": "Pump fixed and emergency radiator maintenance",
    "text": "The guy is a lifesaver, my radiator sprung a leak and he came straight out as well as checked my pump as there appeared to be something wrong, no idea what it was but it was fixed. I recommend EVO Plumbing to anyone and everyone.",
    "date": "2017-01-30",
    "postcode": "RH10"
  },
  {
    "title": "Replace fill valve and descale flush valve",
    "text": "Professional and reliable service.",
    "date": "2017-01-28",
    "postcode": "RH12"
  },
  {
    "title": "Power flush",
    "text": "Quality service with no hidden extras. I highly recommend EVO for all your plumbing needs",
    "date": "2017-01-27",
    "postcode": "RH10"
  },
  {
    "title": "Replace toilet flush valve and components",
    "text": "First class, speedy, efficient in very difficult conditions.",
    "date": "2017-01-27",
    "postcode": "RH2"
  },
  {
    "title": "Clear drain",
    "text": "Good, reliable, friendly.... not a tough job but well done.",
    "date": "2017-01-27",
    "postcode": "RH1"
  },
  {
    "title": "Gas service + safety certificate",
    "text": "Good service.",
    "date": "2017-01-20",
    "postcode": "RH10"
  },
  {
    "title": "Cleared blocked sewer",
    "text": "Arrived at time agreed with quick, efficient clearing of 3 chambers and cleared up debris.",
    "date": "2017-01-20",
    "postcode": "RH15"
  },
  {
    "title": "Unblocking toilet",
    "text": "Harvey was very friendly and polite and suggested other alternatives if the problem was not resolved.",
    "date": "2017-01-06",
    "postcode": "RH16"
  },
  {
    "title": "Clear drain blocked with solids",
    "text": "Good, reliable, friendly. Made an excellent job of restoring our drainage system after a botched attempt by other contractors..... a tough job very well done. ",
    "date": "2016-12-27",
    "postcode": "RH10"
  },
  {
    "title": "Repair a leak to a toilet cistern.",
    "text": "Very prompt response to my phone call and excellent work completed",
    "date": "2016-12-26",
    "postcode": "BN44"
  },
  {
    "title": "Run a new gas line into the house",
    "text": "Excellent, quick service provided. Quick to come and assess, started the work an hour later. Very happy with EVO plumbing and heating Ltd.",
    "date": "2016-12-08",
    "postcode": "BN6"
  },
  {
    "title": "New tap on kitchen sink",
    "text": "Very happy with speed, they came when I phoned and very happy with Colin and his work",
    "date": "2016-12-07",
    "postcode": "RH13"
  },
  {
    "title": "Parts of boiler replaced.",
    "text": "Brilliant service, it was a challenging job but Steve worked very efficiently and I really felt like he went that extra mile to get the parts he didn't have and complete the work as thoroughly as possible in a minimal time. He kept me informed the whole way through and allowed me to understand the process as well as provided safety advice. Very pleased",
    "date": "2016-11-29",
    "postcode": "RH19"
  },
  {
    "title": "Replaced leaking valve and toilet flush",
    "text": "Prompt communication and response throughout, resolved problem quickly, very friendly operative",
    "date": "2016-11-28",
    "postcode": "RH12"
  },
  {
    "title": "Assessed broken boiler. Fitted new fan. Cleaned boiler",
    "text": "Steve was excellent! Very approachable. Very knowledgeable. Clean and tidy worker. Cannot recommedn Steve and EVO heating more highly!",
    "date": "2016-11-25",
    "postcode": "BN6"
  },
  {
    "title": "Remove, repair and reinstall bathroom suite after I was left with an unsafe installation by another tradesman",
    "text": "Steve has literally come to my rescue after is been left with an unsafe bathroom installation by another company, who really shouldn't be allowed to trade! He had to remove the toilet completely and build it up to the right height to flow away into the waste and installed it properly. He had to secure the bath, cut the side panel and fix properly to the bath and cut out all the mastic before re applying properly. He then remade the boxing in which had been left in an appalling state. He is the cleanest, tidiest workman I've come across and would recommend his services happily",
    "date": "2016-11-24",
    "postcode": "BN1"
  },
  {
    "title": "Replacement of bottom entry ball valve",
    "text": "Harvey has been a pleasure to deal with from the outset, he was prompt, professional and reasonably priced",
    "date": "2016-11-21",
    "postcode": "BN7"
  },
  {
    "title": "Locate fault with gas central heating",
    "text": "When I contacted this company because we had no heating to our radiators, Harvey replied within hours, he suggested a visit from his partner Steve to diagnose the problem. Miraculously, Steve located a fault in the system that the Baxi engineer failed to find during his inspection six days earlier. Several other engineers had previously failed to find the fault too. The Baxi engineer said the system needed Power Flushing - a huge expense. Within an hour, Steve discovered the fault to be with the Drayton Wireless receiver. 1st rate response. 1st rate service. Very reasonable cost. Huge thanks",
    "date": "2016-11-16",
    "postcode": "BN7"
  },
  {
    "title": "Leak on PRV regarage expansion vessel",
    "text": "Called at 10.00 out by 16.00 same day to fix leak on hot water cylinder, excellent service very polite",
    "date": "2016-11-14",
    "postcode": "RH19"
  },
  {
    "title": "Blocked toilet",
    "text": "Came and saw us very promptly, carried out work in good time very satisfied.",
    "date": "2016-11-07",
    "postcode": "GU7"
  },
  {
    "title": "Repair toilet not flushing",
    "text": "Excellent - repaired toilet, explained what they did and how to prevent it happening again",
    "date": "2016-10-27",
    "postcode": "RH19"
  },
  {
    "title": "New radiator and all radiators on upper floor checked",
    "text": "Very good work, came at short notice which was necessary because we had a leaking radiator",
    "date": "2016-10-25",
    "postcode": "BN1"
  },
  {
    "title": "Toilet repair",
    "text": "They called prior to arrival so we knew when they would arrive. Very helpful and professional service",
    "date": "2016-10-25",
    "postcode": "RH10"
  },
  {
    "title": "Shower cubicle, walls, fittings refit",
    "text": "Steve and Colin did an excellent job of restoring our leaking shower cubicle, including replacing the bathroom walls which were badly damaged by damp, We have used Steve/Evo Plumbing, Heating and Drainage for all our plumbing and heating jobs in our home. And Steve is always a joy to deal with, reliable, punctual, tidy and professional. We would highly recommend Evo Plumbing, Heating and Drainage",
    "date": "2016-10-24",
    "postcode": "RH19"
  },
  {
    "title": "Boiler repair",
    "text": "I have used Steve on many occasions now because he is reliable, contactable and will always call back if a message is left for him. His work is to a high standard and he is always there when it really counts",
    "date": "2016-10-19",
    "postcode": "RH2"
  },
  {
    "title": "Install cooker",
    "text": "Friendly good workmanship, on time - excellen",
    "date": "2016-10-11",
    "postcode": "RH16"
  },
  {
    "title": "Powerflush heating system and valve change",
    "text": "My faith in plumbers is restored! Called EVO when 2 previous companies had not been able to get to the bottom of the problem. the engineer diagnosed the problem very quickly and managed to restore full heating and hot water functionality. In fact my radiators have never been as warm as they are now. Absolutely excellent first class job.",
    "date": "2016-09-28",
    "postcode": "BN1"
  },
  {
    "title": "Boiler and gas fire service",
    "text": "All done quickly and effectively",
    "date": "2016-09-28",
    "postcode": "RH16"
  },
  {
    "title": "Boiler and gas fire serviced",
    "text": "Steve serviced our boiler and noted it needed a new part. He came back a week later and fitted the part and serviced our gas fire as we requested. The boiler needed a good clean and maintenance and Steve did this with patience and care. Many thanks",
    "date": "2016-09-20",
    "postcode": "RH6"
  },
  {
    "title": "Pipe repair and boiler switch",
    "text": "Excellent quality of work. Friendly service and very informative. Steve was great at keeping us up to date with everything that was happening throughout the works",
    "date": "2016-09-15",
    "postcode": "RH4"
  },
  {
    "title": "To move gas hob pipe, so the oven would fit",
    "text": "On time, excellent and professional job, well done Harvey",
    "date": "2016-09-13",
    "postcode": "RH10"
  },
  {
    "title": "Drain survey",
    "text": "Very good - thorough and helpful",
    "date": "2016-09-12",
    "postcode": "BN6"
  },
  {
    "title": "Unblocked bath and wash basin pipes",
    "text": "Very pleasant and polite and helpful.",
    "date": "2016-09-12",
    "postcode": "RH13"
  },
  {
    "title": "Leaking water through ceiling",
    "text": "He came out very quickly, worked very hard and clean, a pleasure to have in the house",
    "date": "2016-09-08",
    "postcode": "RH12"
  },
  {
    "title": "Gas hob fitted",
    "text": "On time excellent job, good price",
    "date": "2016-09-07",
    "postcode": "RH10"
  },
  {
    "title": "Power flush, replace 3-port valve, fit new basin tap",
    "text": "Steve and Colin arrived on time, immediately laid down dust sheets, were courteous throughout and kept us informed of progress. Went the extra mile to thoroughly flush our system which had built up sludge over many years, and carefully checked all aspects of their work and tidied up before departure. Also in passing found a problem with our cold water tank which they rectified at no extra cost. Based on my experience, I would recommend Evo Home Services without hesitation",
    "date": "2016-09-02",
    "postcode": "RH16"
  },
  {
    "title": "Gas safety check and gas safety inspection",
    "text": "Steve did gas safety check. All went well, very friendly. and excellent service",
    "date": "2016-08-30",
    "postcode": "RH14"
  },
  {
    "title": "Cistern repair",
    "text": "Arrived on time, fault found and full repair. Clean and tidy work. All explained",
    "date": "2016-08-25",
    "postcode": "RH6"
  },
  {
    "title": "Water tank capped.",
    "text": "Prompt arrival and job done quickly",
    "date": "2016-08-25",
    "postcode": "RH1"
  },
  {
    "title": "Unblocked main sewage drain",
    "text": "Can't fault Harvey's work. Excellent job well done. Thank you.",
    "date": "2016-08-19",
    "postcode": "RH17"
  },
  {
    "title": "New bath and radiator, power flush, boiler service and other maintenance work",
    "text": "I am very happy with the work done by Steve and team. It was not easy fiddling with the old bathroom, but they have done a good job and they charged me exactly as quoted even though it was more complicated than they anticipated. They were very polite and Steve also gave me valuable recommendations. There was a small leak in one of the pipe joints after their work, but Steve responded very fast and fixed it within hours after I told him. I will surely go to Steve for future work as well",
    "date": "2016-08-19",
    "postcode": "BN1"
  },
  {
    "title": "Replacing the system valves in cistern",
    "text": "Good quick service, arrived on time. Polite, cleaned up afterwards",
    "date": "2016-08-16",
    "postcode": "BN6"
  },
  {
    "title": "Replace shower stop-cocks /leaking",
    "text": "First class job. EVO came and rectified work that a previous plumber had failed to do correctly. Thoroughly recommended.",
    "date": "2016-08-11",
    "postcode": "BN1"
  },
  {
    "title": "Broken tap.",
    "text": "Punctual, thorough, friendly service",
    "date": "2016-08-10",
    "postcode": "RH1"
  },
  {
    "title": "Fixed cistern",
    "text": "Very competent work, recommend.",
    "date": "2016-08-09",
    "postcode": "BN1"
  },
  {
    "title": "Boiler service & washer change",
    "text": "Great service - on time and informative , would recommend to family and friends.",
    "date": "2016-08-02",
    "postcode": "BN6"
  },
  {
    "title": "New water pump and sink fitted",
    "text": "Very efficient service . Good advice given and price exactly as quoted",
    "date": "2016-08-02",
    "postcode": "RH15"
  },
  {
    "title": "Unblocked drain",
    "text": "Fantastic service. On time and did a great job with a difficult drain",
    "date": "2016-07-26",
    "postcode": "RH16"
  },
  {
    "title": "Reconnected gas to boiler after another company disconnected supply in error",
    "text": "Steve was brilliant! An inspection company wrongly determined that our flue was incorrectly installed and disconnected our gas to the boiler. Steve verified with the manufacturer that the install was as per regulation and reconnected us on the same day. Great, honest and good service.",
    "date": "2016-07-26",
    "postcode": "RH14"
  },
  {
    "title": "New shower valve fitted and repair to water tank in loft",
    "text": "Very pleased with Steve arrived on time and spent virtually all day working to solve our problem. Polite and efficient, good tidy work, highly recommended.",
    "date": "2016-07-25",
    "postcode": "RH2"
  },
  {
    "title": "Replaced leaking flexible hose under toilet.",
    "text": "Excellent service from EVO again when we discovered our own water feature in the bathroom. They responded quickly, and our thanks to Stephen who calmly and quickly dealt with the faulty hose. They are now the first company we would turn to in any further issues with the plumbing",
    "date": "2016-07-23",
    "postcode": "RH15"
  },
  {
    "title": "Clear blocked W C drain",
    "text": "Very efficient at clearing and clear explanation on how to prevent what had been a re-occurring problem. so glad I contacted EVO as the problem has now been resolved once and for all.",
    "date": "2016-07-22",
    "postcode": "RH16"
  },
  {
    "title": "Fixed a leak from the upstairs bathroom to downstairs ceiling",
    "text": "Steve was brilliant and really helpful. Will definitely be keeping his number for any further plumbing issues and will be recommending to my friends and family.",
    "date": "2016-07-20",
    "postcode": "RH2"
  },
  {
    "title": "Drain survey",
    "text": "A number of issues had cropped up with a house we were buying. Harvey and EVO acted promptly to survey and record our drains. They provided us with a clear and concise report. and took the stress out of the situation. ",
    "date": "2016-07-18",
    "postcode": "RH2"
  },
  {
    "title": "Fixed shower leak and repaired unit",
    "text": "First phone call at 9am, fixed by midday, tidily and all working fine. Excellent, will use again",
    "date": "2016-07-02",
    "postcode": "RH17"
  },
  {
    "title": "New toilet cistern installed",
    "text": "Can highly recommend this tradesman for his patience, understanding, courtesy, excellent response time and pleasant manner. He was able to diagnose the problem by knowledgeable questioning and within five minutes of my call had arranged for his partner to attend the problem which was repaired within the hour",
    "date": "2016-06-24",
    "postcode": "BN7"
  },
  {
    "title": "Boiler and gas fire serviced. Changed fan in boiler",
    "text": "Brilliant service. Work was completed quickly and tidily. Steve was happy to discuss the state of our boiler and make recommendations for the future without any pressure for us to replace it, despite its age.",
    "date": "2016-06-22",
    "postcode": "RH6"
  },
  {
    "title": "Replace radiators and replace TRV",
    "text": "Great service. Highly recommend. Tjhey fitted work around us and were friendly and considerate at all times. Great company!",
    "date": "2016-06-21",
    "postcode": "RH10"
  },
  {
    "title": "New boiler fitted",
    "text": "Steve was polite and friendly. He was conscious of keeping the house as tidy as possible, and did a good job in doing so. He explained clearly the work which needed doing, and how much this would cost at the start. Really pleased with the new boiler. Would highly recommend",
    "date": "2016-06-21",
    "postcode": "RH6"
  },
  {
    "title": "Boiler service",
    "text": "Great service, very prompt and efficient.",
    "date": "2016-06-14",
    "postcode": "RH12"
  },
  {
    "title": "Fixed running toilet and changed kitchen taps",
    "text": "Really helpful guy explained everything clearly no pressure to do work and really reasonable. Would definitely recommend. Punctual too!",
    "date": "2016-06-14",
    "postcode": "RH19"
  },
  {
    "title": "Replaced the innards of my cloakroom cistern",
    "text": "Contacted at short notice and was able to fit me in at short notice. Was delayed by a previous job but kept me informed throughout. When it became apparent that a further issue needed attention worked late until the job was completed. Very, very grateful as my wife runs a child minding business from home and a functional downstairs toilet is essential! Would recommend without hesitation.",
    "date": "2016-06-05",
    "postcode": "RH4"
  },
  {
    "title": "Replaced a broken valve on heating system",
    "text": "Steve was great! He was always very polite and courteous even in his emails. I ended up messing him around a bit when I thought I'd fixed the problem, only to have to phone him up again a couple of days later because it had broken again, and he was very nice about it, he didn't even bat an eyelid. He was friendly, very quick and very reasonably priced. Would definitely use again",
    "date": "2016-06-02",
    "postcode": "RH14"
  },
  {
    "title": "Replacement of tap heads on bathroom basin.",
    "text": "I am very pleased with the work. Mixer tap is now as good as new. Harvey carried the spares on his vehicle so was able to complete the work in one visit. A very courteous and reliable service with work to a high standard and at a reasonable cost. I would use this company again",
    "date": "2016-06-01",
    "postcode": "RH15"
  },
  {
    "title": "Replacing outside tap",
    "text": "Replied immediately to phone call, arrived at time stated. Very satisfied with work undertaken and service provided",
    "date": "2016-05-28",
    "postcode": "RH13"
  },
  {
    "title": "Boiler service.",
    "text": "Arrived on time. Very pleasant person. Would recommend entirely",
    "date": "2016-05-26",
    "postcode": "RH19"
  },
  {
    "title": "New shower pump and valve fitted",
    "text": "Lovely guy. Very friendly and helpful. Kept me informed all through the processes. Price as quoted. Would definitely use again and recommend to others",
    "date": "2016-05-26",
    "postcode": "RH4"
  },
  {
    "title": "Leak coming from washing machine and washing machine waste back flowing up the sink",
    "text": "I received excellent service from this firm. The plumber persevered to solve the problem, was excellent and polite and friendly",
    "date": "2016-05-22",
    "postcode": "CR3"
  },
  {
    "title": "Repair of non flushing toilet cistern",
    "text": "Quick response to initial call. Arrived on time, completed job efficiently",
    "date": "2016-05-18",
    "postcode": "RH17"
  },
  {
    "title": "Fitting bathroom wash basin",
    "text": "Very pleased with the overall job. Very clean job completed in difficult conditions.",
    "date": "2016-05-06",
    "postcode": "RH16"
  },
  {
    "title": "New pump fitted, gate valve and primary circuit board changed on boiler",
    "text": "Steve has carried out a few jobs with out water and boiler system. Very professional; he helped explain the options for repair rather than pushing any sale. Would definitely call EVO again",
    "date": "2016-05-03",
    "postcode": "BN7"
  },
  {
    "title": "New boiler fitted",
    "text": "Needed a new boiler as quickly as possible as we had had no hot water or heating for 7 days and original plumber let us down big time. Spoke to Steve late Wednesday afternoon and he started the work 3 working days later. Very pleased with his timekeeping, efficiency ,knowledge and skill. He kept us informed throughout the 2 days as to what to expect. Finished the job at 7.30pm and he was happy to spend another 30 mins explaining and showing us how the boiler works. We have no hesitation in recommending him and will most certainly use him again in the future.",
    "date": "2016-05-03",
    "postcode": "BN1"
  },
  {
    "title": "Power flush central heating",
    "text": "Steve arrived on time and was very respectful to take off his shoes to keep our house clean. He put dust sheets down and kept any unavoidable mess to a minimum. He went above and beyond his work to make sure we were completely happy. He was with us for nearly 10 hours in total and even stayed on to ensure all was working well before he left. The price was very reasonable and we are very happy with the service we received. Highly recommend and will not hesitate to use again.",
    "date": "2016-05-03",
    "postcode": "RH10"
  },
  {
    "title": "Capped pipes and heating change flush valve.",
    "text": "Work done quickly, tidily and efficiently. Would definitely recommend them at any time",
    "date": "2016-04-29",
    "postcode": "GU6"
  },
  {
    "title": "Repaired the combi boiler",
    "text": "Replied to my initial phone call quickly. Came out to see the boiler promptly. He explained what was needed and gave me a price. He completed the job quickly and got the boiler working. He was friendly, tidy and informative. A good find",
    "date": "2016-04-29",
    "postcode": "GU6"
  },
  {
    "title": "Drain pipe cleaned from blockage",
    "text": "First class quality service. The blockage was cleared quickly and effectively and the operative spent considerable time cleaning and washing down the overspill. Would definitely recommend.",
    "date": "2016-04-25",
    "postcode": "RH10"
  },
  {
    "title": "Replacement of leaking u-bend under sink",
    "text": "Called yesterday afternoon and Harvey arrived around 11.00 this morning, having rung first to say he was on the way. He was obviously very busy but nothing was too much trouble and we are very pleased to have the work done so promptly. Thank you Harvey, you are now on our speed dial!",
    "date": "2016-04-15",
    "postcode": "RH17"
  },
  {
    "title": "Clearance of drainage, investigation of macerator",
    "text": "EVO drainage did exactly \"what it said on the tin\". We had a drainage problem specifically with the loo! We had phoned several plumbers and most didn't call back. A couple that did, once they heard the problem may involve the macerator, made no further contact. These guys, Steve and Harvey, responded immediately. They came round asap, evaluated the problem and took immediate action. They kept us informed throughout via text-time/date/arrival etc. We would highly recommend them in future",
    "date": "2016-04-11",
    "postcode": "RH4"
  },
  {
    "title": "Drains cleared.",
    "text": "Helpful and friendly, phoned ahead to let me know what time to be in. Good work done. No fuss, no problems. No complaints from my side. Highly recommended",
    "date": "2016-04-08",
    "postcode": "BN6"
  },
  {
    "title": "Leaking pipe",
    "text": "Punctual and efficient service. Work done quickly and smoothly.",
    "date": "2016-04-08",
    "postcode": "BN6"
  },
  {
    "title": "Toilet not flushing.",
    "text": "Very efficient. Friendly service. Good value. The toilet has never worked so well!",
    "date": "2016-04-08",
    "postcode": "RH12"
  },
  {
    "title": "REPLACED BROKEN CISTERN WORKINGS - FLUSH NOT WORKING",
    "text": "Steve was the only plumber to return my call or email, he was unable to do straight away, though he answered my call straight away (hence 4 days from call to finish). He kept me promptly informed of timing and progress. The job wasn't straight forward due to difficulty with parts (two visits) but now finished my flush is better than it originally was, so very pleased.",
    "date": "2016-04-08",
    "postcode": "RH15"
  },
  {
    "title": "Boiler Repair.",
    "text": "Friendly guys, fixed our rather doddery boiler so it will last a bit longer. Good job",
    "date": "2016-04-07",
    "postcode": "RH15"
  },
  {
    "title": "Drain blockage",
    "text": "Fast, reliable friendly service. would recommend to family and friends",
    "date": "2016-03-31",
    "postcode": "BN5"
  },
  {
    "title": "Leak in ceiling from en suite toilet",
    "text": "Steve was extremely helpful, even. Giving advice on other plumbing matters. Would thoroughly recommend and will call again with any other plumbing needs",
    "date": "2016-03-31",
    "postcode": "RH4"
  },
  {
    "title": "Valve fitted to hot water system.",
    "text": "Polite, timely, very pleasant manner. Excellent job done without any fuss or mess and price exactly as quoted, what else can you ask for?",
    "date": "2016-03-17",
    "postcode": "RH14"
  },
  {
    "title": "Replace immersion heater and control box",
    "text": "The service was efficient + polite. I would certainly use this company again and recommend to others also.",
    "date": "2016-03-15",
    "postcode": "GU6"
  },
  {
    "title": "Boiler service (central heating) and fault identification",
    "text": "A very helpful and knowledgeable boiler engineer. Service carried out quickly and efficiently. Possible fault identified",
    "date": "2016-03-07",
    "postcode": "RH16"
  },
  {
    "title": "Replacement of leaking thermostat valve on radiator",
    "text": "Absolutely delighted with efficiency and work done",
    "date": "2016-03-07",
    "postcode": "RH10"
  },
  {
    "title": "Repaired broken boiler",
    "text": "Excellent work. Repaired the boiler and explained the problem in a clear and understandable way.",
    "date": "2016-03-07",
    "postcode": "BN6"
  },
  {
    "title": "Repair of boiler and boiler service",
    "text": "First class company. Quick and helpful. Cleaned up after themselves. Would use them again!",
    "date": "2016-03-07",
    "postcode": "BN6"
  },
  {
    "title": "Unblocked drainage system which was on the brink of disaster!",
    "text": "I rang Mr Turtle in a panic as my drains were just about to overflow, which would have been potentially disastrous. He said he was just finishing a job and would come straight over. He arrived 15 minutes later and set to work. Problem soon solved. I was very impressed with his work and so grateful he was able to attend so quickly. Very professional as well as a nice chap. Very pleased with the service",
    "date": "2016-03-06",
    "postcode": "RH16"
  },
  {
    "title": "Blocked cold tap and no water in downstairs loo and whistling pipes.",
    "text": "Harvey gave 2hr window for ETA and arrived promptly. Very pleasant and professiona",
    "date": "2016-03-06",
    "postcode": "BN6"
  },
  {
    "title": "Supply and install new combi boiler",
    "text": "Excellent job, very polite, efficient, friendly. Quality of workmanship was first class, even provided us with added value by including a remote control thermostat. Thank you.",
    "date": "2016-03-03",
    "postcode": "RH12"
  },
  {
    "title": "New boiler installed",
    "text": "This job was done totally to fit round us so as to not incovenience us at all Fantastic service, very friendly , recommend..",
    "date": "2016-03-03",
    "postcode": "RH13"
  },
  {
    "title": "New taps in kitchen. New toilet seat",
    "text": "Prompt and excellent and professional",
    "date": "2016-02-27",
    "postcode": "RH1"
  },
  {
    "title": "Drainage survey and drain cleaning service",
    "text": "Friendly and professional service. Report was generated quickly and was very clear and easy to understand.",
    "date": "2016-02-23",
    "postcode": "RH16"
  },
  {
    "title": "Boiler service",
    "text": "“I am delighted to have found EVO. Steve was polite, helpful, efficient. Very reasonable charge for difficult service. I would recommend him to anyone.",
    "date": "2016-02-23",
    "postcode": "RH1"
  },
  {
    "title": "Repair to leak from valve on pipe in loft.",
    "text": "First class tradesman, first class job. Very polite and efficient offered explanation on the work required",
    "date": "2016-02-19",
    "postcode": "RH6"
  },
  {
    "title": "Cleared sewer drain",
    "text": "Anxious to get it cleared ASAP. Came early afternoon. Phoned half an hour ahead. Prompt, friendly and job quickly done. Price charged same as previous other companies on same job for neighbours!",
    "date": "2016-02-15",
    "postcode": "RH17"
  },
  {
    "title": "Fixed toilet flush",
    "text": "Very happy - great service",
    "date": "2016-02-12",
    "postcode": "RH12"
  },
  {
    "title": "Cleared a blocked sewage drain",
    "text": "Very good and came the same day. Meant we could flush the toilets again. Many thanks :)",
    "date": "2016-02-10",
    "postcode": "RH12"
  },
  {
    "title": "Replace radiator in bedroom",
    "text": "Very good service, clean and efficient and very friendly.",
    "date": "2016-02-10",
    "postcode": "RH15"
  },
  {
    "title": "Drain clearance.",
    "text": "Very good - quick + efficient.",
    "date": "2016-02-09",
    "postcode": "BN6"
  },
  {
    "title": "Replace stopcock",
    "text": "Excellent service",
    "date": "2016-02-03",
    "postcode": "RH10"
  },
  {
    "title": "Replaced taps",
    "text": "Very happy with all aspects of the works. Friendly, reliable, professional service",
    "date": "2016-01-29",
    "postcode": "RH2"
  },
  {
    "title": "Remove faulty toilet valve and put new valve in",
    "text": "Responded to my phone call, made effort to keep time stated. Clean, efficient, friendly and courteous. Other plumbers I phoned didn't even respond",
    "date": "2016-01-29",
    "postcode": "RH13"
  },
  {
    "title": "New tap",
    "text": "Harvey was on time and was more than helpful in saving mew new taps",
    "date": "2016-01-27",
    "postcode": "RH1"
  },
  {
    "title": "Boiler service and check up",
    "text": "Would recommend Steve to anyone. Work he has done for me is 10 out of 10! Clean, tidy and very honest.",
    "date": "2016-01-25",
    "postcode": "RH10"
  },
  {
    "title": "New sink vanity unit fitted in down stairs cloak room",
    "text": "Good workmanship, polite and helpful. Asked him to do work as pleased with previous job",
    "date": "2016-01-22",
    "postcode": "RH12"
  },
  {
    "title": "New electric shower fitted",
    "text": "Good service, reliable, reasonable prices",
    "date": "2016-01-16",
    "postcode": "RH10"
  },
  {
    "title": "Clear blocked drain.",
    "text": "Effective and efficient",
    "date": "2016-01-16",
    "postcode": "GU6"
  },
  {
    "title": "Replace taps",
    "text": "An all round professional company from start to finish of job. Kept updates with progress and left bathrooms very clean",
    "date": "2016-01-15",
    "postcode": "RH20"
  },
  {
    "title": "Replaced our boiler 12 months ago and serviced the boiler this year",
    "text": "We first called EVO over when we had a gas leak in a home we had just moved into. He came over promptly, checked the house thoroughly, found and fixed the leak. Our boiler then broke down about a month later and again Steve gave us good advice on our options and when we decided to get the new one installed he did a great job. A year later we have just had Steve round to service the boiler and all was well. I would be happy to recommend Steve to anyone on the basis of his service to us",
    "date": "2016-01-13",
    "postcode": "RH1"
  },
  {
    "title": "Hot water running cold.",
    "text": "Great customer service. Went above what was required of the job. Would definitely use again",
    "date": "2016-01-13",
    "postcode": "RH16"
  },
  {
    "title": "Boiler service supplied and installed kitchen taps",
    "text": "Always very pleased with the work Steve carries out for me. Prompt, reliable and very friendly. Would highly recommend them",
    "date": "2016-01-12",
    "postcode": "RH13"
  },
  {
    "title": "New 35 mm gate valve installed",
    "text": "I'm having a new bathroom fitted and the plumber informed me that the gate valve he had turned off was not turning back on so in a panic I called EVOand spoke with Harvey. He was around the house in less than half an hour and had determined where he could get such an unusual sized part. This was 11:30 today and as at 15:05 new part was installed and up and running. I cannot thank Harvey enough for his prompt service, understanding of the problem and speediness of repair, I've also got a quote for other work from them and will definitely be getting them back in. Thanks Harvey",
    "date": "2016-01-04",
    "postcode": "GU7"
  },
  {
    "title": "Gas fire removed",
    "text": "Great and friendly service",
    "date": "2016-01-04",
    "postcode": "GU7"
  },
  {
    "title": "Toilet cistern leak",
    "text": "On time and very thorough. Thanks EVO",
    "date": "2016-01-04",
    "postcode": "RH15"
  },
  {
    "title": "Boiler and gas fire. Annual service",
    "text": "I use this comapny annually because of the great reliable service. On time, polite and very professional, excellent results.",
    "date": "2016-01-04",
    "postcode": "RH14"
  },
  {
    "title": "Repair leaky toilet",
    "text": "Had difficulty getting any plumber to come out so relieved to have such prompt abd professional service. Did a good job despite difficulties",
    "date": "2015-12-14",
    "postcode": "RH19"
  },
  {
    "title": "New gas hob and kitchen tap fitted",
    "text": "Excellent service, very clean and efficient. Recommended.",
    "date": "2015-12-09",
    "postcode": "RH15"
  },
  {
    "title": "Installation of hand-held bidet showers to two toilets",
    "text": "I have used Harvey and EVO before and as previously, he did an excellent job. Arrived on time, explained issues and solutions, and completed the work to his usual high quality standards. Will definitely continue to use, and to recommend",
    "date": "2015-12-08",
    "postcode": "RH16"
  },
  {
    "title": "Fixed toilet.",
    "text": "Fast, helpful, problem solved",
    "date": "2015-12-03",
    "postcode": "BN1"
  },
  {
    "title": "Boiler service",
    "text": "Quick, efficient service. Really friendly and explained everything well",
    "date": "2015-11-17",
    "postcode": "RH15"
  },
  {
    "title": "Replace ball cock in loft tank",
    "text": "Excellent service, came on day of ceiling within a couple of house",
    "date": "2015-11-11",
    "postcode": "RH12"
  },
  {
    "title": "Callout to boiler repair",
    "text": "I am very happy with all aspects of the service and would happily recommend. Very efficient, stuck to quoted price, and to top it all a great guy.",
    "date": "2015-11-11",
    "postcode": "RH4"
  },
  {
    "title": "Drain clearance",
    "text": "Harvey attended promptly on a Sunday, resolved the problem promptly and I am very happy with the service provided",
    "date": "2015-11-08",
    "postcode": "RH16"
  },
  {
    "title": "Leak to toilet",
    "text": "Repair to leak at the rear of toilet. Repaired in a prompt fashion, clean and tidy and price as quoted",
    "date": "2015-10-29",
    "postcode": "RH6"
  },
  {
    "title": "Change thermostatic valves.",
    "text": "Very reliable, clean and tidy work",
    "date": "2015-10-28",
    "postcode": "RH15"
  },
  {
    "title": "Boiler serviced.",
    "text": "Very professional and friendly. Knowledgeable on our old boiler and pipe system.",
    "date": "2015-10-28",
    "postcode": "RH8"
  },
  {
    "title": "Heating break down",
    "text": "EVO heating fixed my heating in no time. The guy new what he was doing, and fixed it with no inconvenience. EVO repair are outstanding",
    "date": "2015-10-25",
    "postcode": "RH2"
  },
  {
    "title": "Unblock Sewage Drain using Manhole in Garage Floor",
    "text": "Brown sewage water seeping into garage floor from man hole cover. EVO requested to unblock. Excellent Comms incl. Advanced notice of arrival. Job more complex than expected as discov rear porch floor built over most of drain cover stopping removal! Gave permission to cut into floor to expose cover so it could be removed. Blockage was rodded out and area inside man hole power washed out and tested for free flow. EVO rep honest, v polite , quick, completely trustworthy and totally focused on the job. Never used EVO before but would recommend to anyone. ",
    "date": "2015-10-23",
    "postcode": "RH12"
  },
  {
    "title": "Repair and replacement of kitchen taps",
    "text": "Brilliant job, friendly and reliable service.",
    "date": "2015-10-11",
    "postcode": "BN6"
  },
  {
    "title": "Cleared blocked drain in the road",
    "text": "Very friendly and efficient and thorough job done. Ensured problem was resolved. Very happy with service given",
    "date": "2015-09-20",
    "postcode": "RH12"
  },
  {
    "title": "Replaced economy 7 immersion heater",
    "text": "Quick and efficient service. Polite as well, happy to recommend.",
    "date": "2015-09-20",
    "postcode": "RH10"
  },
  {
    "title": "Fix leaky toilet",
    "text": "Identified problem quickly and fixed quickly. Would recommend",
    "date": "2015-09-18",
    "postcode": "RH10"
  },
  {
    "title": "Restore heat to radiators",
    "text": "Absolutely first class service. Our house has never been so warm, thanks.",
    "date": "2015-09-17",
    "postcode": "RH15"
  },
  {
    "title": "Installation of new gas cooker and removal of old one",
    "text": "Very high recommendation, excellent work and service. EVO responded quickly to my initial call, and did the job superbly. The plumber even told a plumber related joke. Good work!",
    "date": "2015-09-16",
    "postcode": "BN44"
  },
  {
    "title": "Survey to investigate of pipes in drains",
    "text": "Friendly and helpful service. The survey showed the reason for the repeated blockage problem we have been experiencing and we will be using EVO to resolve this too.",
    "date": "2015-09-16",
    "postcode": "RH16"
  },
  {
    "title": "Clearance of blocked drain",
    "text": "Very timely and efficient service. Our drive was left spotless!",
    "date": "2015-09-14",
    "postcode": "RH16"
  },
  {
    "title": "Boiler service",
    "text": "Very professional and polite",
    "date": "2015-09-11",
    "postcode": "RH15"
  },
  {
    "title": "Unblocked kitchen drain",
    "text": "Very professional, efficient and friendly",
    "date": "2015-09-03",
    "postcode": "BN7"
  },
  {
    "title": "Unblocking drains",
    "text": "Very efficient and fairly priced.",
    "date": "2015-09-02",
    "postcode": "BN7"
  },
  {
    "title": "Flush siphon repair and replacement",
    "text": "Effected emergency repair whilst parts ordered. Parts ordered quickly and then returned promptly to fit new unit. Excellent communication throughout.",
    "date": "2015-09-01",
    "postcode": "RH1"
  },
  {
    "title": "New boiler installation and powerflush",
    "text": "We called out EVO heating to repair our boiler knowing it would need replacing soon. We were given a quotation for a new boiler and following a number of calls we used EVO as they offered us a speedy replacement. The work commenced when they said it would and was completed on time as well. They were careful to ensure that we knew what they were doing and were aware of the progress. The final bill matched the quotation and they were careful to clear and clean everything and to ensure we understood on new installation",
    "date": "2015-08-30",
    "postcode": "RH4"
  },
  {
    "title": "Replacement of pipe and cistern fittings to first floor toilet",
    "text": "Harvey was excellent. He arrived when he said he would, was quick, clean and tidy. He even managed to overcome an unexpected problem quickly. Would recommend him to anyone needing a plumber",
    "date": "2015-08-28",
    "postcode": "BN7"
  },
  {
    "title": "CCTV camera survey",
    "text": "Excellent service. Work carried out efficiently + in good time",
    "date": "2015-08-28",
    "postcode": "RH1"
  },
  {
    "title": "Replacement of kitchen mixer tap.",
    "text": "Good reliable service. Very pleased to have a functioning tap now!",
    "date": "2015-08-27",
    "postcode": "GU6"
  },
  {
    "title": "Fitted rigid gas pipe for hob",
    "text": "“Friendly, polite and very fair pricing - responded to queries promptly",
    "date": "2015-08-17",
    "postcode": "BN1"
  },
  {
    "title": "New gas piping to hob",
    "text": "EVO have completed the job as requested and at short notice so I was delighted with his service. A very pleasant and helpful company to deal with",
    "date": "2015-08-14",
    "postcode": "CR3"
  },
  {
    "title": "Fixing hot water issue",
    "text": "EVO heating were very efficient and kept us up-to-date with the work and costs. We would definitely recommend this company to anyone",
    "date": "2015-08-13",
    "postcode": "RH1"
  },
  {
    "title": "Fixing a serious leak in the bathroom",
    "text": "Excellent - very prompt response, service completed swiftly and with minimal cost. Very pleased",
    "date": "2015-08-12",
    "postcode": "RH15"
  },
  {
    "title": "Repair to bath seal which was leaking",
    "text": "Fast response and efficient service to rectify fault to bath and radiator (leaking). Work area was left tidy. Very happy with pricing policy too.",
    "date": "2015-08-12",
    "postcode": "RH10"
  },
  {
    "title": "Toilet leak fixed",
    "text": "Prompt service. Arrived same day as called. Very helpful, problem fixed and issue clearly explained and fixed to a very high standard, improving on the original install.",
    "date": "2015-08-10",
    "postcode": "RH12"
  },
  {
    "title": "Replaced taps and toilet siphon",
    "text": "Excellent service, which was completed quickly and efficiently.",
    "date": "2015-08-10",
    "postcode": "RH1"
  },
  {
    "title": "Fixed leaking toilet",
    "text": "EVO and Steve, their operative, were excellent from start to finish. Called him 8:30 Monday morning and the work was done by 16:00 Monday afternoon. Faultless customer service!",
    "date": "2015-08-10",
    "postcode": "BN7"
  },
  {
    "title": "Bath tap was leaking damaging ceiling underneath",
    "text": "The cause of the leak was quickly identified by Harvey and he fixed it within 15 mins. I was amazed as it had been leaking for a while and my husband had not been able to fix the leak! Harvey was courteous and kept me informed of timings so I knew exactly when he would be coming to the house. Would use him again when/if I have to and would recommend this company.",
    "date": "2015-08-07",
    "postcode": "BN1"
  },
  {
    "title": "New boiler installation",
    "text": "Did what it said on the tin, plus was kind and considerate to my elderly mother in whose house the work was being done.",
    "date": "2015-08-07",
    "postcode": "RH20"
  },
  {
    "title": "Powwer Flush",
    "text": "Very polite and gave good advice and will use again",
    "date": "2015-08-06",
    "postcode": "RH10"
  },
  {
    "title": "Unblocked drain",
    "text": "Harvey arrived promptly having phoned in advance and cleared drains quickly and efficiently. He also removed a mass of fibrous roots from within the chamber to ensure we didn't get a repeated problem. 5 star service.",
    "date": "2015-08-02",
    "postcode": "RH4"
  },
  {
    "title": "Gas cooker installation",
    "text": "Very friendly and tidy job. Checked everything thoroughly before they left! Very pleased would highly recommend.",
    "date": "2015-07-31",
    "postcode": "RH14"
  },
  {
    "title": "Replace kitchen tap",
    "text": "Excellent tidy service. Quick and efficient. Very courteous too",
    "date": "2015-07-30",
    "postcode": "RH1"
  },
  {
    "title": "Broken boiler and service",
    "text": "I would highly recommend EVO. They responded very quickly and Steve, the heating engineer, didn't waste anytime and got on with the job. They are reasonable with their pricing and would use them again",
    "date": "2015-07-29",
    "postcode": "RH6"
  },
  {
    "title": "Tap repair",
    "text": "Reliable, came when they said they would, returned calls, very helpful",
    "date": "2015-07-22",
    "postcode": "RH15"
  },
  {
    "title": "Emergency leaking feed pipe toilet",
    "text": "Quick call out less than 45 minutes on Saturday night. Very quick and efficient work",
    "date": "2015-07-20",
    "postcode": "BN1"
  },
  {
    "title": "Final connections of kitchen sink and washer",
    "text": "On time, helpful advice given during installation work, tidy, clean work completedStorrington",
    "date": "2015-07-16",
    "postcode": "RH20"
  },
  {
    "title": "vented cylinder replacement",
    "text": "Very timely, efficient service. Very fair price charged too.",
    "date": "2015-07-16",
    "postcode": "RH10"
  },
  {
    "title": "Drain unblock",
    "text": "I am very happy with the service received and would happily recommend to friends and family",
    "date": "2015-07-16",
    "postcode": "RH19"
  },
  {
    "title": "Replaced valve in toilet",
    "text": "Very good, fast and efficient",
    "date": "2015-07-16",
    "postcode": "RH15"
  },
  {
    "title": "Fitted radiator and fixed valve on toilet",
    "text": "Wonderful!",
    "date": "2015-07-16",
    "postcode": "RH10"
  },
  {
    "title": "To install dishwasher",
    "text": "Very thorough and clean workmanship",
    "date": "2015-07-13",
    "postcode": "RH15"
  },
  {
    "title": "Boiler service. Shower re-seal.",
    "text": "Great service. Explained things as he went along.",
    "date": "2015-07-10",
    "postcode": "RH16"
  },
  {
    "title": "Toilet leak.",
    "text": "Excellent service from 1st call to completion was less than 1 hour",
    "date": "2015-07-07",
    "postcode": "RH10"
  },
  {
    "title": "Emergency call out to repair a damaged joint between toilet and cistern",
    "text": "EVO arrived just over an hour after our call. The plumber quickly assessed the problem and looked to see if he could make a quick and easy repair. He quoted a price for the works necessary and this quote was not exceeded. He repaired the problem on the same day and he also used a wet vac to dry out the saturated carpet for which he made no additional charge. At all times he was professional, courteous and kept us informed as to what was going on. As the call was made to an elderly person who used a zimmer frame we were very impressed by his calm and caring approach",
    "date": "2015-07-07",
    "postcode": "RH19"
  },
  {
    "title": "Replace valve and new pipe work in airing cupboard",
    "text": "Excellent service. I am very pleased with the finished work and the efficiency to which it was carried out.",
    "date": "2015-07-06",
    "postcode": "RH1"
  },
  {
    "title": "Unblock of a toilet",
    "text": "Our toilet blocked on the morning of a family party. I contacted EVO and they were quick to respond and put an end to a very stressful situation. Thank you",
    "date": "2015-07-05",
    "postcode": "RH4"
  },
  {
    "title": "Replaced 3 port valve",
    "text": "Excellent professional service",
    "date": "2015-07-04",
    "postcode": "RH16"
  },
  {
    "title": "Service boiler and check heating system",
    "text": "Friendly professional service would recommend to friends and family",
    "date": "2015-06-24",
    "postcode": "BN6"
  },
  {
    "title": "Boiler service",
    "text": "Very friendly and efficient. Completed work quickly and with no mess. Will use again",
    "date": "2015-06-22",
    "postcode": "BN6"
  },
  {
    "title": "Tap and ball valve change",
    "text": "Very pleased with helpful service. EVO were extremely accommodating and worked to very high standards.",
    "date": "2015-06-22",
    "postcode": "BN6"
  },
  {
    "title": "Emergency leak fixed late at night",
    "text": "Prompt service, job well completed, great price, very happy with EVO plumbing and heating. Will use again and recommend wholeheartedly.",
    "date": "2015-06-20",
    "postcode": "BN7"
  },
  {
    "title": "Reconnect power shower to supply",
    "text": "Brilliant. Came at short notice to action a critical requirement. Thank you",
    "date": "2015-06-19",
    "postcode": "RH16"
  },
  {
    "title": "Repair to cold mains pipe.",
    "text": "Really struggled to find a company prepared to fix an underground mains pipe and at a reasonable price. A fried recommended EVO plumbing, who they had used themselves on several occasions. The stress was taken out of the situation straight away and within 24 hours the repair had been actioned at a price that was very reasonable. Happy to recommend this company to all my friends.",
    "date": "2015-06-18",
    "postcode": "BN6"
  },
  {
    "title": "Faulty tap repaired",
    "text": "Excellent service from start to finish. Repair done avoiding complete replacement of tap mixer. Taps now operates as good as new.",
    "date": "2015-06-17",
    "postcode": "BN6"
  },
  {
    "title": "CCTV survey of sewage system",
    "text": "Superb service. Needed quick response for house purchase and EVO pulled out all the stops to assist. I'm a very happy customer!",
    "date": "2015-06-16",
    "postcode": "BN6"
  },
  {
    "title": "Drain pressure washed cleaned and tested",
    "text": "Arrived on time, polite and friendly, work completed without fuss, very happy with the service received.",
    "date": "2015-06-16",
    "postcode": "RH2"
  },
  {
    "title": "Repair on my hot water cylinder.",
    "text": "Evo were absolutely superb. I had had a couple of other companies come to look at my cylinder and both quoted over the top prices for replacement. Harvey, the engineer from Evo, told me replacement was unnecessary and was able to fix the leaking connection very quickly and at an ultra reasonable price. I am so grateful as I am a pensioner and on limited funds which he fully appreciated. Have already recommended Evo to a couple of friends who have been as impressed as I am.",
    "date": "2015-06-12",
    "postcode": "RH1"
  },
  {
    "title": "Bathroom leakage fixed and washing machine trap replaced",
    "text": "I have used EVO several times before and once again they provided an excellent service, above and beyond the call of duty. Thanks for a job well done",
    "date": "2015-06-11",
    "postcode": "GU6"
  },
  {
    "title": "Boxing of bathroom piping after doing trace/repair job",
    "text": "EVO did another great job after coming back to fix everything that was taken out to do the trace/repair of a particularly tough leak. In short, Steve, the engineer, managed to succeed where 2 other plumbers had failed! The boxed in area looks great, came in at the right price and was done professionally. Steve went absolutely above and beyond the call of duty (again!) and managed to complete the job beyond satisfaction; absolutely recommended for complete customer focus, utter reliability and top quality of work. Do not hesitate to give this firm a call if you have an emergency!",
    "date": "2015-06-09",
    "postcode": "RH6"
  },
  {
    "title": "Cleared blocked drain and camera survey",
    "text": "Came early and got on with the job as I was on a business call. Cleared the drain, showed me the problems and good quote to fix the problem. Polite and friendly. Recommended.",
    "date": "2015-06-08",
    "postcode": "BN6"
  },
  {
    "title": "Trace and repair electrical fault on boiler",
    "text": "Having tried to get in touch with various other companies for over a week - none of which bothered to return my calls, I finally tried EVO plumbing and heating. They answered the phone immediately and told me they could attend the same day! The engineer arrived punctually and resolved a boiler problem at my mothers property that same afternoon! He was totally clear about the price for his attendance and the price for repair work was advised and agreed before he started work. His communication, attitude and helpfulness was totally professional throughout. EVO will be top of my contact list in the future. Highly recommended",
    "date": "2015-06-08",
    "postcode": "RH2"
  },
  {
    "title": "Hot water not working",
    "text": "EVO's engineer came the same day and stayed late to finish fixing the problem. Kept informed exactly what needed to be done and was polite and conscientious. Highly recommended.",
    "date": "2015-06-08",
    "postcode": "RH15"
  },
  {
    "title": "Water heaters not working",
    "text": "Excellent service. Great value. Very competent engineers. Would highly recommend and would certainly use again",
    "date": "2015-06-07",
    "postcode": "BN7"
  },
  {
    "title": "Unblocking of a toilet",
    "text": "Excellent, timely and friendly service. Spotlessly clean too!",
    "date": "2015-05-27",
    "postcode": "BN6"
  },
  {
    "title": "Fitting of toilet basin and unit, radiator to downstairs cloak and sailing of shower tray",
    "text": "Great work considering the space to work in (small). Finished in the time frame specified",
    "date": "2015-05-19",
    "postcode": "RH4"
  },
  {
    "title": "2 x click plugsand 2 ceramic tap cartridges/washers",
    "text": "On time and courteous and very tidy",
    "date": "2015-05-19",
    "postcode": "RH12"
  },
  {
    "title": "Serviced boiler and checked heating system and controls",
    "text": "Very happy with the service provided by EVO plumbing and heating.. Good price friendly, tidy engineer. Will use them again.",
    "date": "2015-05-15",
    "postcode": "BN1"
  },
  {
    "title": "Clearing of blocked outside drains.",
    "text": "I rang Harvey at 6pm and he said he could be with me the following morning. He confirmed that he would ring 30 mins before arrival. At 9am I received a call and he was with us at almost exactly 9:30. Harvey worked through torrential rain in order to sort the issue when it would not have been unreasonable to take shelter in his van. I had chosen EVO from the feedback on this site as my partner is housebound and it was critical to get the issue resolved ASAP and he did not disappoint. I had not agreed a price before but he charged an amount well within my expectations",
    "date": "2015-05-06",
    "postcode": "BN6"
  },
  {
    "title": "Supply and fit new radiator",
    "text": "Excellent very neat and tidy. Conscientious.",
    "date": "2015-05-05",
    "postcode": "RH15"
  },
  {
    "title": "Fixing of leaking bath pipes, new taps and hand shower",
    "text": "Extremely pleased with the work carried out. EVO are a great company and Steve, the engineer, is a super guy. I will definitely use them again and recommend EVO to others.",
    "date": "2015-05-03",
    "postcode": "RH10"
  },
  {
    "title": "Boiler service",
    "text": "Great service, prompt and efficient.",
    "date": "2015-04-30",
    "postcode": "GU6"
  },
  {
    "title": "Removal of radiators",
    "text": "Work carried out as requested and to a high standard. Left clean and tidy at the end. I would recommend",
    "date": "2015-04-20",
    "postcode": "RH15"
  },
  {
    "title": "New shower and outside tap",
    "text": "Very happy with the work and was very polite and tidy. I would recommend him",
    "date": "2015-04-15",
    "postcode": "RH2"
  },
  {
    "title": "Service central heating boiler, repair dripping toilet",
    "text": "Punctual, efficient, friendly",
    "date": "2015-04-08",
    "postcode": "BN6"
  },
  {
    "title": "Replace kitchen tap",
    "text": "Came at the agreed time and did an excellent job, adhered to price quoted, despite encountering access and pipe work issues. Would definitely recommend and use EVO again",
    "date": "2015-04-04",
    "postcode": "RH16"
  },
  {
    "title": "Replaced three way valve.",
    "text": "Our call was returned quickly and the job arranged for next day - very efficient",
    "date": "2015-04-01",
    "postcode": "RH16"
  },
  {
    "title": "Drain blocked.",
    "text": "Drains were backed up and overflowing. EVO attended very quickly and promptly resolved the problem. Harvey then took time to disinfect the entire area which was great as I have small children who often play in this area.",
    "date": "2015-03-25",
    "postcode": "RH13"
  },
  {
    "title": "Replace pressure vessel following leak",
    "text": "Clean, tidy, worked to a high standard",
    "date": "2015-03-25",
    "postcode": "BN6"
  },
  {
    "title": "Repaired leaking toilet cistern",
    "text": "“Steve was able to quickly ascertain what the problem was and fix it. He explained exactly what had happened and what he was doing about it",
    "date": "2015-03-25",
    "postcode": "RH12"
  },
  {
    "title": "Boiler service and fix a leak",
    "text": "Really happy with the service provided. Would recommend to a friend",
    "date": "2015-03-24",
    "postcode": "BN6"
  },
  {
    "title": "Replaced 3 way valve on central heating system",
    "text": "Tidy, courteous and professional job. I would recommend",
    "date": "2015-03-19",
    "postcode": "BN6"
  },
  {
    "title": "Replacing radiator for towel railing kitchen",
    "text": "Very punctual, work was done to a high standard and professional",
    "date": "2015-03-18",
    "postcode": "RH15"
  },
  {
    "title": "Boiler repair",
    "text": "Excellent all round service. No complaints whatsoever.",
    "date": "2015-03-13",
    "postcode": "RH17"
  },
  {
    "title": "Tap replacement, kitchen and bathroom",
    "text": "Ecellent and friendly, no dramas.",
    "date": "2015-03-12",
    "postcode": "BN5"
  },
  {
    "title": "Unblock a clogged toilet",
    "text": "Great service, tidy, quick, courteous",
    "date": "2015-03-06",
    "postcode": "RH1"
  },
  {
    "title": "Repaired kitchen tap",
    "text": "Prompt response to initial phone call, turned up quickly to do job, very quick work and very friendly, great service",
    "date": "2015-03-06",
    "postcode": "RH18"
  },
  {
    "title": "Boiler re-commission and service",
    "text": "Very professional service! Showed great flexibility to accommodation appointment with me, courteous and polite, calling ahead of arrival. Would use again without hesitatio",
    "date": "2015-03-05",
    "postcode": "BN44"
  },
  {
    "title": "Drainage maintenance.",
    "text": "Excellent all round. Job was completed quickly with no mess.",
    "date": "2015-02-26",
    "postcode": "RH16"
  },
  {
    "title": "Adapt above ground drainage.",
    "text": "Great communication, positive attitude. End of the day the job was done well! With a smile!",
    "date": "2015-02-13",
    "postcode": "BN6"
  },
  {
    "title": "Blocked drain cleared and CCTV survey to determine fault",
    "text": "Excellent, lovely guy, helpful and knowledgeable. I would recommend.",
    "date": "2015-02-07",
    "postcode": "RH15"
  },
  {
    "title": "Blocked drain clearance",
    "text": "Excellent - tidy, polite and accomodating, would use again",
    "date": "2015-02-06",
    "postcode": "BN7"
  },
  {
    "title": "System boiler restarted, walkthrough of heating system, checked radiators and performed service",
    "text": "Very efficient, polite and took time to really explain the system with practical hints and tips for the future",
    "date": "2015-02-05",
    "postcode": "RH10"
  },
  {
    "title": "Replace taps and cartridges",
    "text": "Turned up on time and did the job as requested at a very reasonable price",
    "date": "2015-02-04",
    "postcode": "RH17"
  },
  {
    "title": "Complicated tap replacement.",
    "text": "Excellent, a complicated job but completed well, polite and easy to get on with.",
    "date": "2015-02-04",
    "postcode": "RH10"
  },
  {
    "title": "Drain clearance of problematic drain",
    "text": "Professional and courteous service. Very happy",
    "date": "2015-02-03",
    "postcode": "RH19"
  },
  {
    "title": "Installing a new programmer for the boiler",
    "text": "EVOreturned my call. They came out straight away, replaced the programming unit, and got my boiler working in next to no time. Really impressed with his fast, friendly and efficient manner, and the work done!",
    "date": "2015-02-03",
    "postcode": "RH12"
  },
  {
    "title": "Put in new pump for hot water supply",
    "text": "Really helpful and informative. Five star service from start to finish",
    "date": "2015-01-20",
    "postcode": "RH12"
  },
  {
    "title": "Replace concealed shower valve",
    "text": "Faultless services, will definitely use again and recommend to family and friends",
    "date": "2015-01-14",
    "postcode": "RH2"
  },
  {
    "title": "Service of boiler plus checking for faults an carbon monoxide.",
    "text": "Excellent service, would definitely use again, also did some other work to help use gas tap. Friendly and professional.",
    "date": "2015-01-09",
    "postcode": "RH16"
  },
  {
    "title": "Repair ball cock mechanism",
    "text": "Work was very well done, clean and tidy",
    "date": "2014-12-23",
    "postcode": "GU6"
  },
  {
    "title": "Radiator not working",
    "text": "Harvey was professional throughout. He quoted a price on arrival and although the work was more extensive than he first envisaged he stuck to the quoted price. He was great, I will recommend him in the village",
    "date": "2014-12-23",
    "postcode": "RH17"
  },
  {
    "title": "Soil pipe cleared after blockage",
    "text": "Prompt service, fair price. The job was dealt with superbly. Harvey took time to clean the area on completion so it would be safe for my children and pet dog. Would recommend.",
    "date": "2014-12-18",
    "postcode": "RH10"
  },
  {
    "title": "Repaired leak on dishwasher connector",
    "text": "Excellent. Steve identified the problem immediately, fixed it and explained how I could fix it myself in future. As he had finished so quickly, he gave our boiler the once over, gave some advice on it and checked our shower pump and he said if the problem re-occurred, he sort it out at no additional cost",
    "date": "2014-12-08",
    "postcode": "GU7"
  },
  {
    "title": "water leak repair under concrete floor.",
    "text": "I phoned EVO frantically looking for help and the engineer was great. From the first call he was very professional, he was very honest and was superb in sorting out the problem",
    "date": "2014-11-29",
    "postcode": "RH20"
  },
  {
    "title": "Boiler breakdown and repair",
    "text": "EVO came out to my boiler breakdown the same day I called him, no call out charges but was quoted a working charge which I thought was fair, boiler up and running within an hour.",
    "date": "2014-11-27",
    "postcode": "RH20"
  },
  {
    "title": "Boiler repair",
    "text": "Really helpful, nothing is too much trouble, had to return a few times to sort out a few teething problems with our boiler but persevered until it was up and running. Absolutely fantastic. Would highly recommend",
    "date": "2014-11-24",
    "postcode": "RH17"
  },
  {
    "title": "Boiler breakdown and repair",
    "text": "I understood the price before Steve came out, he was more than fair. And to fix my boiler on the spot was nothing but outstanding",
    "date": "2014-11-20",
    "postcode": "RH14"
  },
  {
    "title": "Service gas fire and check flue",
    "text": "The operative, Steve, called as arranged and went about his job in a very pleasant way. I would recommend EVO very highly.",
    "date": "2014-11-10",
    "postcode": "RH17"
  },
  {
    "title": "Replace leaking pressure reducing gauge",
    "text": "Harvey is a very pleasant person to have in the house. Job done efficiently. Very pleased",
    "date": "2014-11-06",
    "postcode": "BN6"
  },
  {
    "title": "Plumb dishwasher, leaking toilet.",
    "text": "Excellent service, will definitely use again.",
    "date": "2014-11-06",
    "postcode": "BN6"
  },
  {
    "title": "Gas heating boiler repair",
    "text": "Steve Morgan did a great job - he's polite professional and cares about his work. There are a lot of plumbers around the Horsham area but I will stick with EVO plumbing and heating. Thank you Steve",
    "date": "2014-11-05",
    "postcode": "RH12"
  },
  {
    "title": "Replaced lime scale treatment unit",
    "text": "Harvey responded promptly to our request for a quote. His price was easily the best, his work was excellent and delivered on time.",
    "date": "2014-10-30",
    "postcode": "BN6"
  },
  {
    "title": "Boiler service and radiator repair",
    "text": "Excellent service. Great job. Will use again. Very friendly and helpful",
    "date": "2014-10-20",
    "postcode": "RH15"
  },
  {
    "title": "fixed boiler",
    "text": "Our boiler broke and we called several companies who were very unhelpful, not being able to help for weeks. Spoke to Steve and he came on the same day and fixed the boiler the following day. He was brilliant and honest. Would recommend him to anyone",
    "date": "2014-10-18",
    "postcode": "CR3"
  },
  {
    "title": "Repair to boiler.",
    "text": "This was a complicated task due to considerable building works going on around the house. Steve was up front from the start with regards costs and even though it ended up taking a lot longer than he had initially expected as it involved replacing more than one faulty component he did not charge us for the extra time. I would thoroughly recommend him and would certainly use him again",
    "date": "2014-10-17",
    "postcode": "GU7"
  },
  {
    "title": "Repair toilet flush.",
    "text": "Very punctial, Efficient service. Pricing was very fair too, happy to recommend to family and friends. ",
    "date": "2014-10-07",
    "postcode": "RH10"
  },
  {
    "title": "Replaced old shower in bath",
    "text": "Efficient and as promised good job",
    "date": "2014-10-03",
    "postcode": "RH1"
  },
  {
    "title": "Fix leak under sink",
    "text": "Quick, efficient and reliable. I would recommend this company",
    "date": "2014-09-26",
    "postcode": "RH16"
  },
  {
    "title": "Fitting new shower unit",
    "text": "Very prompt and efficient. They have solved a real problem and done an excellent job.",
    "date": "2014-09-20",
    "postcode": "RH15"
  },
  {
    "title": "Plumbing repair to leak",
    "text": "A very reliable service and very fair pricing.",
    "date": "2014-09-19",
    "postcode": "RH1"
  },
  {
    "title": "Cleared blockage in outdoor drain",
    "text": "Excellent prompt and tidy service",
    "date": "2014-09-17",
    "postcode": "GU6"
  },
  {
    "title": "New boiler and a new radiator fitted.",
    "text": "Steve was very professional, courteous and friendly. Took the trouble to explain what type of boiler was needed and why. Time keeping and tidiness was excellent. No hidden costs. Have no hesitation in recommending him.",
    "date": "2014-09-01",
    "postcode": "RH12"
  },
  {
    "title": "Replace wc cistern , pop - up waste on bathroom basin",
    "text": "As ever , brilliant job and was quickly completed",
    "date": "2014-08-19",
    "postcode": "RH17"
  },
  {
    "title": "Install gas pipe for cooker.",
    "text": "Very neat and tidy job. Quoted a very reasonable price and there were no hidden extras. Would thoroughly recommend.",
    "date": "2014-08-06",
    "postcode": "BN7"
  },
  {
    "title": "Fixing shower",
    "text": "Very good service. Polite, tidy. Had problems with delivery of shower from home base and was very understanding and accommodating",
    "date": "2014-08-02",
    "postcode": "RH10"
  },
  {
    "title": "Toilet leak repair",
    "text": "Quick response and resolution. Thoroughly reliable quality service",
    "date": "2014-08-01",
    "postcode": "RH10"
  },
  {
    "title": "Boiler repair",
    "text": "I had a leak from my boiler outside Steve came round the same day and fixed the leak. He then returned to service my boiler and discovered my flue needed replacing. He ordered the part and returned the same week to fit it. Quick prompt service and kept me informed throughout the procedure",
    "date": "2014-07-25",
    "postcode": "RH10"
  },
  {
    "title": "Leaking toilet which caused water damage to lower floor and ceiling",
    "text": "Good. Arrived in good time, helpful and capable. Fixed problem",
    "date": "2014-07-20",
    "postcode": "BN1"
  },
  {
    "title": "Blocked gully",
    "text": "Prompt service and cheerfully carried out by Harvey.",
    "date": "2014-07-16",
    "postcode": "RH8"
  },
  {
    "title": "Replace 3 port valve",
    "text": "On time when stated and work was very good. I would recommend",
    "date": "2014-06-30",
    "postcode": "RH10"
  },
  {
    "title": "Emergency repairs to loft tank.",
    "text": "Good, timely, professional and friendly service. Will use EVO again",
    "date": "2014-06-23",
    "postcode": "RH4"
  },
  {
    "title": "Fix dripping tap",
    "text": "Good service and reliable",
    "date": "2014-06-12",
    "postcode": "RH12"
  },
  {
    "title": "2 parts on the combi boiler needed replacing.",
    "text": "Steve was very polite and gave good explanations of what he had done or needed to do. He was always on time and worked very hard to get our boiler back up and running. We had another problem with the toilet that we asked Steve to look at which he fixed and didn't even charge for. such a nice man!",
    "date": "2014-06-11",
    "postcode": "RH12"
  },
  {
    "title": "New boiler fitted",
    "text": "“Highly recommend this company - all work was completed to an excellent standard, very thorough and a pleasure dealing with such a courteous professional company",
    "date": "2014-06-01",
    "postcode": "RH13"
  },
  {
    "title": "Sink plug and waste replaced.",
    "text": "All work completed to specified standard including replacing part.",
    "date": "2014-05-28",
    "postcode": "RH1"
  },
  {
    "title": "Clean and fix leaking gutter",
    "text": "Excellent service! Prompt and efficient worker, very happy with the service",
    "date": "2014-05-28",
    "postcode": "RH1"
  },
  {
    "title": "Clearing blocked drain and survey to check for problems",
    "text": "Excellent service from staert to finish",
    "date": "2014-05-15",
    "postcode": "RH12"
  },
  {
    "title": "Blocked drain ",
    "text": "Brilliant - arrived on time. Could not have been more professional and helpful. Would call again - highly recommend",
    "date": "2014-05-14",
    "postcode": "RH12"
  },
  {
    "title": "Fitted new radiator.",
    "text": "First time I used EVO Services and I was very pleased and will use them again without hesitation. Harvey is a lovely man, reliable and tidy.",
    "date": "2014-04-30",
    "postcode": "RH17"
  },
  {
    "title": "Central heating installed and boiler moved",
    "text": "Speedy, efficient and friendly. Excellent workmanship",
    "date": "2014-04-09",
    "postcode": "RH17"
  },
  {
    "title": "Boiler replacement and new radiators",
    "text": "Excellent response to call. Excellent non social working, hours willingness. Excellent quality work.",
    "date": "2014-03-30",
    "postcode": "RH14"
  },
  {
    "title": "New soakaway for overflow from cesspit",
    "text": "Courteous, Efficient, and very well organised",
    "date": "2014-03-27",
    "postcode": "RH1"
  },
  {
    "title": "Replaced boiler",
    "text": "Great job done! Steve replaced our old boiler, did it thoroughly and kept it all tidy. He was also mindful of the fact that we have small children in the house. Would highly recommend him",
    "date": "2014-03-26",
    "postcode": "RH12"
  },
  {
    "title": "CCTV drain recording",
    "text": "Very useful service, thank you",
    "date": "2014-03-21",
    "postcode": "RH15"
  },
  {
    "title": "Drain clearance.",
    "text": "Very friendly and clear. Diagnosed and rectified issue in excellent time",
    "date": "2014-03-14",
    "postcode": "RH10"
  },
  {
    "title": "Tap replacement",
    "text": "Efficient and informative about job. Very quick turnaround and at an affordable price too.",
    "date": "2014-03-14",
    "postcode": "RH10"
  },
  {
    "title": "Boiler service",
    "text": "Steve completed a service on a boiler that he'd originally installed. As well as completing the standard emissions and operational checks he reviewed and cleaned a magnetic filter that we have installed. He also helped to review and provide feedback against a quotation we'd received for a replacement boiler in another property that we own; this was really helpful and outside of the remit of the work that we'd called on him to complete",
    "date": "2014-03-13",
    "postcode": "RH1"
  },
  {
    "title": "Boiler service and safety check",
    "text": "Have used EVO's services before and as usual were thorough, courteous and professional. Highly recommended",
    "date": "2014-03-13",
    "postcode": "RH1"
  },
  {
    "title": "unblock drain",
    "text": "Carried out immediately. Efficiently solved problem",
    "date": "2014-03-07",
    "postcode": "BN6"
  },
  {
    "title": "Bpoiler failure - repair and service",
    "text": "EVO plumbing and heating were very reliable and courteous. Came on the day they said they would and fixed the problem quickly. I highly recommend this company wholeheartedly",
    "date": "2014-03-05",
    "postcode": "TN39"
  },
  {
    "title": "Jetted clearance of gulley",
    "text": "Turned up on time, worked efficiently, clean and tidy",
    "date": "2014-02-20",
    "postcode": "RH10"
  },
  {
    "title": "Moving gas heater",
    "text": "Very professional, would certainly use this company again",
    "date": "2014-02-10",
    "postcode": "BN7"
  },
  {
    "title": "Jetting blocked drains",
    "text": "After previous bad experiences with other companies EVO were great . Turned up on time and charged me the quoted rate",
    "date": "2014-02-03",
    "postcode": "RH17"
  },
  {
    "title": "Drain unblocked and camera survey",
    "text": "Fantastic service, speedily fixed, definitely recommend and definitely use again. True professional",
    "date": "2014-02-01",
    "postcode": "BN7"
  },
  {
    "title": "Drain blockage in bath",
    "text": "Quick and thorough and friendly. Good service",
    "date": "2014-01-29",
    "postcode": "RH16"
  },
  {
    "title": "Cleared Blocked drains",
    "text": "Very happy - prompt, efficient - couldn't fault service.",
    "date": "2014-01-16",
    "postcode": "BN1"
  },
  {
    "title": "Radiator not working",
    "text": "Harvey was professional throughout. He quoted a price on arrival and although the work was more extensive than he first envisaged he stuck to the quoted price. He was great, I will recommend him in the village",
    "date": "2014-01-14",
    "postcode": "RH17"
  },
  {
    "title": "Element replaced in immersion heater",
    "text": "Really happy with fast efficient service ",
    "date": "2014-01-10",
    "postcode": "RH17"
  },
  {
    "title": "Replace shower pump",
    "text": "Excellent service! Very quick to respond and friendly, clean service",
    "date": "2014-01-06",
    "postcode": "GU6"
  },
  {
    "title": "Fitted 2 new taps",
    "text": "Really good service, would recommend.",
    "date": "2014-01-05",
    "postcode": "RH19"
  },
  {
    "title": "Combination valve replaced on megaflo and annual boiler service",
    "text": "Steve was knowledgeable, professional and reliable. I would strongly recommend him",
    "date": "2014-01-05",
    "postcode": "RH4"
  },
  {
    "title": "New gas main",
    "text": "Gas leak in the bungalow, new supply fitted. To all services. Boiler and heating survey done",
    "date": "2014-01-01",
    "postcode": "BN6"
  },
  {
    "title": "Emergency plumbing on central heating system plus boiler service.",
    "text": "Extremely helpful. Pleasant and polite. Would recommend 100%.",
    "date": "2013-12-23",
    "postcode": "BN7"
  },
  {
    "title": "Boiler check",
    "text": "Reliable, friendly and highly recommended",
    "date": "2013-12-14",
    "postcode": "BN6"
  },
  {
    "title": "Clear blocked soak away pipe",
    "text": "Very efficient",
    "date": "2013-12-12",
    "postcode": "RH15"
  },
  {
    "title": "Insert patch repair to drain run",
    "text": "A very difficult job to a defective drain under our house was made to look very easy.",
    "date": "2013-12-12",
    "postcode": "BN6"
  },
  {
    "title": "Boiler repair and service.",
    "text": "Woke up to the boiler not firing up last Saturday. Gave Steve a ring, as we'd used him before and been impressed with his work. He was able to come round that morning, asses the problem, source parts and fix (including servicing the boiler) before lunch! We have always found Steve to be very reliable, helpful and focused on doing a good job in a customer focused manner. Would thoroughly recommend.",
    "date": "2013-11-29",
    "postcode": "RH12"
  },
  {
    "title": "Located a leak under a tiled bathroom floor.",
    "text": "Highly recommended. Turned up exactly when he said he would. Kept working until the job was complete (23.45). Very satisfied customer. Would definitely use again (but hope I don't have to!).",
    "date": "2013-11-29",
    "postcode": "RH1"
  },
  {
    "title": "Boiler service",
    "text": "I would recommend this company",
    "date": "2013-11-28",
    "postcode": "GU6"
  },
  {
    "title": "Fitted new heating pump in airing cupboard",
    "text": "EVO plumbing and heating able to attend quickly to our call and took no time at all in locating and fixing the problem",
    "date": "2013-11-28",
    "postcode": "BN1"
  },
  {
    "title": "Fitted new central heating pump in airing cupboard",
    "text": "EVO plumbing and heating able to attend quickly to our call and took no time at all in locating and fixing the problem",
    "date": "2013-11-28",
    "postcode": "BN1"
  },
  {
    "title": "Jetting gutter down pipe",
    "text": "A very efficient and courteous service. Recommended.",
    "date": "2013-11-27",
    "postcode": "RH15"
  },
  {
    "title": "Blocked drain from down stairs toilet",
    "text": "Care on time, was helpful and cooperative. Solved the problem very quickly and cost was reasonable",
    "date": "2013-11-23",
    "postcode": "BN7"
  },
  {
    "title": "Replacing leaking hot water cylinder and installing new shower unit",
    "text": "Harvey completed the work in a very efficient and friendly way. I would definitely recommend him and use him again for any further work",
    "date": "2013-11-11",
    "postcode": "RH16"
  },
  {
    "title": "Installation of new gas supply pipe and range cooker",
    "text": "Very good service, kept informed, very tidy and thoughtful work",
    "date": "2013-11-11",
    "postcode": "RH15"
  },
  {
    "title": "Disconnect and remove gas hob. Refit and reconnect after kitchen refurbishment",
    "text": "Every aspect of the work was carried out efficiently and professionally. Steve was always courteous and took time to explain what was happening and give advice as required. I would not hesitate to use this company again in the future",
    "date": "2013-11-10",
    "postcode": "RH10"
  },
  {
    "title": "Replacement valve unit",
    "text": "Very pleasant and helpful service",
    "date": "2013-11-09",
    "postcode": "BN7"
  },
  {
    "title": "New Worcester boiler with pipework",
    "text": "In the pursuit of excellence this young man is a rarity. Nothing is too much trouble to leave everything in order. Courteous and hardworking",
    "date": "2013-11-06",
    "postcode": "RH5"
  },
  {
    "title": "Drain system, remove old pipework, re fill system and bleed",
    "text": "Very professional service, quick and clean job",
    "date": "2013-11-04",
    "postcode": "RH10"
  },
  {
    "title": "Investigate and Diagnose cause of blockage",
    "text": "Harvey worked hard to find the cause of the problem and seems to have solved it without any further work being needed. Very happy so far :-)",
    "date": "2013-10-31",
    "postcode": "BN7"
  },
  {
    "title": "Cleaning blocked drain",
    "text": "We were extremely pleased with the work carried. Would call out again. Very tidy, cleaning afterwards too.",
    "date": "2013-10-31",
    "postcode": "RH10"
  },
  {
    "title": "Cleaning outside drain blockage ",
    "text": "Very good service at affordable prices",
    "date": "2013-10-31",
    "postcode": "RH4"
  },
  {
    "title": "Supply two motorised valves, adjust pipework, replace fan, rewire and service boiler",
    "text": "EVO's engineer very quickly came to a diagnosis of the problem and once the job was started worked extremely efficiently to completion without cutting any corners or taking short cuts. Was polite and cheerful throughout and the finished result was of a good quality standard. I would have no hesitation in recommending his services to others!",
    "date": "2013-10-31",
    "postcode": "BN7"
  },
  {
    "title": "Repair boiler.",
    "text": "Very happy with the work Steve did. He also checked that the heating was fully functional and safe before he left and also provided advice.",
    "date": "2013-10-30",
    "postcode": "RH12"
  },
  {
    "title": "Clear blocked outside drains",
    "text": "Very quick response and clear advice",
    "date": "2013-10-25",
    "postcode": "BN7"
  },
  {
    "title": "Called to check failed central heating",
    "text": "The engineer quickly identified the problem and replaced the faulty valve. He was very courteous and helpful. Made sure everything was working perfectly before he left. I have since had to call him for an unrelated repair and received the same excellent service. Will definitely use him again. Have no hesitation recommending him",
    "date": "2013-10-17",
    "postcode": "BN7"
  },
  {
    "title": "Replaced boiler gas valve.",
    "text": "Steve was very willing to work on my 25 year old boiler. He showed an excellent level of competence and was able to carry out the work in a timely fashion. I had obtained the obsolete part for him to fit. He carefully examined the item before fitting to ensure its worthiness for purpose",
    "date": "2013-10-08",
    "postcode": "RH4"
  },
  {
    "title": "Installing new washing machine - pipe needed.",
    "text": "Excellent service / communication.",
    "date": "2013-10-03",
    "postcode": "RH15"
  },
  {
    "title": "Plumbing",
    "text": "Very happy from start to finish",
    "date": "2013-10-03",
    "postcode": "RH1"
  },
  {
    "title": "Drain Clearance",
    "text": "Excellent service",
    "date": "2013-09-25",
    "postcode": "RH13"
  },
  {
    "title": "Call out to inspect failed boiler",
    "text": "EVO were very good! I came home to find boiler was broken, called Steve out to look to check. Turns out boiler was still in guarantee and Steve went above and beyond to get it sorted. Got the company to fix it but Steve could have just tried to take the job on himself. If I need anything else I am sure to use him again",
    "date": "2013-09-23",
    "postcode": "RH16"
  },
  {
    "title": "Unblock a drain",
    "text": "Did a very thorough job, tidying the area on completion",
    "date": "2013-09-20",
    "postcode": "RH12"
  },
  {
    "title": "Leak fix and pipe replacement",
    "text": "Knowledgeable, friendly, efficient and reasonable",
    "date": "2013-09-20",
    "postcode": "RH19"
  },
  {
    "title": "Clear drains",
    "text": "Very good service, prompt, friendly",
    "date": "2013-09-13",
    "postcode": "RH4"
  },
  {
    "title": "Fixed leak",
    "text": "Booked appointment short notice and came out on a Sunday. Harvey was very helpful and thorough. Thank you",
    "date": "2013-09-09",
    "postcode": "RH18"
  },
  {
    "title": "Replace 1 radiator",
    "text": "Prompt, informative and polite",
    "date": "2013-09-09",
    "postcode": "RH19"
  },
  {
    "title": "Fit ball valve",
    "text": "“I would recommend this company.",
    "date": "2013-09-09",
    "postcode": "BN43"
  },
  {
    "title": "Investigate problem find and offer solution",
    "text": "Investifgate a problem and find another solution. Excellent throughout.",
    "date": "2013-09-06",
    "postcode": "BN1"
  },
  {
    "title": "Immersion replacement",
    "text": "Came out the same day at the time quoted, gave an estimate for the work and got straight to it. Very friendly polite and approachable giving good advice as the work was being carried out. Would recommend to friends and family",
    "date": "2013-08-20",
    "postcode": "RH1"
  },
  {
    "title": "Gas cooker installation",
    "text": "Turned up on time. Excellect service",
    "date": "2013-08-09",
    "postcode": "GU6"
  },
  {
    "title": "Cleared blocked drain",
    "text": "Friendly, helpful and efficient service. I would definitely use this company again.",
    "date": "2013-08-08",
    "postcode": "GU6"
  },
  {
    "title": "Unblock drain",
    "text": "Fast, efficient, reliable service. Able to diagnose the problem quickly",
    "date": "2013-08-08",
    "postcode": "RH17"
  },
  {
    "title": "Cleared out shower drain",
    "text": "Prompt, clean and tidy. Harvey did a great job at a reasonable price. I will definitely be using him again.",
    "date": "2013-08-03",
    "postcode": "RH13"
  },
  {
    "title": "Sealing leak at bathroom of boiler tank.",
    "text": "Arrived when promised, polite and efficient.",
    "date": "2013-07-23",
    "postcode": "RH20"
  },
  {
    "title": "Replaced ball valve",
    "text": "Prompt, arrival, quick work, repaired-replaced ball valve",
    "date": "2013-07-20",
    "postcode": "RH15"
  },
  {
    "title": "Clearing and rodding of drains",
    "text": "Turned up on time and efficient and price as agreed",
    "date": "2013-07-17",
    "postcode": "BN6"
  },
  {
    "title": "Change of taps and fitting of showe",
    "text": "Extremely good",
    "date": "2013-07-09",
    "postcode": "BN15"
  },
  {
    "title": "Unblock drain",
    "text": "Quick easy job",
    "date": "2013-07-08",
    "postcode": "RH17"
  },
  {
    "title": "Replacing fill valve on dual flush wc.",
    "text": "Excellent, efficient service. Will use EVO Home services again",
    "date": "2013-07-08",
    "postcode": "RH15"
  },
  {
    "title": "Boiler service",
    "text": "Prompt, friendly service. Charged amount quoted",
    "date": "2013-07-05",
    "postcode": "RH15"
  },
  {
    "title": "Water leak fix",
    "text": "Glad to find someone who is fixing not replacing.",
    "date": "2013-07-02",
    "postcode": "RH15"
  },
  {
    "title": "Clearing of blocked shower drains",
    "text": "Super service. Came to us in half an hour at 8pm. Brilliant! Worth every penny",
    "date": "2013-06-24",
    "postcode": "RH12"
  },
  {
    "title": "Drain clearance and camera inspection",
    "text": "Harvey is professional, trustworthy and very knowledgeable. He cleared our trains and carried out a detailed inspection, identifying a root problem at 21 metres down the pipe which he will return to clear next week. I would highly recommend EVO drServices",
    "date": "2013-06-14",
    "postcode": "RH16"
  },
  {
    "title": "Toilet cistern and overflow repair",
    "text": "I contacted Steve just before 5pm and he was at the property within 90 minutes as he had promised. The toilet was fixed very quickly and everything back to normal. Very courteous and prompt service will definitely use again",
    "date": "2013-06-13",
    "postcode": "RH14"
  },
  {
    "title": "Fit basin, radiator, toilet in cloakroom",
    "text": "Excellent service, I would use again.",
    "date": "2013-05-23",
    "postcode": "RH10"
  },
  {
    "title": "Gas oven connection",
    "text": "Very pleased with the quality of service. Also very friendly",
    "date": "2013-05-22",
    "postcode": "RH17"
  },
  {
    "title": "Installation of cold water storage tank valve and wc cistern valve",
    "text": "Good response time. Work executed quality and without fuss. Friendly and personable",
    "date": "2013-05-11",
    "postcode": "BN7"
  },
  {
    "title": "Unblocking and flushing through drains.",
    "text": "Harvey was very thorough, extremely pleasant and arrived exactly when he said he would. Did good job and will use in future and recommend to others",
    "date": "2013-05-10",
    "postcode": "BN6"
  },
  {
    "title": "Clean radiators and pipework in heating system",
    "text": "Very conscientious and passionate about his work. Provides explanation as to what the issue is and how the work required reflects on cost. Ensures that work carried out is complete and well done even if it means coming back to make add' l adjustments. Great work. Would not hesitate to use Steve again",
    "date": "2013-05-06",
    "postcode": "RH12"
  },
  {
    "title": "Replacement hot water tank.",
    "text": "Good service. Friendly competitive prices. Will use this company again",
    "date": "2013-05-05",
    "postcode": "RH19"
  },
  {
    "title": "Fitted new gas hob",
    "text": "Excellent work, tidy, punctual, fixed problems that arose during fit and old gas leak",
    "date": "2013-05-03",
    "postcode": "RH12"
  },
  {
    "title": "Boiler service",
    "text": "I would recommend this company",
    "date": "2013-04-26",
    "postcode": "RH18"
  },
  {
    "title": "Central heating boiler locked out, locate cause and rectify if possible",
    "text": "Boiler locked out Sunday morning. I started to contact heating engineers to try and arrange for the necessary work. Despite being Sunday, Steve Morgan agreed to visit later that day, after he had dealt with some other work already in hand. He arrived around 5 pm, as agreed and checked the various components of the boiler and central heating system. Almost immediately he decided that the problem was not sludge and examined various components, identifying the pump as the likely cause. By then, the previously agreed time and quoted cost had been reached, but Steve was determined to carry on and dismantle the pump, to confirm his diagnosis and attempt to restore the boiler to working condition. Having dismantled the pump, he did find that it was seized and managed to free it by lubricating the spindle. Having reinstalled the pump and restarted the boiler, all went well and the system is still running smoothly the following day. In identifying and rectifying the fault, Steve spent approximately twice the time originally allocated, without any additional charge. \"Above and beyond\" indeed. Thorough Steve remained professional and cheerful and was obviously determined to do his best rectify the problem and leave us with a fully functioning boiler and system. I have no hesitation in recommending Steve would be only to happy to re-employ him if the need arose",
    "date": "2013-04-09",
    "postcode": "RH16"
  },
  {
    "title": "Change toilet flush and fix leak",
    "text": "Very pleased with all aspects of work completed",
    "date": "2013-04-07",
    "postcode": "RH10"
  },
  {
    "title": "Installation of gas hob",
    "text": "Excellent service, reliable, friendly and clean.",
    "date": "2013-04-04",
    "postcode": "RH15"
  },
  {
    "title": "Jet clearance of external drain",
    "text": "Friendly, prompt, straightforward and professional. Very happy with service.",
    "date": "2013-03-22",
    "postcode": "BN6"
  },
  {
    "title": "Bathroom and kitchen renovation",
    "text": "Quick to respond and excellent results",
    "date": "2013-03-22",
    "postcode": "RH10"
  },
  {
    "title": "Plumbing repair",
    "text": "Very good plumbing service",
    "date": "2013-03-21",
    "postcode": "RH15"
  },
  {
    "title": "Gas service and safety check",
    "text": "Excellent service, friendly and efficient!",
    "date": "2013-03-13",
    "postcode": "RH10"
  },
  {
    "title": "Installed gas cooker",
    "text": "Very nice man, would recommend to everyone, very punctual.",
    "date": "2013-03-08",
    "postcode": "RH10"
  },
  {
    "title": "Cleared blocked external drain.",
    "text": "Good service - came when said they would. Reasonable price. Cleared up after",
    "date": "2013-03-08",
    "postcode": "RH15"
  },
  {
    "title": "Boiler repair and replacement fan.",
    "text": "Really efficient, came out on a bank holiday Monday to assess the situation, knew what was wrong immediately and returned central heating and hot water to me 2 days later! Very pleased with the service over bank holiday weekend (especially as British gas would take 7 days and power didn't come out at all!) thank you",
    "date": "2013-03-08",
    "postcode": "RH15"
  },
  {
    "title": "Replace central heating pump and get the system running",
    "text": "EVO came at very short notice to replace the central heating pump which was situated in a very difficult position under the floor boards. The job took longer than expected but the job was willingly completed",
    "date": "2013-02-14",
    "postcode": "RH12"
  },
  {
    "title": "Clear blocked soil pipe ( 50 meters)",
    "text": "Work done expertly and efficiently. Drains now in perfect order. Really pleased to have contacted this company. Previously I had an astronomical \"estimate\" for this work so I was pleased to have called in EVO! Very satisfied customer! Will recommend EVO Drainage to friends and family.",
    "date": "2013-02-14",
    "postcode": "RH10"
  },
  {
    "title": "Replaced leaking pipe, services gas appliances, advised on thermostat settings",
    "text": "Pleasant attitude, very helpful, got the job done. Phoned to follow up that all was OK",
    "date": "2013-02-12",
    "postcode": "RH17"
  },
  {
    "title": "boiler service and inspection",
    "text": "Good, friendly service, reliable and good price. Highly recommended",
    "date": "2013-02-11",
    "postcode": "RH10"
  },
  {
    "title": "Gas leak, faulty fan and gas valve",
    "text": "We moved into our new home last week with much excitement but found the boiler faulty. Bad luck! I called Steve Morgan of first call for having a look at our boiler. The temperature was around minus 1 degree centigrade. He is excellent in what he does, very focused, professional, dedicated, polite and considerate. He had to put extra effort than it was initially anticipated. We will be giving him a call to change our 20yr old boiler as soon as the winter finishes. It wouldn't be fair if I had not given him this feedback. Another important point is, safety comes first in his agenda. I am really grateful to him for the checks he had done on our boiler and shut it down when he found the gas leak. Thanks Steve",
    "date": "2013-02-11",
    "postcode": "RH1"
  },
  {
    "title": "Gas safety certificate for residential house",
    "text": "EVO plumbing and heating were very friendly, efficient and knowledgeable. They also managed to come around at short notice. I would certainly recommend them for gas safety certificates.",
    "date": "2013-02-07",
    "postcode": "RH4"
  },
  {
    "title": "Boiler service",
    "text": "Very professional and knowledgeable.",
    "date": "2013-02-06",
    "postcode": "RH8"
  },
  {
    "title": "Boiler service and repair to valve",
    "text": "Came on time, very tidy, good rate",
    "date": "2013-02-03",
    "postcode": "BN6"
  },
  {
    "title": "Fitted new circuit board and new pressure switch",
    "text": "All work was done professionally and efficiently and was explained to me throughout. Steve was very honest, pleasant and courteous",
    "date": "2013-02-01",
    "postcode": "GU6"
  },
  {
    "title": "Diagnosis of boiler mate thermal store problem",
    "text": "I called Steve late one evening after our boiler stopped working. Steve traced the problem to a faulty pump and circuit board. The parts were ordered and repairs made. I found Steve to be very knowledgeable about the thermal store which is a bit of a specialist area as these units are not very common.",
    "date": "2013-01-31",
    "postcode": "RH2"
  },
  {
    "title": "Replaced boiler pump",
    "text": "Called Sunday evening and got an immediate answer. Despite agreeing to work commencing next morning. Stephen called round that evening spending a few minutes for a temporary fix to our lack of heating. The next day he attended as scheduled and fixed the problem to cost and within estimated time frame. Excellent service",
    "date": "2013-01-29",
    "postcode": "RH12"
  },
  {
    "title": "Serviced boiler and gas fire",
    "text": "Very impressed with service and the work, very professional. Steve was unable to keep to the original time as he was running late but he did update me and was with me soon afterwards. Very reasonable price for the work done. I would call him again and would recommend him",
    "date": "2013-01-28",
    "postcode": "PO18"
  },
  {
    "title": "Boiler and gas fire service",
    "text": "Steve called and updated me as he was running late but arrived soon afterwards. Great job on both boiler and gas fire. Very professional and no mess. I would use Steve again and would recommend him",
    "date": "2013-01-28",
    "postcode": "BN1"
  },
  {
    "title": "Leak under bath repaired",
    "text": "Throughout the work, the engineer clearly explained what he was doing and the reason for it. It was refreshing to have an engineer who was not rushing the work in order to get on to his next job. He double checked that the issue was resolved and that everything was left in full working order",
    "date": "2013-01-26",
    "postcode": "RH12"
  },
  {
    "title": "Leaking Stop Cock",
    "text": "Very punctual. Good job done. Very polite and friendly.",
    "date": "2013-01-12",
    "postcode": "RH10"
  },
  {
    "title": "Boiler inspection",
    "text": "Harvey was meticulous in his inspection. I would highly recommend Harvey and his company",
    "date": "2013-01-09",
    "postcode": "RH6"
  },
  {
    "title": "boiler breakdown",
    "text": "What can we say, EVO were fantastic. They came out late on the evening of the 23rd December to try and fix our broken boiler as the insurance cover company was closed, so much for 24hr service eh? Steve was very polite, kept us informed and although unable to fix the problem tonight was professional, articulate and happy to oblige. We wish more trades persons were as brilliant as Steve",
    "date": "2012-12-23",
    "postcode": "RH10"
  },
  {
    "title": "Service of gas boiler and gas fire",
    "text": "EVO returned calls promptly and arrived when he said he would. Carried out service work quickly and efficiently and was very pleasant. Will be using him again for the next annual service",
    "date": "2012-12-20",
    "postcode": "RH14"
  },
  {
    "title": "Plumbing work",
    "text": "Five star company! Worked up to 10pm, did well on a difficult task. Conscientious, responsible and determined.",
    "date": "2012-12-15",
    "postcode": "RH10"
  },
  {
    "title": "Repaired leaking heated towel rail and restored pressure in closed heating system",
    "text": "I was extremely satisfied with the work done and the quick response I received to my call out. The engineer Ross who came out to me on a cold Sunday afternoon was very helpful and courteous and I very grateful to him for the work done",
    "date": "2012-12-02",
    "postcode": "RH16"
  },
  {
    "title": "Gas boiler breakdown",
    "text": "EVO responded immediately to my telephone call and came out within a couple of hours to assess the problem. New parts were needed and Steve returned the following evening to fit the parts and ensure the house was warm as soon as possible. Really appreciated this kindness. Steve was friendly, efficient and very professional and was able to reassure that the boiler was good for a few more years. I would definitely use this company again. Highly recommend. A huge thank you!",
    "date": "2012-11-27",
    "postcode": "RH20"
  },
  {
    "title": "Fixed a non working boiler",
    "text": "Steve managed to find a very unusual fault with my boiler that was very difficult to diagnose. He saved me having to get a new boiler. He also kept me updated when waiting for spare parts. Highly recommend!",
    "date": "2012-11-22",
    "postcode": "RH12"
  },
  {
    "title": "New fan and full service on the gas boiler",
    "text": "Compared to other tradesmen that wee have called out for various repairs to our home, we cannot fault this company at all. Reliable, friendly, honest, professional and the a job well done! We would not hesitate to recommend",
    "date": "2012-11-20",
    "postcode": "KT11"
  },
  {
    "title": "Electric boiler repair",
    "text": "EVO very helpful and provided a top class service repairing my electrical boiler",
    "date": "2012-11-14",
    "postcode": "GU15"
  },
  {
    "title": "Boiler service and motorised valve change",
    "text": "Fantastic and professional service. Would thoroughly recommend for their reliability and quality of service.",
    "date": "2012-11-08",
    "postcode": "BN6"
  },
  {
    "title": "Replaced diverter valve and pump on central heating system",
    "text": "Steve is a really friendly and genuine guy, helpful with his advise and quick to come out to quote and do the work. A pleasure to deal with, trustworthy and good at his job. Will be using him again for all my plumbing and heating problems. Thanks EVO",
    "date": "2012-10-28",
    "postcode": "RH12"
  },
  {
    "title": "Boiler replacement, general plumbing problems",
    "text": "Having used EVO Plumbing and Heating on several occasions, we have found Steve to be knowledgeable, reliable and excellent at seeing the job through from start to finish. He is clearly experienced in what he does and works to a very high standard. Would recommend to anyone",
    "date": "2012-10-28",
    "postcode": "BN6"
  },
  {
    "title": "Pre-purchase heating and gas evaluation",
    "text": "EVO responded rapidly to our query to evaluate the heating and gas systems in a new house and came back with a detailed description the state of the system. We will be using him to fix the problems identified when we hopefully make the move shortly!",
    "date": "2012-10-25",
    "postcode": "TW1"
  },
  {
    "title": "Emergency plumbing",
    "text": "We called EVO plumbing out at 9.30 Saturday evening in dire straights! They were with us within 30 minutes. All we can say is, what a really great company. Extremely polite, got the job done without fuss and left us relieved and happy. Great emergency call out rate too, especially considering it was a Saturday night. Can't recommend them highly enough.",
    "date": "2012-10-20",
    "postcode": "RH12"
  },
  {
    "title": "Removal of two live birds from behind gas fire",
    "text": "I found EVO on the internet and they were most obliging. They were very courteous and handled the situation extremely well",
    "date": "2012-10-20",
    "postcode": "KT17"
  },
  {
    "title": "Replaced water tank",
    "text": "We called Steve out because water was gushing from the loft. Steve came out promptly and solved the problem. We later got him to replace the water tank. We were very happy with the service and found him to be very efficient, reliable and articulate when explaining the problem to us. I have no hesitation in recommending him to anyone looking for a good and friendly plumber",
    "date": "2012-10-03",
    "postcode": "RH4"
  },
  {
    "title": "Emergency repair to boiler",
    "text": "Excellent service",
    "date": "2012-10-01",
    "postcode": "RH2"
  },
  {
    "title": "Replacement of valve and ball cock in water tank",
    "text": "Fast response to a problem that was causing my elderly parents a lot of stress. Resolved without any issues. Thank you",
    "date": "2012-09-20",
    "postcode": "BN44"
  },
  {
    "title": "Replace leaking soil pipe",
    "text": "Very happy, prompt and helpful service. Harvey was very friendly and professional, very tidy and conscientious",
    "date": "2012-09-20",
    "postcode": "BN3"
  },
  {
    "title": "Shower valve cartridge replaced",
    "text": "Polite and efficient. Would use again",
    "date": "2012-09-20",
    "postcode": "RH6"
  },
  {
    "title": "Fixing leaking water hose",
    "text": "Very good and quick serv",
    "date": "2012-09-20",
    "postcode": "RH4"
  },
  {
    "title": "New siphon",
    "text": "Very good service. Phoned very late at night and job was completed very early the following morning.",
    "date": "2012-09-20",
    "postcode": "RH6"
  },
  {
    "title": "Cleared blocked toilet.",
    "text": "Speedy, excellent and friendly service, very pleased",
    "date": "2012-08-20",
    "postcode": "CR3"
  },
  {
    "title": "Fit new taps in kitchen.",
    "text": "Good service, pleasant operator",
    "date": "2012-08-20",
    "postcode": "GU6"
  },
  {
    "title": "Fixed a toilet and leaking tap",
    "text": "He arrived on time, gave a fixed quote for all the work and completed it all quickly and well",
    "date": "2012-08-20",
    "postcode": "BN6"
  },
  {
    "title": "Replacement of Saniflow unit",
    "text": "Prompt, efficient, tidied up afterwards, competitively priced",
    "date": "2012-08-20",
    "postcode": "BN6"
  },
  {
    "title": "Reconnected loose speed fit 90 water connection",
    "text": "Good professional service and very helpful",
    "date": "2012-08-20",
    "postcode": "KT22"
  },
  {
    "title": "CCTV survey",
    "text": "Punctual, friendly, informative and efficient, Exactly what we were looking for",
    "date": "2012-08-20",
    "postcode": "RH6"
  },
  {
    "title": "Toilet system flow valve",
    "text": "Arrived spot on time and did an excellent job.",
    "date": "2012-08-20",
    "postcode": "GU7"
  },
  {
    "title": "Gas safety check",
    "text": "Efficient professional! Having been let down by several other companies it's great to finally find a company that can be relied upon.",
    "date": "2012-08-17",
    "postcode": "GU7"
  },
  {
    "title": "Hot water cylinder fitted",
    "text": "Steve was timely, efficient, explained everything. Would definitely have him back",
    "date": "2012-08-03",
    "postcode": "RH8"
  },
  {
    "title": "Fitted radiator and fixed valve on toilet",
    "text": "Wonderful service.",
    "date": "2012-07-20",
    "postcode": "RH10"
  },
  {
    "title": "Cleared a blocked soakaway",
    "text": "Very happy with the standard of work",
    "date": "2012-07-20",
    "postcode": "CR5"
  },
  {
    "title": "Float - valve replacement",
    "text": "Excellent service, very speedy response.",
    "date": "2012-07-20",
    "postcode": "BN3"
  },
  {
    "title": "Replace hot water cylinder",
    "text": "Very good and professional service",
    "date": "2012-07-20",
    "postcode": "SM1"
  },
  {
    "title": "Plumbing work",
    "text": "Excellent work and brilliant standard of service",
    "date": "2012-07-20",
    "postcode": "CR3"
  },
  {
    "title": "Clearance of blocked gulley drain",
    "text": "Came promptly at time promised. Cleared immediate problem and gave advice on future management of the situation",
    "date": "2012-07-20",
    "postcode": "RH8"
  },
  {
    "title": "Clearing blocked basin",
    "text": "Excellent efficient and friendly service and advice",
    "date": "2012-07-18",
    "postcode": "RH7"
  },
  {
    "title": "Boiler repair and toilet repair",
    "text": "Harvey went the extra mile to source the parts required and complete the job. He was polite and friendly",
    "date": "2012-07-16",
    "postcode": "CR3"
  },
  {
    "title": "Repair leaking shower",
    "text": "The work was excellent and I was updated on progress",
    "date": "2012-06-16",
    "postcode": "BR6"
  },
  {
    "title": "Fixed broken toilet",
    "text": "Very helpful and efficient.",
    "date": "2012-06-16",
    "postcode": "BN1"
  },
  {
    "title": "Repair to pipe and tap replacement",
    "text": "Jolly good service and work done by Harvey.",
    "date": "2012-06-16",
    "postcode": "RH6"
  },
  {
    "title": "Fitting of new isolation valve to water leak.",
    "text": "Very quick to arrive efficient service. I would recommend this company",
    "date": "2012-06-16",
    "postcode": "BN1"
  },
  {
    "title": "Two dripping taps repaired, advice on one more",
    "text": "Quick and courteous, honest advice given, would recommend.",
    "date": "2012-06-16",
    "postcode": "CR3"
  },
  {
    "title": "Replacement of kitchen sink waste pipe",
    "text": "Information on work necessary to stop leak and we accept advice on work to be done which was very satisfactory",
    "date": "2012-06-16",
    "postcode": "RH1"
  },
  {
    "title": "Leak in bathroom.",
    "text": "Very polite from start - helpful and pleasant. Job done quickly and with minimum fuss",
    "date": "2012-06-16",
    "postcode": "RH1"
  },
  {
    "title": "Clearing drain and blockage from kitchen sink",
    "text": "Very helpful and useful advice given to prevent repeat problems",
    "date": "2012-06-16",
    "postcode": "RH6"
  },
  {
    "title": "CCTV drain survey and clear blockage",
    "text": "Couldn't fault service etc. Best of all gave advice and estimate should any further work be necessary",
    "date": "2012-06-16",
    "postcode": "BN3"
  },
  {
    "title": "Gully clean and maintenance",
    "text": "I thought the service was first class, the problem was explained fully",
    "date": "2012-06-16",
    "postcode": "TN13"
  },
  {
    "title": "Boiler leaking etc",
    "text": "Very good service and very good pri.",
    "date": "2012-06-16",
    "postcode": "RH19"
  },
  {
    "title": "Unblocking an outside drain",
    "text": "Such care and concern - excellent job",
    "date": "2012-06-16",
    "postcode": "RH6"
  },
  {
    "title": "Replacing sink taps",
    "text": "Very efficient and helpful plumber",
    "date": "2012-06-16",
    "postcode": "BN7"
  },
  {
    "title": "Blocked drain",
    "text": "Very good at his work. I would recommend this company.",
    "date": "2012-06-16",
    "postcode": "RH13"
  },
  {
    "title": "Shower fixed.",
    "text": "Quick, efficient, thoroughly explained the job and completed at good costing",
    "date": "2012-06-16",
    "postcode": "RH12"
  },
  {
    "title": "Re-build gully surround",
    "text": "Very professional and helpful. Also attended quickly. All operatives nicely polite",
    "date": "2012-06-16",
    "postcode": "RH4"
  },
  {
    "title": "Blocked outside drain",
    "text": "Quick response to call and quick resolution too. Also given advice for future work",
    "date": "2012-06-16",
    "postcode": "RH6"
  },
  {
    "title": "Drains cleared and checked with camera",
    "text": "Very good response. I would recommend this company",
    "date": "2012-06-16",
    "postcode": "RH17"
  },
  {
    "title": "Replaced section of drain",
    "text": "Very friendly staff, good manners, happy with the service",
    "date": "2012-06-16",
    "postcode": "RH15"
  },
  {
    "title": "Cleared a blocked gulley",
    "text": "After struggling for several days to clear myself I called in EVO. They responded quickly and provided a faultless service. Thank you!",
    "date": "2012-06-16",
    "postcode": "RH17"
  },
  {
    "title": "Unblock drain and cleanse area",
    "text": "Brilliant timely response to a very messy problem.",
    "date": "2012-06-16",
    "postcode": "BN6"
  },
  {
    "title": "Boiler Installation",
    "text": "EVO Home Services Ltd gave an excellent service, very pleased with work done. We will use hem in the future. I would recommend this company",
    "date": "2012-05-19",
    "postcode": "RH12"
  },
  {
    "title": "Unblock toilet",
    "text": "Very pleasant man. Prompt, tidy service completed at a very reasonable price.",
    "date": "2012-05-16",
    "postcode": "BR6"
  },
  {
    "title": "Replace valves on cold water storage system",
    "text": "First class service from a first class company. Thanks once again EVO!",
    "date": "2012-05-16",
    "postcode": "BN6"
  },
  {
    "title": "Gas safety certificate",
    "text": "Reliable and efficient service",
    "date": "2012-05-16",
    "postcode": "RH12"
  },
  {
    "title": "Replacement drain urinals, make good old drain",
    "text": "Excellent service. I had been worried about getting the work done because of the various difficulties but Harvey was great and the job was made to look straight forward to my relief.",
    "date": "2012-05-16",
    "postcode": "TN13"
  },
  {
    "title": "Estimate for poor pressure but engineer diagnosed problem",
    "text": "Good service from call to completion. Engineer very friendly and helpful. Gave quote incase further work needed.",
    "date": "2012-05-16",
    "postcode": "RH20"
  },
  {
    "title": "Boiler changed/installed",
    "text": "This company is faultless, not only completed work on time but was polite and courteous, very punctual I am satisfied",
    "date": "2012-05-04",
    "postcode": "CR3"
  },
  {
    "title": "Worcester service and towel rail attention",
    "text": "Work was efficient and very helpful. Good work. Company is thoroughly recommended.",
    "date": "2012-05-03",
    "postcode": "BN11"
  },
  {
    "title": "Complete Service",
    "text": "Service was completed with the minimum of fuss and with the maximum efficiency. Would recommend Steve to interested parties.",
    "date": "2012-04-17",
    "postcode": "BN17"
  },
  {
    "title": "Shower drain blockage cleared",
    "text": "Cannot rate Harvey and EVO more highly. Did a first class job where previous contractors had failed. Very good, excellent in fact.",
    "date": "2012-04-16",
    "postcode": "RH4"
  },
  {
    "title": "Repaired broken toilet",
    "text": "This was an emergency call-out. My call was answered immediately and work completed on the same day. Harvey was polite, worked swiftly and completed the job within the estimated timeframe",
    "date": "2012-04-12",
    "postcode": "BN3"
  },
  {
    "title": "Clearing a blocked drain",
    "text": "Very high level of service, pleasant attitude, helpful. Work done efficiently",
    "date": "2012-04-04",
    "postcode": "RH17"
  },
  {
    "title": "Replace boiler",
    "text": "Very conscientious and worked hard to make the job a good one. I would recommend this company",
    "date": "2012-03-26",
    "postcode": "GU6"
  },
  {
    "title": "Clearance of blocked toilet.",
    "text": "I would recommend this company. Very tidy and professional and meticulous in their approach",
    "date": "2012-03-16",
    "postcode": "RH16"
  },
  {
    "title": "New float valve to cistern",
    "text": "Prompt and efficient service. Would recommend.",
    "date": "2012-03-16",
    "postcode": "RH10"
  },
  {
    "title": "Cleared blocked drain",
    "text": "Harvey was very capable. Identified where the problem was, and dealt with it well",
    "date": "2012-03-16",
    "postcode": "RH12"
  },
  {
    "title": "Supply and install replacement immersion",
    "text": "First class service. Job was completed quickly and with no fuss. I would definitely recommend this company",
    "date": "2012-03-16",
    "postcode": "RH19"
  },
  {
    "title": "Internal overflow fitted, toilet re-mounted",
    "text": "Engineer polite, efficient and discreet. Have already booked in for further work",
    "date": "2012-03-12",
    "postcode": "RH1"
  },
  {
    "title": "Cleared blocked soil pipes manhole",
    "text": "Really efficient work, completed within 20 minutes.",
    "date": "2012-03-12",
    "postcode": "GU6"
  },
  {
    "title": "Cleared blocked toilet and drain",
    "text": "A very well run company, giving, excellent service and very reliable",
    "date": "2012-03-05",
    "postcode": "BN6"
  },
  {
    "title": "Fixed leaks in pipe",
    "text": "The plumber was courteous, efficient and expert at his job. Highly recommended",
    "date": "2012-03-01",
    "postcode": "RH14"
  },
  {
    "title": "Cleared blocked kitchen drain",
    "text": "They came round and cleared our drain which the kitchen sink runs into - very efficient, job done quickly, would use again",
    "date": "2012-02-28",
    "postcode": "RH6"
  },
  {
    "title": "Repair to water pipe",
    "text": "Very good. Arrived when they said he would. Fixed problem quickly with minimal fuss and at a very good price.",
    "date": "2012-02-26",
    "postcode": "RH12"
  },
  {
    "title": "Serviced an Ariston boiler",
    "text": "This was the 3rd time i'd used this company for different things. Work was done thoroughly by a very pleasant man who was happy to answer all of my questions",
    "date": "2012-02-21",
    "postcode": "RH1"
  },
  {
    "title": "Clearance of blocked drains",
    "text": "EVO cleared our blocked drains blocked drains very efficiently at a reasonable price. I would recommend this company as they are so reliable.",
    "date": "2012-02-16",
    "postcode": "RH6"
  },
  {
    "title": "Frozen water meter",
    "text": "Excellent work. worked very hard to sort out my problem and restore water supply thank you. I would recommend this company",
    "date": "2012-02-11",
    "postcode": "RH6"
  },
  {
    "title": "Replaced faulty tap and basin was leaking",
    "text": "Lovely lad! Great attitude. Excellent service. I would recommend this company",
    "date": "2012-02-10",
    "postcode": "BN20"
  },
  {
    "title": "Broken outside tap fixed",
    "text": "Extremely impressed with efficiency and professional. Thank you. Would recommend and call again.",
    "date": "2012-02-04",
    "postcode": "RH14"
  },
  {
    "title": "Unblock drain and advise on other issues.",
    "text": "Harvey did an excellent job. Was very efficient and cleaned up afterwards. He also was able to advise on issues we have on the boiler and radiators in the house. Very knowledgeable. Would definately recommend.",
    "date": "2012-01-31",
    "postcode": "BN6"
  },
  {
    "title": "Leaking water joint.",
    "text": "“Phoned in a panic at 4pm and a plumber arrived at 4:45pm, wonderful fist class service!",
    "date": "2012-01-23",
    "postcode": "RH6"
  },
  {
    "title": "Drain down heating System",
    "text": "First class service. Arrived dead on time, which was great, and carried out the work in a calm, professional manner. Harvey was extremely pleasant and approachable. Already booked in for further works.",
    "date": "2012-01-23",
    "postcode": "RH4"
  },
  {
    "title": "Water pipes in bathroom had been drilled into by a drain",
    "text": "Harvey completed his work swiftly and courteous and explained the problem. I trust the new piping will remain watertight. I would recommend this company",
    "date": "2012-01-19",
    "postcode": "RH17"
  },
  {
    "title": "Fixed broken stop cock",
    "text": "Very reliable, polite and helpful. Very impressed. Would definitely use again and recommend to family and friends",
    "date": "2012-01-17",
    "postcode": "TN8"
  },
  {
    "title": "Valve replacement and new machine fitted",
    "text": "Excellent First class job. Had previously been let down by several plumbing companies, but EVO were 100 percent reliable and professional in every aspect",
    "date": "2011-12-09",
    "postcode": "RH3"
  },
  {
    "title": "Bpoiler service",
    "text": "Punctual, clean and tidy and courteous.",
    "date": "2011-06-03",
    "postcode": "RH12"
  },
  {
    "title": "Installed new boiler",
    "text": "Fantastic, the company installer (Steve) was extremely capable, clean, tidy, professional, exact, nothing was any trouble, he explained exactly what he was going to do and he did it to the letter, any concerns I had were catered for and the solution explained in non technical terms. The quote he supplied was very competitive and he honoured it. I would not hesitate to use this company again and also recommend this company to others.",
    "date": "2011-05-28",
    "postcode": "RH12"
  },
  {
    "title": "Boiler/water tank leak, Toilet Cistern leak",
    "text": "Steve Identified the problems I was having straight away, explained the cause and what needed to be done simply for me and carried out the work smoothly and skillfully. I have had many experiences with plumbers over the years and will undoubtedly contact Steve above any other if I have any further problems in the future. In addition, I had several questions about other things that were causing me problems with my heating and hot water etc and was listened to helped without an issue. All in all a very personable, thorough and quality service...Thanks",
    "date": "2011-05-21",
    "postcode": "BN1"
  },
  {
    "title": "Repair of central heating leak, re-plumbing and masonry repair",
    "text": "Steve from 1EVO Plumbing and Heating is a true tradesman who shows skill and integrity - a rare find. Highly recommended",
    "date": "2011-04-20",
    "postcode": "GU1"
  },
  {
    "title": "Repair to leaking water pipe",
    "text": "The work was carried out in a professional manner, extremely pleasant gentleman. I was very pleased with the work and his reasonable charge.",
    "date": "2011-04-13",
    "postcode": "RH12"
  },
  {
    "title": "New boiler installed",
    "text": "A diligent and trustworthy company, I will be using them again for servicing of the new boiler.",
    "date": "2011-04-09",
    "postcode": "RH10"
  },
  {
    "title": "boiler breakdown repair",
    "text": "Very conscientious and determined to find fault with our boiler which he did! Very happy with both service and pricing",
    "date": "2011-04-01",
    "postcode": "RH13"
  },
  {
    "title": "New boiler and powerflush",
    "text": "Very pleased with the service we received. We were kept informed throughout the entire process and were charged as quoted. Very impressed all round.",
    "date": "2011-03-25",
    "postcode": "BN15"
  },
  {
    "title": "Gas safety, repair and general service",
    "text": "We invited EVO for a landlords gas safety certificate to be done. They fixed my boiler repair of the Myson Appollo boiler. They were recommended to me by friends and were brilliant",
    "date": "2011-03-08",
    "postcode": "RH2"
  },
  {
    "title": "Leaking pipe on stack sealed",
    "text": "Assessed the job accurately, sorted it out, was efficient and approachable. He came at short notice and out of hours to do this work so we were very grateful.",
    "date": "2011-02-09",
    "postcode": "RH2"
  },
  {
    "title": "boiler repair",
    "text": "Very polite, and hard working. Talked me through the whole thing and was honest and up front. I would not hesitate to recommend them",
    "date": "2011-01-06",
    "postcode": "RH12"
  },
  {
    "title": "Unblocked toilet drain pipe to sewer",
    "text": "Excellent, polite, tidy, first class job. I would recommend this company",
    "date": "2011-01-06",
    "postcode": "RH17"
  },
  {
    "title": "Hot water not working - replaced battery",
    "text": "They came round to my fix my boiler, it was fast and efficient. He is prompt and professional.",
    "date": "2011-01-04",
    "postcode": "RH1"
  },
  {
    "title": "Dealt with broken down boiler",
    "text": "Very fast response, excellent job and very helpful and courteous plumber. Thoroughly recommend",
    "date": "2010-12-03",
    "postcode": "RH2"
  },
  {
    "title": "Boiler service and repair",
    "text": "Steve was polite, honest and explained everything he was doing. I feel he went out of his was to finalise the job.",
    "date": "2010-12-01",
    "postcode": "RH14"
  },
  {
    "title": "Central heating boiler replacement",
    "text": "“An excellent boiler replacement by a friendly capable engineer",
    "date": "2010-12-01",
    "postcode": "KT22"
  },
  {
    "title": "Gas boiler fault repair",
    "text": "My boiler needed a new Circuit Board and Gas Valve fitting. It was fitted quickly, efficiently and without fuss. The engineer was experienced, knowledgeable, extremely helpful and willing to answer any questions I had. The costs of the repair were very reasonable. I wouldn't hesitate to recommend this company and I have since arranged an annual boiler servicing with them. My heating/hot water is now working better and more efficiently than it ever has. Very happy",
    "date": "2010-11-20",
    "postcode": "RH14"
  },
  {
    "title": "Boiler and heating upgrade",
    "text": "EVO plumbing and heating, had come out to my property to install a new boiler, I was impressed with the service, but more impressed when 3 weeks later my water tank burst and there response was immediate.",
    "date": "2010-11-15",
    "postcode": "RH10"
  },
  {
    "title": "Mended boiler and serviced",
    "text": "Very polite and helpful. Really trusted them to do a good reasonably priced job",
    "date": "2010-11-05",
    "postcode": "RH4"
  },
  {
    "title": "boiler service and thermostat change",
    "text": "The engineer knew his job well, sorted out all issue in a timely manner. Thank you",
    "date": "2010-10-15",
    "postcode": "RH10"
  },
  {
    "title": "Hot water cylinder change",
    "text": "I'm an old lady in my nineties, so I am wary of tradesmen who come to my door, EVO are now my first call repair. They were just brilliant with their services, especially Steve the engineer",
    "date": "2010-10-13",
    "postcode": "RH12"
  },
  {
    "title": "Heating and hot water breakdown",
    "text": "We had to much hot water at boiling point. I had got four plumbing firms I and did not have a clue. EVO plumbing and heating who were Gaslite, fixed the problem straight away.",
    "date": "2010-10-02",
    "postcode": "RH12"
  },
  {
    "title": "Fittd new boiler parts",
    "text": "Worked diligently to identify boiler problems and anxious to be seen to provide an excellent service",
    "date": "2010-05-24",
    "postcode": "RH6"
  },
  {
    "title": "Fit new Worcester boiler",
    "text": "Steve is friendly - knowledgeable - helpful - professional - efficient and tidy. Would highly recommend, a pleasure to deal with",
    "date": "2010-05-19",
    "postcode": "RH15"
  },
  {
    "title": "Gas boiler repair",
    "text": "Very flexible re timings, pleasant and polite to deal with, high quality work. Strongly recommend",
    "date": "2010-04-01",
    "postcode": "RH10"
  },
  {
    "title": "New boiler and cylinder",
    "text": "They were very professional in boiler installation and cylinder change, I would recommend this company from any others in Horsham",
    "date": "2010-03-30",
    "postcode": "RH12"
  },
  {
    "title": "Check for gas leak",
    "text": "Friendly - knowledgeable - helpful - professional - efficient and",
    "date": "2010-03-30",
    "postcode": "RH10"
  },
  {
    "title": "Gas hob connection",
    "text": "Simply excellent! Professionally completed with a personal attention to detail.",
    "date": "2010-03-30",
    "postcode": "RH10"
  },
  {
    "title": "hot water cylinder repair",
    "text": "EVO fixed a plumbing repair on my hot water cylinder. I had strugglerd to find anyone willing and able to do this work, but EVO resolved the issue without any issues.",
    "date": "2010-03-26",
    "postcode": "BN1"
  },
  {
    "title": "boiler fault find and repair",
    "text": "EVO Home Services had come round and fixed a fault in my combination boiler that had been running faulty for weeks. very good service.",
    "date": "2010-03-24",
    "postcode": "BN1"
  },
  {
    "title": "Faul find on combination boiler",
    "text": "Knowledgeable and efficient on the work on the boiler. Friendly and tidy. Would recommend him to others",
    "date": "2010-03-11",
    "postcode": "GU1"
  },
  {
    "title": "Install new radiator in the house",
    "text": "The work was carried out exactly to my requirements. Arrived as promised and was very pleased with the standard of work carried out. Very good on price and would highly recommend them",
    "date": "2010-03-07",
    "postcode": "RH10"
  },
  {
    "title": "Boiler repairs and service",
    "text": "Very happy with all aspects of the work done. We will use EVO Home Services again",
    "date": "2010-03-04",
    "postcode": "RH4"
  },
  {
    "title": "Boiler service",
    "text": "Would highly recommend his company - 1st class service and experience",
    "date": "2010-03-03",
    "postcode": "KT17"
  },
  {
    "title": "Fault boiler fault and fix",
    "text": "EVO were the first of many engineers to find the fault in my boiler and has helpful fix the boiler in my nans house and found them to be good",
    "date": "2010-03-03",
    "postcode": "RH19"
  },
  {
    "title": "Installed a heating system",
    "text": "Excellent service, estimate for the work and time scale was spot on",
    "date": "2010-03-01",
    "postcode": "GU7"
  },
  {
    "title": "Boiler fault finding",
    "text": "They solved a 2 year fault that many big names could not find. I would recommend them as they were reasonable in price and high in quality",
    "date": "2010-02-25",
    "postcode": "RH12"
  },
  {
    "title": "Installatioin of heating valve",
    "text": "Work was carried out efficiently and everything was explained clearly",
    "date": "2010-02-12",
    "postcode": "RH16"
  },
  {
    "title": "Boiler installation",
    "text": "EVO plumbing and heating gave an excellent service, very pleased with work done. We will use them in the future. I would recommend this company.",
    "date": "2009-01-03",
    "postcode": "RH13"
  },
  {
    "title": "Repair to our worcester boiler",
    "text": "We had a permanent drip of water running out of our boiler and had been told by another plumbing company that the boiler needed replacement as it would be too expensive to repair. We had called in EVO to resolve another leak under our kitchen sink, and while repairing this leak Steven from EVO noticed the leak from the boiler. We told him what the other company had said, but Steven was able to remove and repair the part causing the problem. So glad we have found a company who operate an honest and quality service.",
    "date": "0202-10-01",
    "postcode": "RH12"
  },
  {
    "title": "Plumbing in new gas hob and performing necessary certification",
    "text": "After being let down several times by another company we contacted EVO plumbing and heating via checkatrade as the number and quality of their review mad them stand out from all others. Work was completed on time and within the agreed price despite it taking longer than originally expected.",
    "date": "0202-10-01",
    "postcode": "RH10"
  },
  {
    "title": "Fix broken toilet flush",
    "text": "Service was fast and efficient and fixed the problem within a couple of hours, leaving everything tidy",
    "date": "0202-07-07",
    "postcode": "GU6"
  }
]
